[
"25th April 2013, London: - Travis relaunch the label which propelled their debut 10&rdquo; EP release nearly two decades ago for their seventh album &lsquo;Where You Stand&rsquo;, out August 19th on Red Telephone Box via Kobalt Label Services (KLS).\n\nThe band&rsquo;s manager, Ian McAndrew of Wildlife Entertainment said this of the partnership: &quot;We are delighted to be working alongside Kobalt Label Services for the forthcoming album release from Travis. Kobalt offer a truly global distribution and marketing network, an incredibly focused team and particular expertise in digital marketing.\n\n&ldquo;Our team headed by Emma Greengrass will help manage the project alongside KLS, with support from the Wildlife Entertainment management office.  The release will be delivered in the UK by a cast of first class independent promotion staff including Joe Bennett (national radio); Barbara Charone (PR); Louisa Worskett (online PR); Steve Tandy (regional radio); Karen Williams (TV) and Tom Roberts at Shoot; while internationally we will plug into KLS offices and partners around the world.&rdquo;\n\nPaul Hitchman, Managing Director of Kobalt Label Services, said: &ldquo;We are hugely proud to be working with Travis, Wildlife Entertainment and their fantastic team on &lsquo;Where You Stand&rsquo;. Our label services set-up is designed to flexibly support and facilitate the creative and commercial vision of our clients on a worldwide basis, and that partnership approach is perfectly illustrated by the way we are working with Travis.&quot;\n\nSounding and looking more invigorated than ever, the Scottish band, with &ldquo;Super Swede&rdquo; Michael Ilbert (The Hives/The Cardigans/The Wannadies) on production duties, are now back after a five year hiatus with the follow-up to 2008&rsquo;s &lsquo;Ode to J. Smith&rsquo;. \n\nThe album was written and recorded across London, Norway, New York, and took in a production stint at Berlin&rsquo;s legendary Hansa Studios. This was enjoyed particularly by the band&rsquo;s Bowie-fanatic Dougie Payne, who revelled in layering the famous synthesisers of &lsquo;Low&rsquo; fame onto &lsquo;Different Room&rsquo;.\n\nTravis are singer/guitarist Fran Healy, bassist Dougie Payne, guitarist Andy Dunlop and drummer Neil Primrose.\n\nhttp://www.travisonline.com\n\nKobalt Label Services&rsquo; first international album release, &ldquo;Push The Sky Away&rdquo; by Nick Cave &amp; the Bad Seeds, recently debuted at number one in seven countries and top four in thirteen other countries. Other KLS projects include the forthcoming album by Pet Shop Boys, the debut album &quot;Comfort&quot; from Maya Jane Coles and NKOTB&rsquo;s latest album &quot;10&quot;. \n\nAbout Kobalt Label Services (KLS)\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, sync licensing, D2C and social media services. Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt&rsquo;s proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n"
]