[
"LOS ANGELES and NEW YORK (May 20, 2013) &ndash; Ever-blazing new trails to push traditional boundaries for music to be heard, marketed and distributed, PRINCE has announced he&rsquo;s created a unique new partnership with leading global independent music services company Kobalt Music Group (Kobalt), which, for the first time, will give him the ability to self-release music globally with a new level of flexibility and freedom.\n\nThrough the ground-breaking venture, the seven-time Grammy Award-winner and multi-platinum artist, will release a slate of music by new artists, as well as PRINCE recordings and other PRINCE-produced material by utilizing Kobalt&rsquo;s label services for marketing and distribution and other services.  PRINCE will provide artist development and recording services for newly signed artists that Kobalt will market and distribute globally through their wholly-owned global digital platform and network of physical distribution partners.\n\nWith a history of innovation in releasing his music, whether through newspaper distribution, at concerts, via his exclusive clubs or through direct deals with retail, PRINCE is embracing a new label services model to bring new music to the world without the confines of the old-school label system.\n\n&ldquo;This new venture gives PRINCE the flexibility and freedom he&rsquo;s always sought in a label partner. We&rsquo;re providing a high level of diverse services that will be particularly customized to his vision for each release, allowing the world to experience more music from PRINCE and his creative community,&rdquo; said Richard Sanders, President of Kobalt.\n\nFresh off a sold out nine-city west coast club tour with his highly acclaimed backup band 3RDEYEGIRL, PRINCE yesterday received the prestigious BILLBOARD ICON AWARD during the live broadcast of the BILLBOARD MUSIC AWARDS.  This summer he will headline the Montreux Jazz Festival as well as do select dates in Europe and in the U.S.\n\nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases."
]