[
"(NEW YORK and LONDON) May 9, 2013 -- Willard Ahdritz, Founder and CEO of Kobalt Music Group (Kobalt), today launched Kobalt&rsquo;s next transparent, interactive client portal, the company&rsquo;s most radical leap forward to date in technology and design.\n\nThe new Kobalt Portal presents a number of unique, transformative features.  As a first for the industry, clients can see usage data and royalties earned on YouTube user-generated content and watch the associated video from their portal.  Kobalt plans to roll out this unique level of transparency for all key digital service providers globally.  Clients can also follow the synch process in real time globally and not only see the incomes generated, but also the videos of their music when licensed for advertising, TV, film trailers, games and other media.  Among other key new features are a real-time, customizable global activity feed and action center that notifies clients of key events and items to address in their catalogue.\n\nAhdritz said: &ldquo;We expect digital revenues for Kobalt&rsquo;s rights owners to increase significantly as a direct result of our new technology integration.  With total transparency and control for our clients, the new portal is a game-changer for the music industry.  Building on our existing platform and proven technology, this is one of our most significant technology achievements to date, offering the first completely visual and fully interactive client communication platform.&rdquo;\n\nA new clean design improves the user experience and interface for Kobalt clients.  Detailed, dynamic royalty analysis tools are supported by quick and easy-to-use graphics.  Key income and product data are prominently featured, and it is easy for clients to query their catalogue in full detail by work, rights type, territory, product and licensee.  Clients can enter new works and product data, allowing for two-way communication.  The new portal is also customizable; each client can set their own reporting preferences and choose which activity alerts and notifications they receive.\n\nThe new Kobalt Portal will be rolled out globally through May 2013.\n\nAbout Kobalt Music Group\n\nKobalt Music Group Ltd. (Kobalt), is the leading global, independent music publishing company and music services company, offering unparalleled transparency, online copyright administration and royalty tracking, creative and synch/licensing services, weekly online balances, digital collections and advances to writers, publishers, performers and other rights holders. With 180 employees in offices in London, New York, Nashville, Los Angeles, Berlin, Sydney and Stockholm, as well as agents in over 20 major territories, Kobalt administers more than 300,000 copyrights worldwide on behalf of over 1,500 content holders, including the world's top songwriters, artists and other music publishers. Kobalt counts among its clients Paul McCartney and MPL Communications, Disney Music Group, Max Martin, Dr. Luke, Dave Grohl, Lady Antebellum, Stevie Nicks, No Doubt, Ryan Tedder, Noah Shebib, Thom Yorke, Bj&ouml;rk, The Hives, The Lumineers, Richard Ashcroft, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Dave Stewart, Joss Stone, among many others. In 2013, Kobalt Music Group was honored as the first ASCAP Publishing Administrator of the Year and by receiving Independent Publisher of the Year at the Music Week Awards (UK) for the fifth consecutive year.\n\n"
]