[
"LONDON, UK -- Willard Ahdritz, Founder and CEO of Kobalt Music Group (Kobalt), today announced the company has formally launched its neighbouring rights division, Kobalt Neighbouring Rights Limited (KNRL). &#8232;Top experienced society executives have been brought on to run the KNRL division.\n\nKobalt's unique, modern and transparent approach to neighbouring rights is geared to simplify a very complex process, maximize earnings and speed up payments to those who are entitled to remuneration, including performers (featured and non-featured) and producers (i.e. the record labels). \n\nWith more efficient processes and the existing unique global relationship database offering the level of royalty tracking detail, accuracy and faster distributions, Kobalt management believe clients that are eligible for neighbouring rights payments will experience at least 25% uplift in neighbouring rights collections equal to the track record already set by Kobalt's publishing business.\n\nKNRL offers a bespoke service with repertoire/database quality control in each territory and utilizes Kobalt's advanced direct collections strategy. In addition, Kobalt is offering tailor-made pipeline advances to clients qualifying for neighbouring rights payments as well as competitive rates. \n\nHans van Berkel, Founder and former CEO of leading neighbouring rights society SENA, has been appointed as KNRL Executive Chairman. Sabine Jones, who previously ran neighbouring rights societies PAMRA (UK) and SWISSPERFORM, has joined as KNRL Managing Director. Upon making the announcement, Willard Ahdritz, CEO and Founder of Kobalt Music Group said: &quot;I am very excited that Hans van Berkel and Sabine Jones, some of the most experienced and well respected society executives, have teamed up and joined Kobalt to build our global neighbouring rights business.\n\nThe combination of &quot;the Kobalt approach&quot; and unique technology platform, together with their superior reputation, expertise and range of contacts, will set another new standard by delivering increased revenues and more tailored services to our clients.\n\nReporting to Ahdritz, van Berkel is one of the most experienced neighbouring rights executives in the world with a strong background in management and accounting. After working for PolyGram in various countries (and continents), he founded and ran Dutch Neighbouring Rights society SENA for 18 years, managing international collections for the Rolling Stones, Elton John, Andrea Bocelli and many others. Under van Berkel's tenure, SENA became to go-to neighbouring rights society due to its reputation and high results. The society had the highest collecting revenue per capita of all neighbouring rights societies and was ranked as the No.6 society in the world (Billboard July 24, 2010). \n\n&quot;Kobalt's business model and corporate values of transparency, integrity and client service focus parallels the values that fueled the success of SENA to be one of the top neighbouring rights societies in the world,&quot; added van Berkel, &quot;Therefore I am very excited about now working on a global level in a commercial environment focused on better servicing our clients and playing a leading role in the evolution of Kobalt's neighbouring rights division.&quot;\n\nKNRL's new Managing Director Sabine Jones is reporting to van Berkel and managing KNRL operations. With a linguistic and managerial background, Jones previously managed UK performing artists' society PAMRA and Swiss neighbouring rights society SWISSPERFORM. Prior to her work in neighbouring rights, Jones worked for both GEMA, the German performing right society, and PRS, the UK performing right society. \n\nIn addition, Matthew Seal, a former PAMRA and PPL Accounts and Client Relations Manager, has joined Kobalt as KNRL Manager. Seal has extensive experience in client services and well established contacts with managers, accountants and other artist representatives.\n\nAs part of the announcement, van Berkel additionally announced that several major artists and producers have already concluded deals with KNRL and collections are well underway. Kobalt's neighbouring rights processes are in a full scale operational rollout of services worldwide. With 21 global neighbouring rights society relationships already established and clients' direct society registrations, tracking and collections in process, KNRL will execute neighbouring rights payments within 31 days from the end of the month when the money was received. KNRL's first payments to new clients will be issued on January 31, 2012.\n\nAbout Neighbouring Rights\n\nIn most territories neighbouring rights, a form of copyright, provide for equitable remuneration payable to performing artists, musicians, record labels (i.e. producers), who contribute to a commercially released sound recording. \n\nThe majority of neighbouring rights remuneration comes from broadcasts and public performances of a commercially released sound recording (i.e. background music). Other remuneration sources include private copying, rental and lending and digital transmissions (such as satellite and cable retransmission). \n\nThe procedure of registering, processing and receiving global neighbouring rights remuneration for performing artists (featured and non-featured performers), and producers (i.e. the record labels) differs substantially from the process of copyright administration for publishing rights. In neighbouring rights, payment criteria, registration processes and finally collecting the monies due to the rights holders is a very complex maze and different in nearly every territory. The number of neighbouring rights societies varies in each country. Each society has its own rules related to the collection and distribution of remuneration.\n"
]