[
"LOS ANGELES, CA -- Kobalt clients received top honors at the ASCAP (the American Society of Composers, Authors and Publishers) 28th Annual Pop Music Awards, which was held at the Renaissance Hollywood Hotel in Los Angeles, CA.\n\nThe star-studded event, which was attended by hundreds of songwriters, recording artists and music industry leaders, paid special tribute to Kobalt clients Dr. Luke, Max Martin and Band of Horses and honored the songwriters and publishers behind some of today's most popular music. \n\nThe top awards were presented to two Kobalt clients Lukasz &quot;Dr. Luke&quot; Gottwald and Max Martin, who were both named Songwriters of the Year. \n\nKobalt client Band of Horses, which consists of Ben Bridwell, Creighton Barrett, Ryan Monroe, Tyler Ramsey and Bill Reynolds, received ASCAP's Vanguard Award which recognizes the impact of musical genres that help shape the future of American music. \n\nASCAP Pop Awards were also presented to Kobalt songwriters and publishers of ASCAP's most performed pop songs of 2010 including:\n\n&quot;CALIFORNIA GURLS&quot; Max Martin/Maratone AB; Lukasz &quot;Dr. Luke&quot; Gottwald/Kasz Money Publishing; Katy Perry/Prescription Songs;\n\n&quot;DJ GOT US FALLIN' IN LOVE&quot; Max Martin/Maratone AB; &quot;DYNAMITE&quot; Max Martin/Maratone AB; Lukasz &quot;Dr. Luke&quot; Gottwald/Kasz Money Publishing; \n\n&quot;EMPIRE STATE OF MIND&quot; Al &quot;Al Shux&quot; Shuckburgh/Global Talent Publishing; \n\n&quot;TEENAGE DREAM&quot; Max Martin/Maratone AB; Lukasz &quot;Dr. Luke&quot; Gottwald/Kasz Money Publishing; Katy Perry/Prescription Songs; \n\n&quot;WHATAYA WANT FROM ME&quot; Max Martin/Maratone AB; \n\n&quot;ACCORDING TO YOU&quot; Steve Diamond/Terri &amp; Steve's Music; \n\n&quot;ALREADY GONE&quot; Ryan Tedder/Write 2 Live Publishing; Kelly Clarkson/Songs For My Shrink; \n\n&quot;CLUB CAN'T HANDLE ME&quot; Mike Caren/Serious Scriptures; Carmen Michelle Key/Carmen Michelle Music; \n\n&quot;PARTY IN THE USA&quot; &#8232;Lukasz &quot;Dr. Luke&quot; Gottwald/Kasz Money Publishing; \n\n&quot;TIK TOK&quot; Lukasz &quot;Dr. Luke&quot; Gottwald/Kasz Money Publishing; \n\n&ldquo;YOUR LOVE IS MY DRUG&quot; Joshua &quot;Ammo&quot; Coleman/Each Note Counts/Prescription Songs. \n"
]