[
"LONDON, UK -- Kobalt Music Group Ltd. (Kobalt) today announced the launch of Kobalt's new Label Services division propelled by the company's acquisition of AWAL Limited (AWAL), a leading digital distribution and marketing services provider that directly distributes and promotes the recorded music of more than 5,000 independent artists and labels. \n\nDuring the coming year Kobalt Label Services division will roll out next generation services for artists and labels worldwide, empowering recording owners with a similar level of control, transparency, accuracy and efficiency as Kobalt has successfully provided to songwriters and other owners of copyrights. The new services will enable Kobalt and AWAL clients the opportunity to maximize revenues from a wide range of digital retail, subscription, D2C and social media services, and benefit from advanced data analytics.\n\nThrough the acquisition Kobalt obtains access to AWAL's worldwide distribution network of more than 200 digital retail partners, including iTunes, Amazon, Spotify, eMusic, Rhapsody, 7Digital, Beatport, Deezer, Nokia and 247 among others. AWAL, which will remain a standalone company within Kobalt Music Group, additionally offers clients digital retail sales and premium marketing services, aggregated sales reporting from digital sales, an online client dashboard, a synch licensing platform and BuzzDeck data analytics. \n\n&quot;Our expansion and launch of Kobalt's Label Services division and the acquisition of AWAL is a response to our clients' needs and to a major shift in where we see the market is heading,&quot; said Willard Ahdritz, CEO and Founder of Kobalt Music Group, &quot;With an efficient platform, direct distribution channel, a successful track record and strong management, AWAL was built on similar core values of transparency and integrity as Kobalt was. This acquisition is a building block in Kobalt's long-term strategy of creating a new kind of full music service alternative for rights holders including artists and labels.&quot; \n\nAs part of the launch, Ahdritz announced the appointment of Paul Hitchman as Managing Director of Kobalt Label Services, effective February 1st. &quot;I am very pleased to welcome Paul Hitchman to the company as Managing Director of Kobalt Label Services division. Having known Paul for 10 years, he has a wealth of experience and a successful track record as a pioneer and innovator in the digital music market. \n\nHe brings to Kobalt broad expertise and will be a tremendous asset to our new division as we roll out new Kobalt services and build upon the existing AWAL operations.&quot; Hitchman has been co-founder of three of Europe's most innovative and progressive digital music companies, Playlouder, MSP and CI. Playlouder was one of the first legal download services in the U.K. and launched ground-breaking, download-only releases with major artists and web streaming of live events, including Glastonbury and Reading Festivals. \n\nIn 2003 Paul co-founded Consolidated Independent (CI), a leading provider of digital supply chain services to many of the world's premier indie music companies including Beggars Group, PIAS, RedEye Distribution, Na&#297;ve, Because Music, Razor &amp; Tie, Windup Records and Demon Music Group. Media Service Provider (MSP) is an award-winning white label consumer music platform that powers digital music subscription services for ISPs, mobile operators and other network operators. Prior to founding Playlouder in 2000, Paul worked in A&amp;R at Warner Music UK and was A&amp;R/marketing consultant to Arista/BMG UK, where he also had a label deal for his label, Sugar Records. \n\nAWAL's management team of Kevin Bacon, Jonathan Quarmby, Denzyl Feigelson and Paul Bower will remain intact reporting to Paul Hitchman. Furthermore, Kobalt plans to invest in AWAL, expanding its staff, suite of services and client base. AWAL will continue to operate independently from its London and Sheffield offices. Commented Bacon and Quarmby, AWAL Co-Founders: &quot;Becoming a part of the Kobalt Music Group is a natural fit and strategic move for the long term future of AWAL, our clients and employees. Kobalt has a history of innovation, growth and solid leadership and has made a firm commitment to investing in expansion of our global infrastructure and service offerings which will further benefit our existing clients.&quot; \n\n&quot;Kobalt is a unique merger of rights management, innovative distribution and marketing, which is exactly the culmination of AWAL's original vision,&quot; said Denzyl Feigelson, who founded and launched AWAL in 1996 and serves as AWAL ambassador. &quot;It's exciting for our team and our roster to be part of a full service company that will serve artists and labels in the most pristine and fluid way. This collaboration allows artists to focus on their craft whilst having the support of appropriate, customised tools and services. Our community is now in the best position to be in control, artistically free with the direct conduit to fans and consumers.&quot; \n\nAWAL client and Absolute MD, Henry Semmence said: &quot;Having been a strategic partner with AWAL for the several years now, the new tie up between AWAL and Kobalt is very exciting news for all of us. The label management skills and delivery access points to the market that we can offer as a combined force offers huge potential to a wide range of acts across all genres - exciting times ahead.&quot; \n\nAbout AWAL\n\nFormed in 1997, AWAL has sold more than 20,000,000 downloads and had major success stories with such artists as Radiohead, the Arctic Monkeys, the Editors, Kate Walsh, Comedian Eddie Izzard, Moby, Jeepster Records, Absolute Marketing and Distribution, and Elite Music to name a few. With a direct and transparent business model, AWAL clients can view their sales online, on-demand and up to the previous day, plus every client can opt into premium marketing services, a synch licensing platform, as well as log in to their own BuzzDeck, a data analytics service. For more information, go to www.awal.com \n\nAbout Kobalt Music Group, Ltd.\n\nKobalt Music Group, Ltd. (Kobalt) is the leading global, music services company offering unparalleled transparency, online copyright administration and royalty tracking, creative and synch/licensing services, weekly online balances, digital collections and advances to writers, publishers, performers and other rights holders. With over 125 employees in offices in London, New York, Nashville, Los Angeles, Berlin, Sydney and Stockholm, as well as agents in over 20 major territories, Kobalt administers more than 200,000 copyrights worldwide on behalf of over 1000 content holders, including the world's top songwriters, artists and other music publishers. \n\nKobalt clients include Max Martin, Dr. Luke, Gwen Stefani, No Doubt, LMFAO, Kid Rock, Kelly Clarkson, Kid Cudi, Ryan &quot;Alias&quot; Tedder, Noah &quot;40&quot; Shebib, Busta Rhymes, 8 Mile Style (publisher of Eminem), Skrillex, Dave Stewart, Joss Stone, Rufus Wainwright, DJ Shadow, One Republic, Moby, Ti&euml;sto, Phoenix, Band of Horses, LCD Soundsystem, Interpol, Nine Inch Nails, John Rich, The Hives, Greg Wells, Cut Copy, Nat Geo Music, Slip N Slide Records/First N Gold Publishing, The Legendary Traxster, Bridgeport Music (publisher of Parliament Funkadelic and George Clinton), Getty Images, Richard Ashcroft, and Shelly Peiken, among many others. \n\nKobalt's Label Services division and newly acquired company, AWAL, provides global digital retail sales, premium marketing services, sales reporting, an online client dashboard, a synch licensing platform and BuzzDeck data analytics. Kobalt Neighbouring Rights Ltd. (KNRL), a Kobalt Music Group company, offers clients a unique, modern and transparent approach to neighbouring rights which simplifies a very complex process, maximizes earnings and speeds up payments to those who are entitled to remuneration.\n\n"
]