[
"LONDON, U.K. -- One of the world's successful hip hop DJ artist/producers, DJ Shadow (a.k.a. Josh Davis), has signed an exclusive, worldwide administration deal with Kobalt Music Group (Kobalt). Through the deal Kobalt is representing DJ Shadow's new album, The Less You Know, The Better, which was released on 4 Oct. \n\nThe record includes &quot;Scale It Back (featuring Little Dragon)&quot; and &quot;Stay The Course (feat. Posdnuos of De La Soul and Talib Kwali). Kobalt is also representing recent singles &quot;I Gotta Rokk,&quot; &quot;Warning Call (feat. Tom Vek)&quot; and &quot;Def Surrounds Us'/'I've Been Trying,&quot; as well as future works. Kobalt's global synch and creative teams will also work with him to generate opportunities in film, TV, and other media. \n\nCommented Sas Metcalfe, EVP Creative of Kobalt: &quot;We are thrilled to be working with DJ Shadow and his manager Jamal Chalabi. He's an artist and producer that is always cutting edge, innovating brilliant new sounds and building upon his already massive and diverse global fan base. It is a privilege to have him on our global artist roster.&quot; \n\nWidely credited as a key figure in developing the experimental instrumental hip-hop style associated with the London-based Mo' Wax label, DJ Shadow is one of the most popular and respected DJs in the world. Having released three chart-topping albums as a solo artist along with a number of mix collections, DJ Shadow has collaborated with Cut Chemist, Richard Ashcroft and Ian Brown and remixed and/or produced songs for such artists as Depeche Mode, Keane, and the Mo' trip-hop supergroup UNKLE. He has also worked with such artists as Thom Yorke, Keak Da Sneak, E-40, Lateef, Q-Tip (of A Tribe Called Quest), David Banner, DJ Krush, and Dr. Octagon among many others.\n\nIn recent years, DJ Shadow released three volumes of &quot;The 4-Track Era Collection,&quot; a series of his earliest recordings. With Cut Chemist, he also created a series of mixes that fused soul, funk, and rock, in the framework of a cohesive concept involving using only 45 rpm records (7 inches). \n\nDJ Shadow is a character in the Activision video game DJ Hero, which features several of his mixes. His music has also been featured on numerous original soundtrack albums for such films as The Beach, Dark Days and Fast and Furious: Tokyo Drift. \n"
]