[
"23rd May, London: - Ann Tausis has joined Kobalt Neighbouring Rights (KNR) as Managing Director.\n\nIn her new London-based role, which begins 1st June, her initial objectives will include streamlining day-to-day operations, building up KNR&rsquo;s staffing across the world and helping lead the Neighbouring Rights industry at a policy level. \n\nTausis brings years of collection rights management expertise to a young, fast-growing company that is successfully negotiating the jungle of Neighbouring Rights on behalf of its select artist roster. Most recently, she was Director of European Regional Administration at Universal Music Publishing, having previously held the position of Global Copyright Director from 2005-2012. She brings 20 years of experience in rights management administration, particularly in registration of rights. \n\nKNR has amassed a premier client roster in just over a year since launching at MIDEM in 2012. It provides a bespoke, transparent service, backed up by the critically-acclaimed Kobalt Music Group client portal technology. KNR operates in all of the key territories where Neighbouring Rights revenues are collected.  IFPI&rsquo;s 2013 Recording Industry in Numbers Report estimates that global Neighbouring Rights are worth an estimated &euro;735 million a year. \n\nSaid Hans Van Berkel, Executive Chairman of KNR and one of the pioneers in the field: &ldquo;Ann brings fantastic experience from her time at Universal, and PolyGram before that, to the role. Her stability and clarity of vision gained across the publishing sector will stand her in great stead in the rapidly developing sphere of Neighbouring Rights, where complex distribution policies and qualifying criteria vary widely from society to society in a patchwork of countries covered by relevant treaties.&rdquo; \n\nSaid Ann: &ldquo;I am delighted to be joining a thriving, industry-leading company that operates in an area of the recordings business that is developing fast, both at a commercial and at a policy level. Opportunities abound for an efficient global Neighbouring Rights agency, and it is testament to KNR that it has been able to attract the cream of the crop in terms of clients in such a short space of time.&rdquo;\n\nTausis takes the mantle from Sabine Jones, Managing Director from KNR&rsquo;s launch, who is to pursue a consultancy career.\nNeighbouring Rights are often overshadowed by the scale and sophistication of the music publishing industry, but they are in many cases no less lucrative for rights holders. Significant sums are collected by societies but labyrinthine bureaucracy can mean it is difficult to actually get paid. Part of KNR&rsquo;s bespoke service for clients includes the use of secondary data to check the accuracy of reporting by collecting societies. \n\nAlthough a separate limited company, KNR operates as part of the Kobalt Music Group, making use of its considerable infrastructure including the powerful new interactive client portal, and sharing the ethos of transparency and timeliness in payments to clients.  Recent signings to KNR include Ellie Goulding, Tom Odell, Gotye and the estate of Michael Jackson.\n\n                                                                 # # #\n"
]