[
"SYDNEY, AUSTRALIA -- Kobalt Music Group (Kobalt) today announced the company has signed an exclusive, worldwide administration deal with internationally acclaimed artist, songwriter and composer Iva Davies, best known for the multi-million selling hits of his band ICEHOUSE and as the composer of the score for the Academy Award winning film, Master and Commander: The Far Side of the World.\n\nThrough the new deal with Davies, Kobalt will globally represent all new and previously released works including the entire ICEHOUSE catalog and other compositions written by Iva for film and theatre. Kobalt's worldwide synch and creative team will also work with Davies and his team to exploit the catalog for use in film, TV, advertising, games and in other areas where the songs have not previously been utilized.\n\n&quot;I'm really excited about the prospect of being involved with Kobalt as I move to the next phase of my career,&quot; said Iva, &quot;Having only been with one publisher throughout my career this was a big step to make. What impressed me most was the Kobalt team's new and different way of approaching publishing: their transparency, enthusiasm and creativity sees them firmly engaged in new models for the 21st century in order to benefit the writers and artists they work with.&quot; \n\nSimon Moor, MD of Kobalt Music Australia, commented: &quot;Iva and ICEHOUSE occupy a unique space in the Australian creative landscape with broad career achievements not equaled by any other Australian, and very few international, writers. To be able to work with a writer and artist of Iva's calibre is an honour. Great music stays with you for life and whether it is the ICEHOUSE anthem Great Southern Land or the hauntingly powerful score from Master And Commander, Iva's music has always and will continue to inspire and entertain across generational and stylistic boundaries. Like the country he writes about frequently, his works are timeless.&quot; \n\nAside from Iva Davies' international recognition around the film score for Master and Commander: The Far Side of the World, the ICEHOUSE catalog also includes such hits as 'Crazy' and 'Electric Blue' (both of which reached Top 10 on Billboard's U.S. singles chart), the European No.1 &quot;Hey Little Girl&quot; and the alternative Australian national anthem, &quot;Great Southern Land.&quot; \n\nICEHOUSE has produced eight Top 10 albums and twenty Top 40 singles in Australia, with album sales of over 28 times Platinum in Australasia alone. The band was inducted into the 2006 ARIA Hall of Fame and has won multiple ARIA awards. \n\nThe new deal with Davies is the second major Australian signing announced by Kobalt, the leading global independent publisher which recently opened a Sydney office and expanded its offerings in the territory, introducing its innovative transparent and efficient model. The company also signed Art vs Science in November. \n"
]