[
"NEW YORK, NY -- On the cusp of their 20th anniversary, Pearl Jam, one of the most popular and influential bands in the world, has concluded three long-term worldwide exclusive administration deals (excluding the U.S.) with leading global independent publisher Kobalt Music Group (Kobalt).\n\nThe announcement was made today by Willard Ahdritz, CEO and Founder of Kobalt. \n\nThrough the agreements, Kobalt will immediately begin administration of Pearl Jam's forthcoming new material, and assume administration of their first two multi&minus;million selling global smash albums, Ten and vs. In addition, Kobalt will administer all of lead singer/songwriter Eddie Vedder's solo catalog including his critically&minus;acclaimed soundtrack to Into The Wild and the song &quot;Better Days&quot; from the Eat Pray Love soundtrack, plus new solo works. In 2012, the rest of Pearl Jam's entire back catalog (featuring the albums Vitalogy, No Code, Yield, Binaural, Riot Act, Pearl Jam, Backspacer) will move to Kobalt. \n\nAs part of the new relationship, Kobalt will additionally handle synch licensing and promotion of Pearl Jam repertoire and Eddie Vedder solo repertoire for use in motion pictures, TV advertising, games, ringtones, and other media.\n\n&quot;We're extremely proud and honored to be working with Pearl Jam and look forward to a long relationship with new releases and other exciting activity planned for their 20th anniversary in 2011,&quot;said Ahdritz, &quot;I'd like to also acknowledge Merril Wasserman, our Sr. VP Business Development, who was instrumental in executing this deal on behalf of Kobalt.&quot; \n\nForthcoming releases from Pearl Jam include a new compilation album, Live On Ten Legs (Island Records), which is set for release internationally on January 17, 2011. Also planned in 2011 are re&minus;packaged, re&minus;issues of vs. and Vitalogy. \n\nExecutives involved in the deal included Willard Ahdritz; Elliot J. Groffman of Carroll, Guido &amp; Groffman, attorney for Pearl Jam; Kelly Curtis of Curtis Management, manager for Pearl Jam; Jamie Cheek of Flood, Bumstead, McCready &amp; McCarthy, business manager for Pearl Jam; and Michele Anthony, consultant to Pearl Jam and their label, Monkeywrench Records. "
]