[
"CANNES, FRANCE -- Willard Ahdritz, Founder and CEO of Kobalt Music Group (Kobalt), today announced that in 2011 the leading global independent music publisher is expanding its core business beyond music publishing to include the administration and marketing of other rights such as neighbouring rights, synch rights for master recordings and other rights to be announced later this year. &#8232;\n\nBuilding upon Kobalt's original vision, technology and knowledge of global collections, the company has worked for the last 18 months to develop the first global extended rights collections platform which combines multiple rights into one large database. \n\n&quot;Kobalt is significantly improving the standard of service for our clients as well as servicing their needs for licensing and the collection of rights other than just publishing,&quot; said Ahdritz, &quot;The power of global databases increases collection efficiency and maximizes usage of data and information. Furthermore our direct collections infrastructure brings a number of advantages to our clients to include higher revenues, faster payments as well as complete transparency.&quot; \n\nSeveral Kobalt clients including producer/writer and artist Ryan Tedder have already signed on for direct collection of neighbouring rights, which provide, in certain territories to eligible performers and musicians, a royalty from when a sound recording is played in public, broadcasted, rented, copied at home or transmitted digitally. Kobalt is currently expanding its existing relationships with neighbouring societies PPL, SENA and SoundExchange, which are key entities in this area.\n\nAdditionally in 2011, Kobalt is entering the business of synch representation for master recordings. The company's global synch team will have the ability, for selected content, to issue synch licenses for both master and publishing rights. Kobalt has already concluded a deal with Tony Kanal to represent outside the U.S. select master recordings by artist Elan. &#8232;\n\n&quot;Representing master recordings for synch licensing is a natural extension of our full service business. Potential licensors of music for film, TV, advertising, games, and other media will have even more creative options and in some cases the ease of quickly licensing everything from one company,&quot; added Ahdritz. \n\nKobalt's new online synch database and licensing system, which will showcase content and help expedite the licensing process, will debut in late Spring 2011 as a part of Kobalt's website, www.kobaltmusic.com. "
]