[
"LONDON, U.K. -- Kobalt Music Group (Kobalt) has signed hitmaking Swedish superstar duo Roxette (a.k.a. Marie Fredriksson and Per Gessle) to a North American administration deal. Through the deal Kobalt will also represent Roxette for synchronization for motion picture, TV, games, ringtones and other media. \n\nNearly a decade since their last studio album, Room Service (Phantom Import), Roxette is releasing a new album in February 2011 entitled Charm School. The new album, which will be released on EMI worldwide (excluding the U.S.), will feature twelve songs described as &quot;updated classic Roxette&quot; including the singles &quot;Way Out&quot; and &quot;Sitting On Top Of The World.&quot; After Fredriksson won the battle against a brain tumor in 2002, the duo reunited and soon started recording the new material during their successful headlining comeback tour last year in front of 600,000 people in Holland, Belgium and Germany. The album was produced in Sweden with Clarence &Ouml;fwerman and Christoffer Lundqvist (together with Fredriksson and Gessle).\n &#8232;\nIn March 2011, Roxette will embark on a world tour covering four continents. Roxette exploded onto the worldwide music scene from the late 1980s through the mid&minus;1990s, with nineteen U.K. Top 40 hits and four No. 1 U.S. singles, &quot;The Look,&quot; &quot;Listen To Your Heart,&quot; &quot;It Must Have Been Love,&quot; and &quot;Joyride.&quot; Two other singles, &quot;Dangerous&quot; and &quot;Fading Like A Flower,&quot; went to No.2 in the U.S. After a hiatus in the mid&minus;1990s, Roxette's popularity continued in other territories such as Europe and South America, where they earned various gold and platinum awards. Their hits &quot;It Must Have Been Love&quot; and &quot;Listen To Your Heart&quot; recently received BMI awards for having reached over four million radio plays in the U.S. Their albums Joyride (Capitol) and Look Sharp (EMI) achieved platinum status in the U.S. Career sales for Roxette are estimated at over 70 million records worldwide, with over 3.5 million record sales in the United States. "
]