[
"NEW YORK, NY -- Kobalt Music Group has concluded an administration deal with Neil Finn, it was announced today by Willard Ahdritz, CEO and Founder of Kobalt Music Group (Kobalt). \n\nKobalt will exclusively represent Finn's future works worldwide including his highly anticipated forthcoming album recorded as the band Pajama Party. The Pajama Party album is due to be released later this year and will be supported by tours in the U.S., Europe and Australia. Finn is also starting work on a new Crowded House album. \n\nIn the U.S. &amp; Canada Kobalt represents Finn's back catalogue of songs including &quot;Don't Dream It's Over,&quot; &quot;It's Only Natural,&quot; &quot;Fall At Your Feet,&quot; &quot;Better Be Home Soon,&quot; &quot;Something So Strong,&quot; and other repertoire from other albums by Crowded House (including Crowded House, Temple of Low Men, Woodface, Together Alone), the Finn Brothers albums, Split Enz and Neil Finn solo albums. In Australia, New Zealand &amp; Fiji Kobalt represent all of Finn's catalogue, excluding the Finn Brothers' albums and the last two Crowded House albums Time on Earth and Intriguer.\n\n&quot;We're really excited about working with Neil and his repertoire globally,&quot; said Willard Ahdritz, CEO and Founder of Kobalt Music Group. &quot;Our Kobalt teams are working together globally to generate new synch activity for Neil in all areas including film, TV, advertising, games and other mediums. We hope this is just the beginning of more opportunities for him worldwide.&quot;\n\nCommented Neil Finn: &quot;I'm delighted to have my songs being cared for by the good folk at Kobalt. They clearly love my songs and want to tell the world about it. I couldn't ask for more...except perhaps the closing credits of the new Coen Brothers movie.&quot; \n\nAs a prolific songwriter and renowned performer, highly regarded and respected by his peers and contemporaries, Finn's songs have been recorded or covered by such artists as: Susan Boyle, Paul Young, Sixpence None The Richer (&quot;Don't Dream It's Over&quot;), The Dixie Chicks (&quot;Silent House,&quot; co-written with the Dixie Chicks), James Blunt (&quot;Fall At Your Feet&quot;), Eddie Vedder (&quot;Take A Walk&quot;), and Pearl Jam (&quot;I Got You&quot;) among many others."
]