[
"BERLIN, GERMANY -- David Jost, Dave Roth and Pat Benzner, Germany's top songwriter/producer team and managers behind the global superstar act Tokio Hotel, have signed an exclusive publishing and creative services deal with Kobalt Music Group (Kobalt). The announcement was made today by Willard Ahdritz, CEO and Founder of Kobalt Music Group and Matthias Kind, Managing Director of Kobalt Music Group Germany GmbH. \n\n&quot;We are delighted to welcome David, Dave and Pat to our international Kobalt roster of great songwriters and producers. Kobalt offers them not only a unique, centralised collections platform, but also the services of a top global team that works across borders,&quot; said Ahdritz. \n\n&quot;This was a very highly contested deal and we're extremely proud to be working with David, Dave and Pat. Our global creative team is already working together to expand their songs all over the world. We look forward to a long and successful relationship,&quot; added Kind. \n\nAs part of the deal, Kobalt is providing global creative and synch licensing services, as well as copyright administration for the entire Tokio Hotel catalog and their next album for all worldwide territories excluding Germany. Kobalt is also representing their new works and material for other artists. David Jost, Dave Roth and Pat Benzner have been awarded as songwriters and producers 68 times with GOLD and 45 times with PLATINUM. In April 2010 they received Germany's top award for songwriting from GEMA collection society. \n\nWith Tokio Hotel, Jost, Roth and Benzner have sold more than 7 million records and helped craft one of the most successful German acts in 20 years. The albums Humanoid and Scream have been recorded in German and English. The Goethe-Institute, a non-profit German cultural institution that promotes the study of the German language worldwide, has noted that a soaring demand has emerged for German language courses in many European countries because of the huge success of Tokio Hotel and interest in their music and lyrics. Even all over France and in the U.S., fans have sung along to the songs in German. Tokio Hotel's international mega hit single &quot;Monsoon&quot; (also known as &quot;Durch den Monsun&quot;) also reached the No.1 spot on Israeli radio charts, an accomplishment that no other German act has ever before achieved. Tokio Hotel has had five No.1 hits, three No.1 albums and has won almost any music award possible to win in Europe. With a total of 38 awards, Tokio Hotel has received three MTV Europe Music Awards, MTV's Best New Artist awards in the U.S. and four MTV Latin Music Awards including the award for Best Song for &quot;Monsoon.&quot; In addition, Jost, Roth and Benzner have written amongst others songs for American Idol star Adam Lambert, Kerli, Sarah Brightman and the song &quot;I Like,&quot; No.1 platinum hit for Keri Hilson. Furthermore they have composed music for major TV campaigns by BMW, Mercedes and Verizon/Motorola, have done remixes for M&ouml;tley Cr&uuml;e, Faith Hill and Jewel and wrote songs for various soundtracks including Tim Burton's Hollywood blockbuster film Alice in Wonderland. "
]