[
"\n&bull;    Hits No 1 in Norway, No 3 in the UK, Germany\n&bull;    Top 5 in 7 European territories, no. 2 US Dance chart\n&bull;    Album is first release on band&rsquo;s x2 label, through Kobalt Label Services\n\n(LONDON, UK) 25 July 2013 -- Pet Shop Boys&rsquo; latest album Electric has got off to a flying start since release, hitting no.3 in the UK Album Charts &ndash; their highest chart position since 1993&rsquo;s Very took the top spot.\n\nIn addition, its first number 1 was confirmed this morning, in Norway.  The album has also topped the UK indie chart, hit no. 2 in Denmark, 3 in Germany, 4 in Czech Republic and went top five in Spain &ndash; the highest non-Spanish record in the charts, the highest entry of the week and highest charting for Pet Shop Boys in Spain since 1988.\n\nIn addition to seven top 5 European placings so far, in the US, Electric reached no.26 on the Billboard Top 200, no.2 on the Current Dance/Electronic album chart, no. 3 on the Indy &amp; Small Chain Stores and no. 12 on the LP Vinyl Album chart, confirming Electric as the duo&rsquo;s highest US charting album in 20 years.\n\nProduced by Stuart Price, Electric is the band's first album since leaving Parlophone, being released via their own x2 label, through Kobalt Label Services (KLS).\n\nKLS has provided a simultaneous release in more than 30 markets worldwide via KLS&rsquo; own in-house digital distribution platform (AWAL) and in partnership with KLS&rsquo; global network of physical distribution and marketing partners including Proper in the UK, Alliance Entertainment (US), [PIAS] (France, Benelux), Rough Trade/Good To Go (GSA), Playground (Nordics), Popstock Everlasting (Spain, Portugal), Self/SpinGo  (Italy), Mystic (Poland), Inertia (Australia) and Sony (Canada, Japan, South America).\n\nThe campaign for the album, which is a return to Pet Shop Boys' dancefloor roots, has featured outstanding design and visuals and has been supported by Pet Shop Boys&rsquo; global touring with the ELECTRIC Tour. The next step in the campaign will be the release of the critically acclaimed &ldquo;Love is a bourgeois construct&rdquo; as a single.\n\nPet Shop Boys manager, Angela Becker said &ldquo;It's an exciting start to the campaign and we are very encouraged by the first week results.  The combination of Pet Shop Boys and Stuart Price has yielded a very special album that has been rewarding to work alongside the committed and innovative team at KLS.&quot;\n\nCommented Paul Hitchman, MD of Kobalt Label Services, &ldquo;Working with the Pet Shop Boys has been a true partnership, and has shown what is possible when you have a great record and a focused team. We have made a great start to the campaign and look forward to helping the band achieve the success that this record deserves.&rdquo;\n\nCritics and tastemakers have hailed the record as a return to their finest form.  Below are excerpts from recent album reviews:\n\n&ldquo;Electric is a terrific return to form&rdquo; Daily Telegraph 5*****\n\n&ldquo;With Electric, Pet Shop Boys have succeeded spectacularly&rdquo; Q 4****\n\n&ldquo;Good time grooves that will electrify the dance floor&rdquo; The Independent\n\n&ldquo;&hellip; On this form they&rsquo;re worth their weight in gold&rdquo; Mojo 4****\n\n&ldquo;&hellip;recharged and inspired.. Electric's centrepiece, Love is a Bourgeois Construct, is one of the greatest songs of their three-decade career.&rdquo; The Guardian 4****\n\n&ldquo;Electric is a fierce, energetic record&hellip; 'Boys' done good.&rdquo; The Quietus\n\n&ldquo;They&rsquo;re reborn, revitalised, and really rather good.&rdquo;  Clash Music 8/10\n\n&ldquo;Best they&rsquo;ve ever done it&rdquo; Daily Express 5*****\n\n&ldquo;Brilliant.&rdquo; USA TODAY\n\n&ldquo;Electric, in a word, bangs, and sees the Pet Shop Boys at their most celebratory and wittiest.&rdquo; Los Angeles Times\n\n&ldquo;Pulse-quickening, mind-tickling&rdquo; Rolling Stone\n\n&quot;Synth-pop vets Neil Tennant and Chris Lowe show that Daft Punk aren't the only duo making groovy electro-dance music in 2013.&quot; People Magazine\n\n&quot;Electric is their most immediate, jubilant record in at least a decade.&quot; Pitchfork\n\n&quot;Electric is a triumph&hellip; classic Pet Shop Boys&quot; SPIN\n\n&ldquo;Electric&rdquo; is an unlikely turnaround, a masterclass in dance which beats everything else&rdquo; Bloomberg Business Week\n\n&ldquo;Electric continues the group&rsquo;s constant stylistic evolution, while keeping an ear towards the newest dance music trends.&rdquo; Billboard\n\n&quot;&hellip;It sounds like the best clubbing anthem Kraftwerk never wrote.&quot;&#8232;New York Post\n\n\nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\n                                                       # # #"
]