[
"&bull;    Signings include Australia&rsquo;s Havana Brown and Matt Corby\n&bull;    All global deals\n\nLondon, 8th August 2013: Kobalt Neighbouring Rights continues to grow its impressive roster of artists, having landed stadium rock group Thirty Seconds To Mars and a handsome list of international acts including Train, A*M*E, Havana Brown and Matt Corby. The artists have all signed deals nominating KNR as their global Neighbouring Rights agent. \n \nThe signings are the first during the tenure of Managing Director Ann Tausis, appointed this June. They join recent signings Tom Odell, Ellie Goulding and Jake Bugg.\n \nAmerican band Thirty Seconds To Mars are enjoying a busy 2013, with their fourth studio album LOVE LUST FAITH + DREAMS reaching the top five in nine territories including Germany and the UK and the top ten in the US, amongst others. The band will tour Europe, Australia and Japan before heading to the UK and Ireland in November. \n \nGrammy-award winning rockers Train released their sixth studio album &lsquo;California 37&rsquo; in 2012 with the single &quot;Drive By&quot; reaching number ten on the Billboard Hot 100 and reached the top ten in the UK Singles Chart. The band is currently touring the US with their &lsquo;Mermaids of Alcatraz&rsquo; show. \n \nA*M*E, born in Sierra Leone but raised in Britain, has had an incredible 12 months, being shortlisted for the BBC&rsquo;s Sound of 2013 and reaching the top of the UK Singles Chart with a collaboration with Duke Dumont and MNEK on &lsquo;Need U (100%)&rsquo;.\n \nPlatinum-selling DJ and singer Havana Brown went Platinum in the US in 2012 with her single &lsquo;When The Lights Go Out&rsquo;. She has toured with the likes of Britney Spears and Rihanna.\n \nMatt Corby, an Australian Idol runner up and successful singer-songwriter in his own right, went 5x Platinum in Australia with his fourth EP &lsquo;Into the Flame&rsquo;.\nAnn Tausis, Managing Director of Kobalt Neighbouring Rights said: &ldquo;We&rsquo;re delighted to be working with talented recording artists like Thirty Seconds to Mars, Train, A*M*E, Havana Brown and Matt Corby and I can&rsquo;t wait to surprise them with their first KNR revenue statements. The world class team here has done a brilliant job in building an impressive client list in only a year and a half &ndash; 2013 sees us go from strength to strength.&rdquo;\n \nThe new signings join KNR&rsquo;s roster of international artists including Bob Dylan, Bj&ouml;rk, Gotye and the estate of Michael Jackson. \n \n \nAbout Kobalt Neighbouring Rights\n\nKobalt Neighbouring Rights (KNR) offers a global service for artists and independent labels to collect their Neighbouring Rights income from the various relevant collecting societies around the world. \n\nLaunched at MIDEM 2012, KNR is run by Managing Director Ann Tausis, who was previously at Universal Publishing for 20 years, most recently as Director, European Regional Administration.\n\nKNR prides itself on its bespoke, robust service to clients, drawing on secondary data to test reporting by collecting societies and negotiating the complex distribution policies and qualifying criteria in order to maximise revenues to artists. By making use of the infrastructure and back office of the critically-acclaimed Kobalt Music Group, KNR is able to build a more accurate picture of revenues owed. \n\nThe company represents, among others, Bob Dylan, Bj&ouml;rk, Ellie Goulding, Jake Bugg, Gotye and the estate of Michael Jackson. \n\nKNR was launched by executive chairman Hans Van Berkel, and benefits from his inside knowledge and international relationships built up over 20 years of record label experience at Polygram and 18 years in the Neighbouring Rights field as Managing Director of Dutch Neighbouring Rights organisation SENA.\n\nBased in London, Kobalt Neighbouring Rights is a separate limited company operating as part of the Kobalt Music Group, and embraces the wider group&rsquo;s ethos of transparency and timeliness of payments to clients who are guaranteed payment within 31 days after the end of the month in which money is received.\n"
]