[
"LONDON, UK and SYDNEY, AUSTRALIA -- Willard Ahdritz, CEO and Founder of Kobalt Music Group (Kobalt), today officially announced the global music publishing company has expanded its presence in the Australian market. The company has opened a Kobalt Sydney office in Surry Hills and formed the local company, Kobalt Music Publishing Australia Pty. Ltd., which will be headed by top A&amp;R/Creative Australian music executive Simon Moor.\n\n&ldquo;As Kobalt has grown to directly collect from 33 territories worldwide, expanding into the strong Australian music market is a natural progression for us. With many of the world&rsquo;s top artists and songwriters on our global roster, it makes sense for us to invest in Australia to expand our local representation, and as well as to develop new creative opportunities and revenue streams,&rdquo; said Ahdritz.\n\nReporting to Ahdritz as MD of Kobalt Music Publishing Australia Pty. Ltd., Moor, who started his new position on September 1, comes to Kobalt from Sony/ATV Music Publishing Australia, where he served as Head of A&amp;R/Creative for six years and was responsible for signing and assisting (along with Sony/ATV Managing Director Damian Trotter) in the development of the musical careers of such writers as Paul Kelly, Tame Impala, Simian Mobile Disco, Angus and Julia Stone, Lisa Mitchell, Sarah Blasko, The Sleepy Jackson/Empire Of The Sun, The Hilltop Hoods, Little Birdy, Arcade Fire, and Operator Please, among others. Immediately prior to working at Sony/ATV, Moor headed the A&amp;R department of EMI/Virgin Australia where he was in charge of A&amp;R&rsquo;ing The Sleepy Jackson&rsquo;s Lovers album, and successfully introduced Luke Steele to Nick Littlemore (who later became Empire Of The Sun). Moor also brought to EMI such artists as The Sleepy Jackson, Jet, and Silverchair (as part of a broader agreement with the Eleven label). Simon also worked with Paul Kelly on his platinum album Nothing But A Dream, and Alex Lloyd on his triple platinum album Watching Angels Mend. His career also included employment at Sony Music Australia and Mushroom Records. \n\nMoor will hire licensing and creative staff and work closely with Kobalt&rsquo;s roster of global clients in the Australian market to represent them in both a creative capacity and in administration. As part of his role, Moor will further introduce to the local market Kobalt&rsquo;s unique offerings including: advanced transparent copyright management and royalty tracking tools; boutique creative services; global synch placement and licensing; online pipeline advances and more.\n\nIn the Australasia region, Moor will also launch the company&rsquo;s latest version of its online system, Kobalt Next Generation Portal Digital 3.0., an enhanced digital collection platform providing unprecedented data on global digital music revenue streams, data on products tracked and audio/video performance royalties collected from licensed content in global film and TV productions. \n\nIn making the announcement, Ahdritz said:&ldquo;We are very pleased to welcome Simon Moor to Kobalt Music Group. Simon&rsquo;s stellar track record in creative/A&amp;R, broad knowledge of publishing and songwriter needs, network of contacts and respected administrative capabilities will be a strong bonus to help us expand and supplement creative and synch opportunities for our global clients in the Australian market and beyond.&rdquo; \n\n&ldquo;I&rsquo;m thrilled to be joining Kobalt to help establish and expand the company into Australia and New Zealand. Kobalt&rsquo;s transparent, efficient system and business model has been proven to increase writer revenues and has revolutionized the entire music publishing industry. I look forward to developing new opportunities for all our writers and artists in our local market as well as to working with Kobalt&rsquo;s international roster,&rdquo; said Moor. \n\nKobalt, which will formally begin direct collections in the local territory beginning January 1, was elected to full APRA Publisher &amp; AMCOS membership at the board meetings held September 8.\n\nAs part of the announcement Ahdritz added: &quot;As we transition to administering our own works in the Australasia region (starting January 1, 2011), I would like to take this opportunity to thank Mushroom Music Publishing for their tremendous support for more than 9 years. As our sub-publisher they have provided excellent service for Kobalt and our clients in managing our publishing in the region. We look forward to their continued assistance and diligence during the transition period and to maintaining our excellent relationship with them in the future.&quot; \n\nKobalt writers currently have a major presence on the Aria Top 50 Singles Chart. The company has a multitude of copyrights represented on the chart including &quot;Dynamite&quot; by Taio Cruz (No.1), &quot;Teenage Dream&quot; by Katy Perry (No.2), &quot;Club Can't Handle Me&quot; by Flo Rida Feat. David Guetta (No.4), &quot;DJ Got Us Fallin' In Love&quot; by Usher Feat. Pitbull (No. 5), &quot;Take It Off&quot; by Ke$ha (No.6), &quot;If I Had You&quot; by Adam Lambert (No.10), &quot;California Gurls&quot; by Katy Perry Feat. Snoop Dogg (No.11), &quot;Magic&quot; by B.o.B Feat. Rivers Cuomo (No.15), &quot;Gettin' Over You&quot; by David Guetta Feat. Chris Willis, Fergie &amp; LMFAO (No.38), and &quot;My First Kiss&quot; by 3OH!3 Feat. Ke$ha (No.45)."
]