[
"NEW YORK, NY -- No Doubt, one of the biggest acts in the world and currently recording a new studio album, has concluded two new agreements with Kobalt. No Doubt has signed a U.S. digital collections deal with Kobalt for new works, which will include the new album being recording now in Los Angeles. The band has also moved the copyright administration of their entire back catalog to Kobalt for the world (excluding the U.S. and Canada). \n\nAs part of the deal, Kobalt is also handling No Doubt synch licensing for the world (excluding U.S. and Canada). \nThe No Doubt catalog includes multi-million selling albums such as No Doubt, The Beacon Street Collection, Tragic Kingdom, Return Of Saturn, The Singles 1992-2003 and Rock Steady. The stellar repertoire includes their classic hits such as &quot;Don't Speak,&quot; &quot;Spiderwebs,&quot; &quot;Just A Girl,&quot; &quot;Hella Good,&quot; &quot;Simple Kind of Life,&quot; &quot;Underneath It All,&quot; &quot;Ex-Girlfriend,&quot; and &quot;Hey Baby,&quot; among many others.\n\nIn addition to the No Doubt material, Kobalt represents the publishing interests for solo works by each member of the band - singer Gwen Stefani, bassist Tony Kanal, guitarist Tom Dumont and drummer Adrian Young. Stefani has extended her relationship with Kobalt Music Group to include a new agreement for the company to collect her digital publishing royalties in the U.S. Throughout the world excluding the U.S. and Canada, Kobalt already administers the music publishing catalog of Gwen Stefani, Harajuku Lover Music, which includes her hit singles (such as &quot;What You Waiting For?,&quot; &quot;Hollaback Girl&quot; and &quot;The Sweet Escape,&quot; among others) and all material from her multi-million selling CDs Love. Angel. Music. Baby.(Interscope) and The Sweet Escape (Interscope), plus future material. \n\nThis expanded association begins as Kobalt rolls out its new Digital 3.0 online portal which offers Stefani unprecedented access to detailed information on collections in digital music sales and performance royalties and other digital revenue streams. Additionally the system offers expanded access to data on products tracked and audio visual performance royalties collected from licensed content in global film and TV productions. \n\n&quot;For many years we've been privileged to be working with No Doubt and their management, and we're excited to continue the relationship in the U.S. with their digital collections,&quot; said Willard Ahdritz, CEO and Founder of Kobalt. &quot;Kobalt has developed the most unique digital collection platform available which will give clients complete transparency and access to a breakdown of revenue detail from nearly all digital sales outlets available in each territory, as well as extended synch licensing and performance revenue detail listed by licensee and by territory.&quot;\n"
]