[
"Kobalt additionally ranks as the top independent music publisher in the U.S.A. with 8.3% share of the market measured by ranking radio airplay in the 4th quarter of 2009 (Source: Billboard Magazine). The company also recently reached a new milestone as top independent publisher of the prominent German music market with 9.43% market share (Source: Musikwoche). \n\nAs a UK headquartered, venture capital backed company, Kobalt set out nine years ago with plans to revolutionize the structure of the global music industry using unprecedented transparency and advanced systems allowing clients to be completely involved in the process of managing and marketing of their content. A vast departure from traditional music publishing methods of collection and reporting, Kobalt's service-based business model features centralised collections and an online client portal interface, Next Generation Portal 3.0.\n\nKobalt has attracted the world's top music content owners with more efficiency in copyright registration and collections, up to 30% more money in payments, faster royalty payments, royalty tracking, analysis, and creative and licensing services. The company has a client retention rate of over 98% and has achieved over 65% growth in gross revenue each of the past three years.\n\nWith more than 900 clients, Kobalt's roster includes a vast range of recording artists, songwriters, producers, other music publishers such as Gwen Stefani, Tony Kanal of No Doubt, Richard Ashcroft, Ryan Tedder, Dr. Luke, Moby, DJ Ti&euml;sto, Max Martin, Kelly Clarkson, Busta Rhymes, Nate &quot;Danja&quot; Hills, Rufus Wainwright, Kid Rock, Dave Stewart, among others. \nIn January Willard Ahdritz, CEO and Founder of Kobalt, announced the company completed its beta-testing of a new portal - Next Generation Portal 3.0 Digital, which will launch later this year. The new version will offer unprecedented access to detailed information on collections in digital music sales and performance royalties and other digital revenue streams. Additionally the system will provide expanded access to data on products tracked and audiovisual performance royalties collected from licensed content in global film and TV productions. \n"
]