[
"LONDON, UK (22 September 2010) -- Kobalt Music Group (Kobalt) has signed two exclusive worldwide deals with Future Cut, a.k.a. Darren Lewis and Tunde Babalola.\n\nThe announcement was made by Willard Ahdritz, CEO and Founder of Kobalt. Future Cut is a highly in-demand London-based writer/producer duo responsible for producing the recent No.1 debut single,&quot;Please Don't Let Me Go,&quot; for X-Factor star Olly Murs and the Top 5 UK single, &quot;Just Be Good To Green,&quot; for Professor Green. They 've also written a number of chart hits recorded by artists as varied as Lily Allen, Shakira, Tom Jones, Dizzee Rascal &amp; Melanie Fiona, Natasha Bedingfield, Estelle, Kate Nash and the Sugababes, amongst others. \n\nThrough the new deals, Kobalt will administer Lewis and Babalola's individual works as well as their new publishing company, Futurecut Songs Ltd. The deals cover their new copyrights including the recently produced debut single for new Island artist Devlin.\n\nSas Metcalfe, Executive VP Creative of Kobalt Music commented: &quot;We are delighted to have signed this deal with Darren and Tunde. They are one of the UK 's most dynamic writer/producer teams and it 's very exciting for us to be working with them, especially as they start a new chapter in their career, developing new artists through Future Cut Publishing.&quot; \n\nDarren Lewis and Tunde Babalola said, &quot;We are extremely excited to have finally concluded this deal with Kobalt. Being well established now in the industry we felt that it was time to find a publishing partner to help us move forward with both our projects whilst giving us the freedom to develop and sign new acts and writers. We are certain that the Future Cut Songs/Kobalt deal will be the perfect vehicle with which to do this, and with Paper Crows we hope be the start of things to come.&quot;\n\nThey are currently working on a number of signed-artist projects as well as other writers and artists they are developing themselves. Their first signing to Futurecut Songs Ltd. is the duo Paper Crows (Emma Panas and Duncan McDougall). Paper Crows will release their first single &quot;Stand Alight&quot; (Future Cut Recordings) on 11 October 2010. \n\nKobalt executives involved in the deal include Sas Metcalfe, Kobalt EVP Creative; Sam Winwood, Kobalt VP of International Repertoire; and Benjamin Groff, Kobalt Sr.VP Creative."
]