[
"LOS ANGELES, CA -- Grammy nominated record producer, songwriter, mixer and musician Greg Wells is the latest superstar writer/producer to conclude a worldwide deal with leading independent publisher Kobalt Music Group. \n\n&quot;It's no question that Greg Wells is at the top of his game and creating some of the most popular and critically acclaimed music in the world today. We're fortunate to be working with him for creative, administration and synchronization and look forward to a long relationship with such an amazing talent,&quot; said Willard Ahdritz, CEO and Founder of Kobalt Music Group. \n\nGreg Wells commented: &quot;I feel fortunate to be able to partner with such a cutting edge company. Kobalt offers something no other music publisher can, between the creative team and the speed and transparency of royalty collection. After careful consideration of all options, Kobalt was the only choice for me.&quot; \n\nThrough the new relationship, Kobalt will represent and administer Wells' new and most recent repertoire including forthcoming songs by Katy Perry, in addition to hits by such artists as Adam Lambert, Rivers Cuomo from Weezer, Allison Ireheta, and Boyzone. Benjamin Groff, Senior VP Creative of Kobalt, will work closely with Wells to spearhead creative opportunities, along with Kobalt's global synch and creative staff. \n\nBased in Los Angeles, Wells has also produced, written and mixed hits with such artists as OneRepublic, Aerosmith, Bon Jovi, Celine Dion, Mika, Pink, Natasha Bedingfield, Jamie Cullum, The Veronicas, Adele, Deftones, Otep, Colbie Callait, Rufus Wainwright, Creeper Lagoon, Selena Gomez, Miley Cyrus, Alison Iraheta, Latin pop star Belinda, and the Count Basie Orchestra. \n\nWells also co-wrote Kelly Clarkson's hit single &quot;I Do Not Hook Up&quot; with Katy Perry and Kara DioGuardi. He produced four songs and co-wrote two on Katy Perry's CD, One of the Boys, including &quot;Fingerprints&quot; and &quot;UR So Gay.&quot; Wells produced One Republic's &quot;Apologize&quot; remix by Timbaland and the original version. As one of the most successful songs of the decade, &quot;Apologize&quot; stayed at No. 1 for eight consecutive weeks in the U.S., according to Billboard, and has generated sales of over 10 million units worldwide. Additionally, Mika's 6 million-selling album debut, Life in Cartoon Motion, was produced and mixed by Wells."
]