[
"29 August 2013, London: - Multiple Brit &amp; Grammy award-winner Boy George, seller of over 150 million records and one of our generation's most iconic artists, has signed a worldwide label services deal with Kobalt Label Services (KLS) to release a thrilling new album of original material.\n\n&lsquo;This Is What I Do&rsquo;, his first studio album in 18 years, will be issued on George&rsquo;s own Very Me Records on 28th October and will be supported by live dates across the UK.\n\nThe album features a string of guest musicians including DJ Yoda, Kitty Durham (Kitty Daisy &amp; Lewis), Ally McErlaine (Texas / Red Sky July), MC Spee (Dreadzone) and Nizar Al Issa, many of whom will perform as George&rsquo;s band on his live dates.\n\n'This Is What I Do&rsquo; was written by George and longtime writing partners John Themis, Kevan Frost and Richie Stevens (Soul II Soul, Tina Turner, Simply Red, Culture Club). Richie Stevens also produced the record at London&rsquo;s Cowshed Studios. The album also features writing collaborations with legendary producer Youth, and a version of Yoko Ono's Death Of Samantha. It was mixed by Dave Bascombe (Tears For Fears, Depeche Mode, Pendulum, Doves).\n\nThe KLS deal comes in the wake of George signing to management titans Jazz Summers and Tim Parry of Big Life Management.  The pair are working to repeat with George what they have achieved for Scissor Sisters, Snow Patrol and The Verve.\n\nBoy George said today: &quot;This is the first record I have ever made and owned myself. It's very exciting to be a bit more in control of my work and to be doing this independently feels very liberating. Working with Kobalt adds to the excitement. I feel that I'm going to get more personal involvement from them, and have been very impressed with their work with Pet Shop Boys recently.&rdquo;\n\nSummers added: &ldquo;Over the last year Boy George has written some brilliant songs, and together with Richie Stevens has produced an amazing album, his first serious studio album in 18 years since &lsquo;Cheapness and Beauty&rsquo;. Richie has managed to capture George at his best and together they have made an album that reflects all of George&rsquo;s influences, from reggae to rock to country to soul. George&rsquo;s iconic voice sounds better than ever in this stunning collection of songs. The album title &lsquo;This Is What I Do&rsquo; says it all.\n\n&ldquo;We at Big Life are truly excited to be able to work with Kobalt Label Services on such an amazing project. The worldwide expertise of Richard Sanders coupled with Paul Hitchman&rsquo;s experienced knowledge of digital releases and social media heads up an exciting team of people who really understand how to break artists internationally. It&rsquo;s the perfect home for George&rsquo;s label &lsquo;Very Me Records&rsquo; and we look forward to great success together.&rdquo;\n\nPaul Hitchman, Managing Director, Kobalt Label Services commented: &ldquo;Kobalt Label Services works with a wide range of artists from the newest developing artists to global icons, but for us it always starts with the music, and with &lsquo;This Is What I Do&rsquo; Boy George has created an album of exceptional songs, spanning the personal and universal. We feel privileged and excited to be working with George and the Big Life management team to support the release of such a distinctive record by such a unique artist.&rdquo;\n\nBoy George needs little introduction. With a career spanning over 30 years he first shot to international stardom in the 1980s as the front man of one of the UK&rsquo;s biggest exports - the Brit &amp; Grammy Award-winning Culture Club - and has had continued success as a solo artist.  He has sold over 150 million records with top 10 hits in every country.   Boy George is also a hugely respected house DJ, playing for twenty years, and continues to DJ successfully in clubs all over the world.  However it is his new album, &lsquo;This Is What I Do&rsquo;, that reinforces his first true love, writing &amp; singing.\n\n&lsquo;This Is What I Do&rsquo; Track listing:\n\nKing of Everything\nBigger Than War\nLive Your Life\nMy God\nIt&rsquo;s Easy\nDeath of Samantha\nAny Road\nMy Star\nLove and Danger\nNice and Slow\nPlay Me\nFeel the Vibration\n\nThis Is What I Do Tour - UK Dates:\n  \nSun 3rd Nov    Manchester RNCM\nTue 5th Nov    Birmingham Glee Club\nWed 6th Nov    Leeds City Varieties Music Hall\nThurs 7th Nov    Glasgow King Tuts\nSat 9th Nov    Oxford O2 Academy 2\nSun 10th Nov    London Koko (as part of Virgin Records 40th anniversary)\nMon 11th Nov    Brighton Concorde 2\n\n\nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\nKobalt Label Services&rsquo; first international album release, &ldquo;Push The Sky Away&rdquo; by Nick Cave &amp; the Bad Seeds debuted at number one in seven countries and top four in thirteen others.  Their recent release &ldquo;Electric&rdquo; by Pet Shop Boys saw the band achieve their highest chart positions in 20 years across the US and Europe.\n\n                                                           \n                                                           # # #\n"
]