[
"LOS ANGELES (August 13, 2013) -- Kobalt Label Services (KLS) has struck an exclusive deal to be the official worldwide (excluding the territories of Germany, Switzerland and Austria, which will be released by Membran) label services partner for the highly anticipated new album by renowned artist, producer and composer Dave Stewart.\n\nThe album is due for release on September 30 on Stewart's own label, Weapons of Mass Entertainment (WME) via KLS. The first single entitled, &quot;Every Single Night&quot; featuring Martina McBride, impacts radio in the U.S. on August 13th.  KLS will market and distribute globally through its wholly-owned global digital platform and network of physical distribution partners.\n\n    &quot;I've had a really great relationship with Kobalt for over five years and it seemed natural to me         when they started KLS, to continue working with such a great company.&quot;\n\nStewart is already a long-time, worldwide Kobalt client in the music publishing area and this year also tapped Kobalt's neighbouring rights division to represent his entire repertoire throughout the world. \n&quot;As an entrepreneur and pioneer of innovation himself, Dave has been a long-time supporter and valued client of Kobalt's alternative model. We're extremely proud to further extend our already successful relationship with him to be his official label services partner on this exciting new album,&quot; said Richard Sanders, President of Kobalt Music Group and Chairman of KLS.\n \nAbout DAVE STEWART:\n\n&quot;An explosive musician, deft guitar player, innately recognizes the genius in other people and puts it into play without being manipulative.&quot; - Bob Dylan\n \n&quot;Jack of All Trades Master of All of Them&quot; - The Sunday Times\n \n&quot;He's the musician's musician.&quot; - Rolling Stone\n \nFor a full bio on STEWART, click here: http://www.weaponsofme.com/emp-19\n \nhttp://davestewart.com/\nhttp://www.facebook.com/davestewart\nhttp://www.myspace.com/thedavestewart\nhttp://twitter.com/davestewart\nhttp://www.youtube.com/user/DaveStewartOfficial\n \n \n \n# # #\n \nAbout Kobalt Label Services (KLS)\n \nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n \n# # #\n \nKobalt Music Group Contact: \n\nRebekah Alperin, SVP Communications &amp; Marketing - Worldwide\n\nCell/Text: +1.310.770.1045 / e-Mail: rebekah.alperin@kobaltmusic.com\n\nMSOPR Contact:\nMitch Schneider/Marcee Rondan\n818-380-0400\nmschneider@msopr.com\nmarcee@msopr.com\n"
]