[
"LONDON, UK -- Ti&euml;sto, an award winning, multi-million global selling Dutch electronic artist, producer and the biggest DJ in the world, is the latest superstar artist to strike a pact with leading independent music publisher Kobalt Music Group (Kobalt).\n\nKobalt will represent Ti&euml;sto on a global level through the administration and creative services deal with artist's After Midnight Productions Ltdd/b/a Musical Freedom Publishing.\n\n&quot;We are extremely excited to have signed superstar artist and DJ, Ti&euml;sto. Besides synch and transparent, online administration services, our senior VP of creative Benjamin Groff, who was instrumental in orchestrating the deal for Kobalt, will work along with our A&amp;R team in developing collaborative opportunities for Ti&euml;sto,&quot; said Willard Ahdritz, Founder and CEO of Kobalt. \n\nThe deal covers new works by Ti&euml;sto, including the new radio single, &quot;Feel It,&quot; by Three 6 Mafia featuring Ti&euml;sto, Sean Kingston and Flo Rida. Kobalt additionally is representing Ti&euml;sto's latest release, Kaleidoscope (Ultra Records). The album was recorded in collaboration with a variety of music talents from the worlds of rock, pop and indie including J&oacute;nsi Birgisson from Sigur R&oacute;s,Kele Okereke from Bloc Party,Nelly Furtado, Calvin Harris,Emily Haines from Metric, Dizzee Rascal and Kobalt published artist C.C. Sheffield, to name a few. Ti&euml;sto has just released the extended versions of tracks from Kaleidoscope. This brand new release features never before heard versions of &quot;Feel It In My Bones&quot; (feat Tegan &amp; Sara),&quot;Here On Earth&quot; (feat Cary Brothers),&quot;I Will Be Strong&quot; (feat. Priscilla Ahn),&quot;Century&quot; (feat Calvin Harris) and eight others. \n\nA 2007 Grammy Nominee, Ti&euml;sto has won a multitude of accolades including the ranking of No.1 DJ in the World by Mix Magazine in the years 2008, 2004, and 2003. He most recently played a 106-city world tour playing to stadium crowds anywhere between 15,000 and 150,000 in attendance. As an in-demand re-mix specialist, Ti&euml;sto's past hit singles include a remix of Delerium's &quot;Silence&quot; featuring Sarah McLachlan and other remixes for The Killers, Jose Gonzales, Imogen Heap, Justin Timberlake, Britney Spears, Yeah Yeah Yeahs and Bloc Party. Additionally he performed at the prestigious opening of the 2004 Olympic games, which garnered more than a billion in television audience. \n"
]