[
"\n\nCANNES, FRANCE -- Kobalt Music Group (Kobalt), the leading independent music publisher and forerunner of online administration, will soon debut the next version of its transparent administration system with new tools never before available to the music industry. \n\nWillard Ahdritz, CEO and Founder of Kobalt, announced today the Kobalt Next Generation Portal 3.0 Digital will offer unprecedented access to detailed information on collections in digital music sales and performance royalties and other digital revenue streams. Additionally the system will offer expanded access to data on products tracked and audio visual performance royalties collected from licensed content in global film and TV productions. \n\n&quot;We're opening another black box for the industry and taking transparency to the next level deeper into different royalty streams,&quot; said Ahdritz. &quot;Offering the best digital collection platform available, our new and improved 3.0 digital system, which is in final stages of testing, is slated to launch this summer for Kobalt clients worldwide.&quot; \n\nKobalt clients will have access to a breakdown of revenue detail from nearly all digital sales outlets in each territory. The data will include full transparency in tracking per licensee for digital performance rights and downloads, ringtones, and streaming. In addition to digital collections data, clients will also be able to view specifics not only on the status and amount of every synch license, but also the status of receipt of film and TV performance revenues listed by licensee and by territory. \n\nKobalt's online system is already being used by more than 900 clients in a wide spectrum of content owners including music publishers, rights licensors, songwriter/producers, management companies. Kobalt's system will continue to feature its easy to use copyright management tools including a product works search; royalty analysis tools linking products to works and revenues; real-time duplicate claims reports; detailed works summaries; in-depth royalty tracking reports; quarterly summaries; royalty registration reports; access to client agreements; and a downloadable archive of statements, among other features.\n"
]