[
"NEW YORK, NY -- Nearly 40 years and over 100 million albums sold since he signed his first traditional music publishing deal, Dave Stewart, one of the most respected and accomplished artists, producers and songwriters in modern music, has made yet another revolutionary turn and opted to sign a new worldwide deal with Kobalt Music Group, a leading technology and service-based online music publisher. The announcement comes as Stewart, recently named one of Fast Company Magazine's &quot;Most Creative People in Business,&quot; continues to forge new business models well beyond music including film, fashion and technology. \n\nThe announcement was made today by Willard Ahdritz, CEO and Founder of Kobalt and Stewart's manager, Dave Kaplan. Through the deal, Kobalt will administer Stewart's songs, and their international synch licensing team and agents will represent Stewart for synch licensing for film, TV, advertising, ring tones, games and other media. \n\n&quot;Dave Stewart is not only a member of rock royalty and one of the most prolific songwriter/producers of our time, he is a visionary thinker. He's always been on the forefront of what is coming next in music and in the technology of music delivery. We are utterly privileged to be working with him on a global basis, both in administration and creative services,&quot; added Ahdritz. \n\n&quot;Dave has always been passionate and fearless about pushing boundaries and pioneering change, while at the same time writing countless smash hit songs that are still played around the world every day,&quot; said Kaplan. &quot;After being involved in traditional publishing deals ever since he was a struggling young teenager in Sunderland, Dave has now made the bold decision to move away from the old structure, and the lure of the huge advance checks, in favor of the new, fresh approach of the Kobalt model. This deal teams Dave with like-minded people and allows him to continue to unleash his crazy-ingenious ideas for disrupting and revolutionizing the entertainment universe.&quot;\n\nAs co-founder of Eurythmics, Dave Stewart, along with Annie Lennox, penned such hits as &quot;Sweet Dreams,&quot; &quot;Here Comes the Rain Again,&quot; &quot;Would I Lie to You,&quot; &quot;Missionary Man,&quot; &quot;Sisters Are Doing It For Themselves&quot; (with Aretha Franklin) and many others. He has also written for or in collaboration with such artists as Tom Petty (&quot;Don't Come Around Here No More&quot;), No Doubt (&quot;Underneath It All&quot;), Mick Jagger (the Golden Globe winning song &quot;Old Habits Die Hard&quot;) Celine Dion (&quot;Taking Chances&quot;) U2, Jon Bon Jovi, Bryan Ferry, Bob Geldof, Bono, Paul McCartney, Anastacia, Shakira and Sinead O'Connor.\n\nStewart has written numerous film scores for directors such as Robert Altman, Paul Verhoeven and Ted Demme. He wrote and/or produced the title songs for the films &quot;1984,&quot; &quot;Scrooged,&quot; &quot;Put a Little Love in Your Heart,&quot; sung by Al Green, &quot;Ruthless People,&quot; sung by Mick Jagger and Daryl Hall, &quot;Around the World in 80 Days,&quot; &quot;Bird on a Wire,&quot; sung by the Neville Brothers and &quot;Charlotte's Web&quot; sung by Sarah McLaughlin. Along with Jagger, Stewart also wrote and produced the score and six songs for Charles Shyer's &quot;Alfie.&quot;\n\nBoth Stewart and Annie Lennox were celebrated when Eurythmics were inducted into the UK Hall of Fame in 2005. Stewart and Lennox have received numerous awards including the very prestigious Lifetime Achievement Award from the Brit Awards. Stewart has won Best Producer four times, as well as numerous Grammy Awards, MTV Awards and Best British Songwriter awards.\n\nStewart was recently hired as a consultant for Nokia, the world's largest mobile phone company, where he was given the unique title of &quot;Change Agent,&quot; charged with ensuring the artists' point of view is represented in the &quot;new world&quot; and creating new content business paradigms for the entertainment industry. A recent Washington Post article hailed Stewart's innovation in this arena, calling him &quot;a man who vows to drop a 'neutron bomb' on the current entertainment distribution model.&quot; "
]