[
"In September 2013, Music Week's Paul Williams reported on Kobalt's new hiring of Vincent Clery-Melin to the position of global MD of Kobalt label Services' AWAL. View the story here:\nhttp://www.musicweek.com/news/read/clery-martin-joins-kobalt/056006\n\nOfficial statement from Kobalt Label Services: \n\nFor Release on 11 September 2013 \n \nVINCENT CLERY-MELIN JOINS KOBALT LABEL SERVICES AS MD OF AWAL\n\n11 SEPTEMBER 2013, LONDON: Kobalt Label Services (KLS) announces today that Vincent Clery-Melin has joined the company as global MD of AWAL, the digital distribution and marketing services company that Kobalt acquired at the end of 2011.\n\nSince 2004 AWAL has been a pioneering digital distribution company, and Clery-Melin&rsquo;s role will be to lead the evolution and expansion of AWAL to become the digitally-focused services company of choice for independent artists and labels worldwide.\n\nClery-Melin joins Kobalt from Cooperative Music (Co-op), a business he founded and managed for 8 years. At Co-op he worked with many of the most influential and successful independent labels such as Glassnote, Bella Union, Kitsune and Downtown Music, and artists including Mumford &amp; Sons, Fleet Foxes, Phoenix, Two Door Cinema Club and Bloc Party. Prior to founding Co-op Clery-Melin was VP, Marketing for EMI Music Continental Europe.\n\nClery-Melin will be based in Kobalt&rsquo;s London office and will report to Paul Hitchman, Managing Director of Kobalt Label Services.  In his new role Clery-Melin will also work with Hitchman and the KLS team to sign clients for Kobalt Label Services.\n\nSaid Clery-Melin of his new role &ldquo;I&rsquo;m incredibly excited to be joining Kobalt and AWAL. For the last 8 years I have been working with indie labels and independent-minded artists, and I believe Kobalt has the vision, the ambition, and the means to become THE true 21st century music services company. I&rsquo;m looking forward to working with the teams at AWAL, and also at Kobalt Label Services, and to being a part of helping AWAL become the services company of the future for independent labels and artists.&rdquo;\n\nAdded Hitchman &ldquo;I am thrilled to be able to welcome Vincent to Kobalt Label Services. AWAL represents a massive global opportunity and Vincent&rsquo;s appointment shows the scale of our ambition for developing and growing the AWAL business. His experience, all round music knowledge and entrepreneurial flair will be a huge asset both to AWAL&rsquo;s clients and to the Kobalt Label Services team as a whole.&rdquo;\n\nABOUT AWAL\nA division of Kobalt Label Services, AWAL is a leading, global independent digital distribution and marketing services provider which distributes its catalogue of more than 100,000 tracks from 6,000 artists into some 300 digital music services worldwide. Since 2004, AWAL has been the springboard to success for many artists including Arctic Monkeys, Editors, Klaxons, Gabrielle Aplin, Daughter and Nina Nesbitt. Current clients include Radiohead, Moby, Beck, Basement Jaxx and Passenger.  AWAL delivers a premium digital distribution and marketing service with a fair and transparent business model. Clients receive detailed monthly accounting and can view their sales online, on-demand and up to the previous day. AWAL was acquired by Kobalt Music Group at the end of 2011, and now also provides digital distribution for clients of Kobalt Label Services. www.awal.com\n\nABOUT KOBALT LABEL SERVICES (KLS)\nPart of the Kobalt Music Group, Kobalt Label Services provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases. www.kobaltmusic.com\n\n                                                         # # #\n\nContact: Rebekah Alperin, SVP Communications &amp; Marketing - Worldwide, Kobalt Music Group\n+1.310.770.1045   rebekah.alperin@kobaltmusic.com\n"
]