[
"NEW YORK, NY -- On the heels of his new chart-topping smash hit CD, &quot;Back On My B.S.&quot; (Universal/ Motown), iconic rapper/MC and multi-platinum artist Busta Rhymes has signed an exclusive, worldwide administration deal with Kobalt Music Group, it was announced today by Willard Ahdritz, CEO and Founder of Kobalt.\n    \nThrough the deal Kobalt immediately begins administration of 27 songs including all of Busta Rhymes' works on the new album and its first lead single &quot;Arab Money.&quot; In July 2010 Kobalt will take over from Warner Chappell the administration of an additional 150 songs in his stellar back catalog.\n\n&quot;We are thrilled to conclude this deal with Busta Rhymes which also includes synch licensing and creative services for film, TV, games, ringtones and other media. He is truly one of the most influential artists in hip-hop history and we look forward to working closely with him,&quot; said Ahdritz. \n\n&quot;We chose Kobalt not only for their competitive deal structure and fully transparent, online accounting system, but also because the team at Kobalt is knowledgeable, experienced and extremely involved and aggressive -- all the key elements we were looking for in our publisher. We're very happy to be here,&quot; said Mona Scott-Young, manager of Busta Rhymes.\n\n&quot;Back On My B.S&quot;. recently made its debut at No. 5 on The Billboard 200 album chart. The album features production by Ron Browz, Cool &amp; Dre, Ty Fyyfe, Focus, Pharrell, Mr. Porter, Jelly Roll, long-time collaborator DJ Scratch, and guests appearances by some of today's premiere hip-hop and R&amp;B recording artists including Common, Mary J. Blige, Jamie Foxx &amp; John Legend(Decision), T.I. &amp; Akon (Don't Believe Them) and Estelle (World Go Round). The album features the singles &quot;Arab Money,&quot; produced by Ron Browz, &quot;Hustler's Anthem 09&quot; featuring T-Pain, and the Focus produced track &quot;Respect My Conglomerate&quot; featuring Lil Wayne and Jadakiss. "
]