[
"KOBALT IS NOW REPRESENTING MAROON 5&rsquo;S FUTURE WORKS AND PROVIDING CREATIVE SERVICES INCLUDING SYNCHRONIZATION\n\nLOS ANGELES, CA (Sept. 16, 2013) -- Global music powerhouse and multi Grammy-winning act Maroon 5 has signed an exclusive, worldwide administration deal with Kobalt Music Group. The announcement was made by Richard Sanders, President of Kobalt. As part of the deal Kobalt will represent the band for all of their new works going forward including their next album. In addition the company will provide creative services as well as synch licensing worldwide for music use in film, TV, advertising, games, and other media. \n\n&ldquo;As one of the most popular acts in the world, Maroon 5 have such a broad range of musical talents and have mastered the art of crafting great songs that resonate with audiences worldwide. We&rsquo;re thrilled to be representing the band and look forward to a long relationship together,&rdquo; said Sanders.\n\nGrammy Award-winning recording artist Maroon 5 has left an indelible mark on popular music. The heartfelt ballads and anthems have become part of the fabric of popular music. Maroon 5&rsquo;s new album Overexposed was released in 2012 and became an instant smash hit. The group was recently nominated for two Grammy Awards in the categories of Best Pop Performance and Best Pop Album. These recognitions mark the 11th Grammy nomination for the three-time Grammy award-winning band. The third single off of Overexposed, &ldquo;Daylight,&rdquo; notably claimed the No.1 spot on both Top 40 and Hot AC radio charts. In the process, the band set a record for the most No.1s (six in total) by a group in the Top 40 chart&rsquo;s 20-year history. Maroon 5 recently released a new single, &ldquo;Love Somebody,&rdquo; in conjunction with their U.S. tour, with dates happening through October. In addition to his work with the group, Adam Levine is a coach on the NBC hit television series The Voice. For more information and tour dates please visit www.maroon5.com. \n"
]