[
"NASHVILLE, TN -- Willard Ahdritz, Founder and CEO of Kobalt Music Group (Kobalt), a global independent and leading online music publisher, will be in Nashville to provide a preview of Kobalt's next generation technology, the most advanced online music publishing administration system available worldwide. \n\nAhdritz and Kobalt Music Nashville's Whitney Daane will demonstrate and greet Nashville executives at an exclusive VIP lunch event held on Thursday, September 25, 2008 at 12:30 p.m. at Cabana. \n\nThe system, which offers unparalleled transparency and features not available through any other company, is already being used by more than 700 songwriters, publishers and managers, including such Nashville-based songwriting heavyweights Desmond Child, Dennis Matkosky, Gary Burr, Sharon Vaughn, Robin Lerner, Toby Keith, Aimee Mayo, Gary Baker, as well as publishers Cal IV Entertainment and Wrensong Music Publishing among many others.\n\nRegarding the new system, Sharon Vaughn, Grammy and Oscar nominated songwriter/producer, comments: &quot;After endless years as a professional songwriter, and now writing from one side of the world to the other, I am thrilled with the scope of Kobalt's ability not only to provide creative support worldwide but also track my varied royalty streams and make that information available to me 24/7 on my laptop! I love the people, and I love the portal!&quot;\n\n&quot;Kobalt has the transparent publishing model and online portal that has set the standard for the industry, and they continue to raise the bar. They do the work of a traditional publisher for a reasonable fee, while still allowing its songwriters to keep their copyright ownership. To me it's a no-brainer, and something I am recommending to all of my clients,&quot; added attorney Jordan S. Keller, Partner Lassiter, Tidwell, Davis, Keller &amp; Hogan.\n\nThe new Kobalt system offers much more than just a glance at basic top line royalty information and accounts overview. It offers access to money through an online pipeline advance system and multi-layered access into nearly every aspect of copyright management. Additionally, it offers clients an unprecedented real-time status of every synchronization license request that has been quoted to potential licensees of music for use in films, TV, advertising and other media.\n\n&quot;As synchronization revenues are critical to the marketing and long-term value of songs, Kobalt's transparency of information on these kinds of deals and transactions can be invaluable to the copyright holder,&quot; said Ahdritz. \n\nSynchronization license information now available to the client through the Kobalt online portal includes: a detailed status of the license quote; if music was used; if the corresponding licensing fees have been paid; if the client denied the use; and/or if the license quote has been closed out.\n\nClients, including rights holders, publishers, managers or attorneys, with multiple accounts may also access all of their accounts with just one log-in. Other new and improved features in the Kobalt portal include: easy to use royalty analysis matrixes linking products to works and revenues; real-time duplicate claims reports; more detailed works summaries; information on products released (and royalty collections) by territory or by copyright; in-depth royalty tracking reports; advanced search functions; quarterly summaries; royalty registration reports; access to the original client agreements; and a downloadable archive of statements, among other features.\n\nOther comments about the new system offered by Kobalt Nashville clients: \n\n&quot;Kobalt's admin technology and that aspect of their business is very important to me, but more importantly, I would hang out with these people...They have a great creative team... It's the best of both worlds!&quot; -- Dennis Matkosky, Grammy award-winning songwriter \n\n&quot;I am thrilled to be a member of the Kobalt family. I've never felt so taken care of on every level. As a songwriter, publisher and friend...there is no better home than Kobalt!&quot; -- Desmond Child, legendary songwriter/producer and 2008 Songwriter's Hall of Fame inductee \n\n&quot;Kobalt feels like family: a family where every member cares about my career as much as I do. From tracking the dough to pitching, they give me the weapons I need to stay in the battle of show business.&quot; -- Gary Burr, Nashville Songwriter Hall Of Fame Member, songwriter/producer \n\n&quot;After having my foreign royalties collected by mostly majors over the last twenty years, I switched to Kobalt and not only do I get paid quarterly, which is great in and of itself, but I get paid more than I was ever paid by any major. Their technology has made it so much easier for us to keep track of what's going on outside our backyard!&quot; -- Ree Guyer Buchanan - Owner, Wrensong Music Publishing \n\n&quot;Kobalt's technology has made it incredibly easy for me to track our royalties worldwide and account to our writers. Literally within seconds, I can access the information I need, whether it's by song title, writer, album, country...this is amazing!&quot; -- Gary Baker, Grammy award-winning writer/producer/publisher and Kobalt client "
]