[
"CANNES, FRANCE -- National Geographic Entertainment has entered into an exclusive relationship between its music division Nat Geo Music (www.natgeomusic.net) and leading independent global music publisher Kobalt Music Group. Kobalt will globally represent Nat Geo Music's catalog and provide full-service music publishing administration, including registration of copyrights with performance societies. National Geographic's music library contains more than 16,000 original music cues, including the organization's iconic theme song. \n\nThe announcement was made today by David Beal, president of National Geographic Entertainment, and Willard Ahdritz, CEO and founder of Kobalt. \n\n&quot;We think that Kobalt is uniquely positioned to complement Nat Geo Music and maximize revenue potential for our rich catalog of copyrights. Kobalt's customized services and state-of-theart Next Generation Portal will allow us to be completely involved in the process of copyright management, royalty tracking and analysis,&quot; said Beal.\n\n&quot;David Beal's strategy for developing Nat Geo Music is very exciting. We are very happy to be a part of that vision by taking Nat Geo Music's film and TV administration to a new level using new technology on a global basis,&quot; added Ahdritz. \n\nAdditionally, Kobalt's film and TV departments and agents worldwide will work closely with Jeff Clyburn, a director at Nat Geo Music, to generate new revenue streams and secure synchronization opportunities for Nat Geo Music through uses in motion picture, TV, advertising and other media. Since the 1960s National Geographic has created thousands of hours of some of the finest documentary television and motion pictures. Nat Geo Music, formed in 2006 under the direction of Beal, has expanded to include not only the music publishing catalog but also a growing music production library, music supervision services, full-service record label, live events, an international music and lifestyle cable channel, a world music Web site and original network programming. \n\nNat Geo Music's 24/7 television channel broadcasts throughout Europe, Latin America and Africa and features a mix of music videos and concerts from top international artists and original programming, such as &quot;Geo Sessions,&quot; an exclusive concert and interview series; &quot;Short Trips,&quot; mini-docs that explore the intersection between music and culture; and &quot;UNTZ,&quot; a Friday night dance block that features the best dance music from all over the world.\n"
]