[
"NEW YORK, NY -- Kobalt Music Group (Kobalt) has signed an exclusive new administration deal with award-winning songwriter/producer and artist Darrell Brown. The announcement was made today by Willard Ahdritz, CEO and Founder of Kobalt. \n\nThrough the deal, Kobalt will represent Brown's Grey Ink Music catalogue plus futures for the World excluding Australia and New Zealand. The company will also provide synchronization services for motion pictures, TV, advertising, games, ringtones, internet and other mediums. \n\nIn making the announcement, Ahdritz said: &quot;We are extremely proud to be working with Darrell Brown. His long list of hits speak for themselves. He is truly a professional and extremely creative writer who crafts perennial songs that appeal to artists in multiple genres. We look forward to a long term relationship.&quot; \n\nWith repertoire responsible for more than 70 million units sold worldwide, the multi talented Brown has worked with a who's who in the industry including Neil Young, LeAnn Rimes, Keith Urban, Bon Jovi, Faith Hill, Brooks and Dunn, Dolly Parton, Wilson Phillips, Trace Adkins, Michael McDonald, Take 6, Kenny Loggins, Hall and Oates, John Farhnam, Smokey Robinson, Radney Foster, among others.\n\nBrown has upcoming releases with Bon Jovi (&quot;Work For The Working Man&quot;), Josh Turner's next lead single, &quot;Why Don't We Just Dance,&quot; Jack Ingram (&quot;Heartache&quot;). For Radney Foster's critically acclaimed new release, &quot;Revival,&quot; Brown not only produced and arranged but he also co-authored half of the songs.\n\nHe is additionally working with LeAnn Rimes for her next recording project. Brown previously collaborated with the legendary Neil Young when he co-arranged and conducted the 100 voice choir for Young's latest album, &quot;Living with War,&quot; which garnered much attention and great reviews. Formerly, he co-wrote and arranged Keith Urban's No.1 Grammy-winning, massive radio hit &quot;You'll Think of Me&quot; for which Brown earned three ASCAP Awards. He also penned the hit &quot;Raining on Sunday&quot; for Urban as well as various other songs for his 4x platinum CD including, &quot;Be Here,&quot; and Urban's 2x Platinum CD, &quot;Love Pain and the Whole Crazy Thing.&quot; Brown has collaborated with Keith Urban on his most recent '09 release &quot;Defying Gravity&quot;, and co-wrote the song, &quot;If Ever I Could Love.&quot;\n\nBrown is also responsible for the creation and production of specific music that has been written and designed for Electronic Arts' hit video games that include such franchises as The Sims 3, Boogie and Boogie Superstar, Lord of the Rings - Conquest, American Idol, NBA, Nascar, and Playground among many others. Brown has also written or produced music that has appeared in such films as Cruel Intentions as well as television series including Vegas, Providence and One Tree Hill. "
]