[
"BILLBOARD -- Willard Ahdritz's inspiration for Kobalt Music's business model came in part from an unlikely source: his experience working with an airline when he was a project manager at L.E.K. Consulting. \n\nAt the airline, he evaluated how that company tracked luggage using point-to-point routing, instead of the hub-to-spoke routing most airlines used. Noting the similarity between how most airlines operate and how publishers interact with the various performance societies around the world, Ahdritz, co-founder of Telegram Records and Publishing, says he saw an opportunity to develop technology to communicate directly with collection societies.\n\n&quot;I wrote the whole business plan in 50 minutes and that was the model we followed for the first five years,&quot; Ahdritz says. \n\nSince its founding as a pure-play music publishing administrator in 2001 with the backing of Spark Ventures, Kobalt Music has grown to where its gross collections last year reached $50 million, Billboard estimates. Earlier this year, Kobalt received another equity infusion, this time $16 million from Balderton Capital, formerly Benchmark Europe. \n\nAhdritz claims that his vision of a high-service provider based on transparency, accuracy and speed has produced an innovative business model that is changing the publishing industry. \n\n&quot;They have come up with innovative ways to market their business,&quot; says a veteran publishing executive who heads up a growing independent publishing firm. &quot;Now I want to know, Does the reality match up to the marketing push?&quot; \n\nTHE BILLBOARD Q&amp;A\n\nQ: So does your walk match your talk? \n\nA: We have the track record that this is the model for the future. Our clients typically experience up to 25% more revenue on average when they come to us from a traditional publishing model. So today we are 60 people in five offices. We were the No. 1 indie publisher in the U.K. In the first quarter we had 12.2% indie market share and 3% overall, according to Music Week. \n\nQ: But how are you different from the traditional model? \n\nA: We have created a centralized organization supported by our technology platform, which electronically registers works to ASCAP, BMI and to all the collections societies worldwide. By running this model, our clients get their money one year to one-and-a-half years faster. \n\nQ: How is your technology and service model different?\n\nA: We created our own platform based on Oracle relationship databases. We thought coming in that the existing technology could not deliver what we wanted in scalability, registration matrix, security and being able to match the billion of transactions you are going to see in the digital and mobile pipes. So wherever you are in the world, you can log in and follow on this portal and see source data on a global level. They can see in real time when and what they have earned in Germany. They can see it by product, by song, by line item, whatever way you want.\n\nQ: Do you mine that data you capture to increase revenue? \n\nA: We have automated the process of taking secondary data-from places like [Nielsen] SoundScan, ASCAP's Mediaguide and from the U.K.'s [Official Charts Co.], as well as chart data from 28 countries, and we are moving to add digital data and film/TV performance data-all of which is used to match with what we are paid to make sure we are getting the correct amounts at the right rates and splits. \n\nWe cross-reference songs with different product, linking them in our relationship databases. So if you are paid for 10,000 units on one song, you should be paid for 10,000 units on another song on the same album. And this automatic washing machine is generating excellent tracking on a global level in our centralized databases. \n\nQ: Does your technology track the synch process? \n\nA: Yes, a new feature we are launching allows clients to follow the process in real time and track the status. So managers or artists can see if a song has been approved or even used in the end. Has it been paid or invoiced? We believe that with all of these tools that no other company is close with the transparency and details. \n\nQ: What about the RoyaltyWindow.com system that Universal Music Publishing just announced? \n\nA: I expect the market to soon find out who on the portal side is producing the superior service-Kobalt or Universal.\n\nQ: What about your advance process is different?\n\nA: Historically, advances are time-consuming and costly if you are in a contract. With our portal, all 700 of our clients can get an advance in four easy steps, with a low fixed fee and no changes in any other agreements, in a process that is guaranteed within five days but mostly within 24 hours.\n\nThe advance can be small or big, based on three different categories. It can be based on what will be paid in the next statement, with a 2% interest rate fee-or based on what can be seen in the pipeline for a 5% rate-and it can be based on projected revenue, which carries a 7% fee. \n\nQ: In the case of the latter, who is assuming the collection risk?\n\nA: It's all recoupable, but there is a cap of two or three years. If we don't recoup the full amount within the cap time period, then Kobalt is at risk.\n\nQ: How do you see the future of the music industry?\n\nA: You will have the artists and managers, and then you have the service providers-Kobalt or the digital distributors-and for certain cases you will need venture capital for the baby acts. \n\nThe labels are missing in that equation.Historically, it isn't old companies that changed the world: It is the new companies designed to fit into the new world that change things. Having said that, the majors have amazing assets and a couple of them may be able to transform themselves into a new structure and the new industry environment. \n\nQ: Do you see any other new players?\n\nA: Yes, I am very excited about our new strategic partnership with Getty Images, which is one of the leading producers of digital content. Now, Getty is going into music and Kobalt will provide customized services for them. The deal allows for select Kobalt clients to increase synch revenues through Getty's distribution.\n\nQ: When Balderton invested $16 million in Kobalt, Spark Ventures claims its 23% Kobalt stake was worth &pound;7 million [$14 million]. That means that those two firms combined hold about 50% of your company and it implies a valuation of $60 million, or &pound;30 million.\n\nA: No comment, but I would point out that the valuation event was based on results from 12 months ago and we have grown 70% since then. \n\nQ: Why stick with a service model instead of using your expertise to buy and build publishing catalogs? \n\nA: We have had quite a few opportunities to go into ownership and we have said no. We have a few private equity firms as our clients. We don't compete with our clients, so we will stick with a service model."
]