[
"NEW SINGLE/VIDEO &ldquo;PARTY LIKE TOMORROW IS THE END OF THE WORLD&rdquo; FEATURES CELEBRITY GUEST CAMEOS BY BREAKING BAD&rsquo;S RJ MITTE, JOEY FATONE, STEVE O, HAL SPARKS, RON JEREMY AND MORE\n\nNEW STEEL PANTHER ALBUM DUE IN SPRING 2014 ON OPEN E MUSIC VIA KOBALT LABEL SERVICES\n\nLOS ANGELES (October 29, 2013) &ndash; Kobalt Music Group (Kobalt) has concluded two agreements to provide label services and publishing administration for the highly anticipated new album by heavy metal band Steel Panther.\n\nKLS, Kobalt&rsquo;s label services division, is partnering with Open E Music to promote and release the forthcoming Steel Panther album worldwide excluding Japan in the spring 2014.  Steel Panther debuted their new video and single, &ldquo;PARTY LIKE TOMORROW IS THE END OF THE WORLD&rdquo; on Tuesday, October 29 on VEVO. The single was produced by longtime Steel Panther producer Jay Ruston.  The video was directed by and features Rob Riggle (21 Jump Street, The Other Guys, The Daily Show) and features many other celebrity guest cameo appearances including Breaking Bad actor RJ Mitte, N&rsquo;Sync&rsquo;s Joey Fatone, comedian and Jackass star Steve O, comedian Hal Sparks, porn legend Ron Jeremy and former UFC champion Chuck Liddell, Limp Bizkit&rsquo;s Wes Borland, among others.\n\nSteel Panther has also officially become a worldwide music publishing client of Kobalt, which is providing administration and synch licensing for both masters and publishing of the band&rsquo;s entire catalogue, including the new album.\n\nThe band will be on tour in the US, Europe, Japan and Australia to promote the upcoming album. Featuring members Michael Starr (Lead Singer), Satchel (Guitars), Lexxi Foxx (Bass), and Stix Zadinia (Drums), Steel Panther was, for a long time, rock&sup1;s best-kept secret: a cult legend on the LA scene. But in recent years due to the success of their albums (both debuted at No.1 on the Billboard Comedy Album Chart) and live shows, the band has enjoyed huge global acclaim from fans and peers alike. In concert, Steel Panther has been joined on stage by rock and roll icons such as Steven Tyler of Aerosmith, Paul Stanley of KISS, Corey Taylor of Slipknot, Tom Morello of Rage Against The Machine/Audioslave, Chester Bennington of Linkin Park and Green Day to name a few.  Steel Panther has also been seen on Dancing With The Stars, Bad Girl&rsquo;s Club and most recently in a national web campaign for Warner Brothers Pictures film Rock Of Ages. For more information, visit: http://steelpantherrocks.com/\n\nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\n\n                                                          # # #\n\n\n\nKOBALT MUSIC GROUP CONTACT: Rebekah Alperin, SVP Communications/Marketing-Worldwide\nTel/Text: +1.310.770.1045    e-Mail: rebekah.alperin@kobaltmusic.com "
]