[
"SEATTLE, WA and NEW YORK, NY -- Getty Images, the world's leading creator and distributor of visual content and other digital media, and Kobalt Music Group (Kobalt), the leading independent online music publishing company, today announced that Getty Images has appointed Kobalt to provide exclusive, worldwide administration services for Getty Images global music catalog.\n\n&quot;As the unprecedented destination for digital content, Getty Images is revolutionizing the way music is licensed today,&quot; said Jonathan Klein, Co-founder and CEO of Getty Images. &quot;This agreement with Kobalt provides our customers easy access to even more of the world's best music.&quot; \n\n&quot;We are very enthusiastic to begin this strategic partnership with Getty Images, which continues to grow its music catalog and music licensing services,&quot; said Willard Ahdritz, CEO and founder. &quot;Kobalt will be registering Getty Images content with societies around the world and offering a multitude of customized services that will be a natural fit to complement expanding music operations. The new relationship will provide opportunities for new revenue streams for selected clients' copyrights and master recordings. It's a win-win relationship for both companies.&quot; \n\nAs part of the deal, Kobalt will register, track and collect royalties from global performance societies for copyrights licensed by Getty Images through Pump Audio, which licenses the music of independent artists for commercial use in TV, major motion pictures, films, games, internet, and amateur filmmakers, among other uses. \n\nGetty Images and Kobalt will work together to make certain Kobalt content available for licensing for both professional and consumer use through Pump Audio and Soundtrack, an online professional music search and licensing tool. &quot;Getty Images is committed to offering our customers the best content available, including the widest spectrum of recorded music to enhance and transform their projects,&quot; said Nick Evans-Lombe, Chief Operations Officer, Getty Images. &quot;Kobalt is the ideal partner as we continue to grow our music licensing business.&quot; \n\nAbout Getty Images \n\nGetty Images is the world's leading creator and distributor of still imagery, footage and multimedia products, as well as a recognized provider of other forms of premium digital content, including music. Getty Images serves business customers in more than 100 countries and is the first place creative and media professionals turn to discover, purchase and manage images and other digital content. Its award-winning photographers and imagery help customers produce inspiring work which appears every day in the world's most influential newspapers, magazines, advertising campaigns, films, television programs, books and Web sites. Pump Audio, is the leader in music licensing, giving customers direct access to original tracks by some of the world's best independent artists and bands for use in broadcast and film production, advertising and other media projects. Visit Getty Images at www.gettyimages.com to learn more about how the company is advancing the unique role of digital media communications and business, and enabling creative ideas to come to life. To access Getty Images' collection of music from independent artists, visit: www.gettyimages.com/music."
]