[
"November 1, 2013 -- Dizzy Heights, the new album from acclaimed musician and co-frontman Neil Finn, will be released February 10 through Lester Records via Kobalt Label Services (KLS) and is currently available for pre-order here: http://smarturl.it/dizzyheights. \n\nThe record, which follows his sophomore outing, Try Whistling This and One Nil (or One All), was confirmed during a webcast from Finn&rsquo;s Auckland studio. The full webcast, which aired at BrooklynVegan and includes a performance of three new songs from Dizzy Heights, can be viewed here: http://www.brooklynvegan.com/archives/2013/10/come_hangout_wi.html. \n\nAdditionally, as a special preview, a short film created by Finn for the album&rsquo;s lead track &ldquo;Divebomber,&rdquo; which was inspired by the World War II film of the same name, is now streaming on Finn&rsquo;s official YouTube channel here: http://www.youtube.com/neilfinnofficial\n\nThe 11-track album was recorded between Finn&rsquo;s Auckland studio, Roundhead, and Tarbox Road, the upstate New York studio of Dizzy Heights co-producer Dave Fridmann (The Flaming Lips, Tame Impala). Of his latest effort, Finn notes, &ldquo;I didn&rsquo;t want to make it a solo record in a stripped back singer-songwriter sort of way&hellip;I had a feeling Dave would be good at adding some odd shapes to the music, which I always welcome&mdash;making things a little more expansive. He is good at subverting things, and making things sound a bit messed up and not as obvious, rather than being too tasteful, which is always a temptation.&rdquo;\n\nFinn will celebrate the album&rsquo;s release with special performances in Los Angeles and New York before a sold-out show at St. James&rsquo;s Church in Piccadilly, London on November 27. Additional U.S. dates to be announced.\n\nNEIL FINN&rsquo;S, DIZZY HEIGHTS\n1. Impressions\n2. Dizzy Heights\n3. Flying In The Face of Love\n4. Divebomber\n5. Better Than TV\n6. Pony Ride\n7. White Lies and Alibis\n8. Recluse\n9. Strangest Friends \n10. In My Blood\n11. Lights of New York\n\n                                                                                             # # # \n\nFor more information, check out: www.neilfinn.com\n"
]