[
"NEW YORK, NY -- Kobalt Music Group, a global independent and leading online music publisher, today debuts Kobalt Online Pipeline Royalty Advances, a ground-breaking internet tool giving copyright holders the opportunity to take low cost advances against future &quot;pipeline&quot; royalties and/or projected earnings. \n\nThe Online Pipeline Royalty Advances tool went live and was made officially available today to more than 700 of Kobalt's clients worldwide at a celebratory launch event for Kobalt's next generation client portal, the most advanced online music publishing administration system available worldwide. \n\nUpon every log-in to their online account, Kobalt clients can automatically see the amount of immediate money available. \n\nAs part of the system, clients can easily calculate and preview theoretical fees associated with taking advances at different monetary levels. Furthermore, if a client has multiple administration deals with Kobalt, the system will calculate the cost of taking an advance against any one or all of these agreements. Within a few mouse clicks, clients can then generate and submit a customized advance agreement letter which can, upon final execution by Kobalt, lead to the transfer of money or check issue within as little as 24 hours. \n\n&quot;We are pleased to unveil Kobalt Pipeline Online Royalty Advances, giving clients fast access to their money already in the pipeline for distribution, or access to money we project to be collected through incoming sales data or future earnings estimates,&quot; said Willard Ahdritz, founder and CEO of Kobalt. &quot;We're especially thrilled to introduce this service at the same time as our new and improved client portal, which offers unparalleled transparency and a broad range of expanded features currently not available through any other company, including the major music publishers.&quot; \n\nCommemorating the new technology launch Mark Beaven, CEO and Owner of AAM, said: &quot;Their new Online Pipeline Royalty Advances steps the game up a whole 'nother level. This will enable writers to, at-a-glance, better and more easily identify, as well as control, their publishing's financial picture while immediately interfacing it with their direct financial needs. Can you say '3-click cash'? Thought you could.&quot;\n\n&quot;Kobalt has done it again. They continue to raise the bar for publishing administration service by offering new tools and features designed in perfect response to their clients needs and wishes. I know that my clients will appreciate these latest upgrades, and the Online Pipeline Royalty Advance function is guaranteed to be popular,&quot; said attorney Mark Levinsohn, partner of Levinsohn &amp; Arnay, LLP\n\nMusic attorney Michael Selverne added: &quot;Kobalt's Online Pipeline Royalty Advance is an inexpensive, simple and transparent product which provides instant liquidity without the need for complex documents or the significant transaction expense inherent in using outside leverage. A logical evolution for Kobalt, an enterprise built on ease of use and transparency.&quot;\n\nKobalt's new and third version client portal offers much more than just a glance at basic top line royalty information and accounts overview. The new Kobalt portal gives the user multi-layered access into nearly every aspect of copyright management, plus it offers clients an unprecedented real-time status of every synchronization license request that has been quoted to potential licensees of music for use in films, TV, advertising and other media. \n\n&quot;Kobalt is extending its transparent business model to synchronization licensing, which generates a significant segment of publishing revenues and is critical to the marketing and long-term and value of copyrights,&quot; said Ahdritz. \n\nSynchronization license information now available to the client through the online portal includes: a detailed status of the license quote; if music was used; if the corresponding licensing fees have been paid; if the client denied the use; and/or if the license quote has been closed out.\n\nClients, including rights holders, publishers, managers or attorneys, with multiple accounts may also access all of their accounts with just one log-in. Other new and improved features in the Kobalt portal include: easy to use royalty analysis matrixes linking products to works and revenues; real-time duplicate claims reports; more detailed works summaries; information on products released (and royalty collections) by territory or by copyright; in-depth royalty tracking reports; advanced search functions; quarterly summaries; royalty registration reports; access to the original client agreements; and a downloadable archive of statements, among other features.\n\n&quot;Kobalt continues its healthy challenge to raise the bar and provide more in actions, support, and information from a publisher in today's market. In the day of the songwriter entrepreneur, Kobalt's structure strongly empowers and educates artists and songwriters, as well as removes much of the 'huh?' factor out of publishing as a whole,&quot; said Beaven."
]