[
"NEW YORK, NY -- Multi-talented creative powerhouse producer/songwriter Nate &quot;Danja&quot; Hills (Danja) has signed an exclusive, worldwide administration deal with Kobalt Music Group (Kobalt), it was announced today by Willard Ahdritz, CEO and Founder of Kobalt.\n\nThe deal includes administration of new works going forward for Danja, whose recent string of chart-topping hits includes releases by Britney Spears (&quot;Gimme More,&quot; and &quot;Hot as Ice&quot;), Madonna (&quot;4 Minutes&quot; featuring Justin Timberlake), Mariah Carey (&quot;Migrate&quot;), Usher (&quot;Appetite&quot;), Nelly Furtado (including the hits &quot;Promiscuous,&quot; &quot;Maneater&quot; and &quot;Say It Right&quot;), Justin Timberlake (the smash global hit &quot;Sexyback,&quot; &quot;What Goes Around . . . Comes Around,&quot; and &quot;My Love,&quot; among many others). \n\nUpon making the announcement, Ahdritz commented: &quot;Danja is a star and a respected brilliant producer at the top of his game with a hands-on-role in every step of the recording process. We are thrilled he chose Kobalt and we look forward to a long-term relationship with him.&quot; \n\n&quot;I am looking forward to my new relationship with Kobalt. They are a future thinking company with innovative ideas which matches my own approach to music and the business that surrounds it,&quot; said Danja.\n\nA prot&eacute;g&eacute; of hit-making producer Timbaland, Danja has exploded onto the production scene having produced tracks across a variety of genres for a who's who array of global stars, also including Sean &quot;Diddy&quot; Combs, 50 Cent, Missy Elliott, T.I., Ciara, Katharine McPhee, Fantasia, Bjork, and Jennifer Lopez among many others.\n\nDanja received numerous Grammy accolades for his production work in 2007 and was recently awarded SESAC's Songwriter of the Year and Song of the Year. Executives involved in the deal include Ahdritz; Merril Wasserman-Serling, Senior VP of Business Development for Kobalt; and David M. Ehrlich, representation for Danja. \n"
]