[
"DETROIT, MI -- Kobalt Music Group (Kobalt) has concluded an exclusive administration deal for the world ex-U.S. and Canada with Detroit-based Bridgeport Music, it was announced today by Willard Ahdritz, CEO and Founder of Kobalt, Armen Boladian, owner of Bridgeport Music, and Joel Martin, principal of 8 Mile Style Music, who brought the deal to Kobalt. \n\nThe Bridgeport-Westbound music catalog features thousands of original funk, soul and gospel copyrights by George Clinton, Parliament-Funkadelic, The Ohio Players, The Clark Sisters and other legendary Detroit-based artists.\n\nIt includes most of George Clinton's entire back catalog from the 1960's, and includes the hits &quot;Atomic Dog,&quot; &quot;One Nation Under a Groove,&quot; &quot;Can You Get To That,&quot; &quot;You And Your Folks,&quot; &quot;Knee Deep,&quot; &quot;Tear The Roof Off The Sucker,&quot; &quot;Maggot Brain,&quot; &quot;Flashlight,&quot; and more.\n\nAs one of the most heavily sampled catalogs of all time, the treasured song collection has consistently been utilized by hip-hop and R&amp;B superstars for more than two decades. Samples from Bridgeport-Westbound catalog have provided the hooks or backbone of major hits on dozens of multi-platinum selling albums by such artists as Eminem, Dr. Dre, Snoop Dogg, Ice Cube, NWA, Jay-Z, Tupac, Redman, De La Soul, Notorious BIG, and Mary J. Blige, among others.\n\nCommented Ahdritz: &quot;We're ecstatic about representing such an amazing collection of works, which are certainly some of the most fun and popular funk songs of all time. We're grateful to Joel Martin and 8 Mile Style for bringing us this deal and look forward to all of us working closely together.&quot; \n\nAdded Boladian: &quot;I am extremely impressed with Kobalt's business model,&quot;said Boladian. &quot;It was important for me to find an efficient and progressive alternative to the old way of doing things. I've known the guys at 8 Mile Style for many years, and I've watched with real interest as they analyzed the alternatives for aggressive and reliable copyright management. I think Kobalt will do a great job.&quot;\n\nJane Peterer Music Corporation in Burlington, VT. will continue to administer the copyrights in the U.S. and Canada on behalf of Bridgeport Music. The catalog was previously administered for the world ex-US and Canada by Inter-melodie. \n\nThe deal with Kobalt includes representation for synchronization including motion picture, advertising, ringtones, games, and other mediums. Executives involved in the deal include Ahdritz and Martin, with Kobalt legal provided by Michael Petersen, EVP and GM of Kobalt Music Publishing America, and Christiaan Winchester, General Counsel and Director of Business Affairs in Kobalt's London office. Nashville attorney, Richard Busch of King, Ballow handled the deal for Bridgeport."
]