[
"The company, which was formed by CEO Willard Ahdritz, finished as the runaway number one indie publisher of 2007 as it outscored its three nearest rivals combined with a 25.9% share of the independent market. Only a year earlier its share of the independent market had been just 4.0%, putting it in eighth position. \n\nBilling what it offers as &quot;music publishing for the 21st century&quot;, the company markets what it calls its &quot;unique, transparent&quot; systems, which it says take the guesswork out of global royalty collections and reporting, so enabling songwriters to get more money, more quickly.\n\nThat approach has built up a roster that includes the likes of Gwen Stefani, Interpol, Richard Ashcroft, Badly Drawn Boy and Barry Manilow and helped it last year to become the top UK independent publisher of the year for the first time in its history. \n\nIts domination of the indie publishing sector in 2007 is without question in regards market share, but it is also pushing hard at the major publishers. On singles, for example, it finished just 1.8 percentage points behind Sony/ATV as it claimed two-thirds of the year's biggest-selling single, the Leona Lewis-performed Bleeding Love. It also grabbed a 50% share of the Sugababes hit About You Now, the year's sixth top seller, and half of the 13th-placed The Sweet Escape by Gwen Stefani feat. Akon.\n\nAlthough its performance on albums was less pronounced, it could point to an 18.5% share of the Leona Lewis album Spirit, which finished as the year's second top seller, and more than a quarter of Westlife's Back Home in sixth place. \n\nAlthough one of the most successful independents around, the long-established Peermusic was unable to claim a place in 2006's year-end Top 10, but stormed back last year to grab the second spot with a 9.4% share across singles and albums thanks in no small part to Rhianna's mega-hit Umbrella. Peermusic claimed a 40% share of the 10-week chart-topper, which finished as the year's second-biggest single, while it also saw its signing Newton Faulkner top the albums chart in the year with debut offering Hand Built By Robots, which finished as 2007's 24th-biggest seller. \n\nThe previous year Big Life had finished as the top independent after its act Snow Patrol claimed the year's top seller with Eyes Open. So enduring is the album that it ranked in 15th place the following year, helping Big Life to become the third highest-ranked indie with a 9.4% share.\n\nLargely thanks to the Black Eyed Peas, Catalyst was placed as 2003's top independent. Last year the publisher finished in its highest position since then, with a 100% share of X Factor winner Leon Jackson's single pushing it to fourth place with a 6.5% share. Jackson's single When You Believe was the year's fourth top-seller.\n\nNow subject to takeover bids, Chrysalis had a quiet year by its own high standards, finishing in fifth place with 4.8%.\n\nINDEPENDENT SHARE 2007\n1    KOBALT        25.9%\n2    PEERMUSIC    9.4%\n3    BIG LIFE    9.4%\n4    CATALYST    6.5%\n5    CHRYSALIS    4.8%\n6    BUG        4.7%\n7    P AND P        4.4%\n8    REVERB        3.4%\n9    HORNALL        2.9%\n10     BUCKS        2.4%\n"
]