[
"NEW YORK, NY -- As featured in Billboard Magazine, Kobalt Music Group, the music industry's leading online and digital music publisher, has announced the launch of another revolutionary product for copyright holders - the pipeline royalty advance product.\n\nWith financial backing from The Royal Bank of Scotland (RBS), Kobalt's pipeline royalty advance product offers efficient money advances with favorable terms and benefits unlike typical advances or publishing deals.\n\nThe pipeline royalty advance product has been designed to help copyright holders, who typically wait a significant time from when royalties are earned to when they are collected and distributed, access their future earnings (subject to evaluation of future royalty projections).\n\nThrough the service, rights holders can take pipeline advances several times as needed, and with scalable, flexible rates, which automatically go down and reduce costs when advances are recouped. This flexibility now means that more songwriters and rights holders can access the money they need but also retain control of their copyrights and maximize earnings.\n\nCommented Ahdritz: &quot;We are very excited to roll out this successfully tested new service. This product is a natural progression to Kobalt's state-of-the-art online royalty collection, registration and royalty processing as it works to serve the financial interests of the client without forcing the rights holder to have to give up ownership or control of their copyrights. We are very grateful to Antony White and RBS for providing us with the financial support to enable us to offer this new product to our clients.&quot;\n\nAntony White, Relationship Manager at RBS commented: &quot;By working closely with the Kobalt team to clearly understand the company's business objectives, I along with my colleagues at RBS were able to deliver a bespoke financial solution to enable Kobalt to develop its new product. This is a win-win approach for Kobalt and its customers and I wish Willard and his team every success and look forward to working with the Kobalt team as they continue to grow their business.&rdquo;\n\nABOUT THE ROYAL BANK OF SCOTLAND\n\nThe Royal Bank of Scotland Group (&quot;RBS Group&quot;) is one of the world's leading financial services companies. For the past four years RBS has consistently ranked in the top 10 global banks. RBS Group operates in Europe, the US and Asia Pacific serving more than 36 million customers world-wide and employing more than 140,000 people. In addition to the provision of a full range of banking services under The Royal Bank of Scotland and NatWest brands, RBS Group also includes Citizens Financial Group, Ulster Bank, Coutts Group, Direct Line and Churchill."
]