[
"DETROIT, MI -- Signaling a strategic move towards global consolidation of assets and transparent online copyright administration, Detroit-based Eight Mile Style Music, which together with Martin Affiliated LLC owns and controls 225 compositions on multi-million selling albums, including all of rap artist Eminem's first four solo albums, has orchestrated a groundbreaking administration, technology and marketing pact between Eight Mile Style, global independent online music-publisher Kobalt Music Group and Los Angeles-based licensing and administration company Music Resources. The announcement was made today by Joel Martin, principal of Eight Mile Style Music and Willard Ahdritz, CEO and Founder of Kobalt Music Group. \n\nThrough the unique publishing and marketing deal, Kobalt will become Eight Mile Style's publishing administrator for all worldwide territories outside of the U.S and Canada, and will collect, process and track royalties for the catalog on a worldwide basis. Music Resources will administer the Eight Mile Style catalog for the US and Canada, and will collaborate with Kobalt on synchronization and creative/A&amp;R services. Music Resources will utilize Kobalt's transparent, online music publishing administration technology and will exclusively debut the new &quot;Powered By Kobalt&quot; services brand. \n\nUpon making the announcement, Martin said: &quot;The music industry is changing fast, and like the trend with established major artists, copyright holders of major catalogs need to take control of their own destiny. Kobalt's transparent system has re-engineered the publishing industry, and we're confident we have crafted a unique relationship with Kobalt globally, and both Kobalt and Music Resources in the U.S., that will provide tremendous financial and creative advantages and will ensure we are completely involved in the management of our business with money not being wasted on unnecessary expenses.&quot; \n\nAccording to Martin, the business decision to utilize Kobalt and Music Resources and combine the expertise between the companies was prompted in part by the results of years of market testing and comparison of collections and reporting among several major publishers that have been handling the Eight Mile Style catalog under separate agreements. &quot;Due to the fact that Eight Mile Style co-publishes multiple writers for the same songs that were administered by different companies in the same territories, it has enabled us to accurately compare 'apples to apples.' We found compelling advantages in Kobalt's level of accuracy, royalty tracking and transparency, especially as it relates to their unique portal and the proprietary technology they have developed,&quot; said Martin. \n\nCommented Ahdritz: &quot;We are very excited to expand our already successful sub-publishing relationship with Eight Mile Style, taking it to a new global level, including the United States. This unique, new relationship with Eight Mile Style and Music Resources is another example of how Kobalt can offer customized solutions for clients and continue delivering the structures and solutions that we need for those exciting changes to the industry.&quot;\n\nThe Eight Mile Style catalog contains hit songs performed by Eminem including the Oscar-winning song &quot;Lose Yourself,&quot; and &quot;Guilty Conscience,&quot; &quot;97' Bonnie &amp; Clyde,&quot; &quot;Just Lose It,&quot; &quot;My Name Is,&quot; &quot;Shake That,&quot; &quot;Without Me,&quot; &quot;The Real Slim Shady,&quot; and &quot;Cleanin' Out My Closet&quot; among other works written by Marshall Mathers III (a.k.a Eminem) and his legendary songwriter/producer team Jeffrey Bass and Mark Bass (a.k.a. The Bass Brothers), as well as frequent collaborators, Luis Resto and Steven King. The catalog also contains numerous songs recorded by multi-platinum artists, including 50 Cent, Tupac, Dr. Dre, Jay-Z, Nas and others. In addition to the available back catalog, Eight Mile Style and Martin Affiliated will, together with Music Resources and Kobalt, administer the future works of Resto, King and The Bass Brothers, including new songs slated for Eminem's next CD release. With career sales estimated in excess of 70 million albums worldwide, Eminem is one of the best selling music artists of the decade.\n \nMusic Resources is owned by Nancie Stern, who has 25 years of music publishing, clearance and licensing expertise. For over 15 years Music Resources has specialized in the complex area of sample clearance and has worked with every major label and multi-platinum artists such as 50 Cent, Destiny's Child and the Black Eyed Peas. Music Resources is currently recognized as one of the leading clearance companies in the area of emerging technologies, including digital ringtones and streamed media, and represents the publishing catalog of academy award winning group, Three Six Mafia. Stern will continue working for music icon Quincy Jones in her position as Vice President of Quincy Jones Music Publishing.\n\n&quot;I'm tremendously excited and fortunate to not only have the opportunity to work with the incredible Eight Mile Style catalog and Kobalt, but also with Joel Martin who I deeply respect as a business mentor and person. Combining our knowledge, relationships and expertise, Music Resources Powered by Kobalt will offer a broader copyright administration platform to our clients. We are all united together in our goals toward the future of the music industry,&quot; said Stern.\n\nHaving recently debuted at No. 6 on Billboard's Second-quarter Top 10 Publisher Airplay chart and ranking No. 1 U.K. independent publisher for the second quarter results of 2007 (Music Week 18.08.07), Kobalt, now in its 7th year of operation, has more than 600 clients worldwide, processes 1.5 million copyright registrations, and employs a staff of 45 people in 6 offices. The company has experienced an average of 200% growth per year in global gross collections and synchronization revenue. In the last year, Kobalt has renewed its ex-North America deal with pop icon Gwen Stefani, as well as signed deals with Barry Manilow, Dr. Luke (producer of Avril Lavigne's global chart-topping singles and CD), German pop superstar Herbert Gr&ouml;nemeyer, classic R&amp;B writing team Full Force and up and coming UK artist Gary Go. Other clients include Max Martin, The Hives, Editors, Evergreen and Richard Ashcroft among many others. \n\nThe deals were put together by Ahdritz and Martin, and Eight Mile Style was represented by New York attorney Mark Levinsohn. Kobalt's business affairs team included Michael Petersen, Executive VP/General Counsel and General Manager U.S., and Christiaan Winchester, General Counsel/Director of Business Affairs in Kobalt's London office."
]