[
"LOS ANGELES, CA -- Leading independent music publisher Kobalt Music Group has signed an exclusive, worldwide administration deal with legendary performer, songwriter, arranger and producer Barry Manilow. \n\nThrough the deal, Kobalt will administrate future works as well as seventy-five songs in his Obbligato Music (ASCAP) catalog including &quot;Here's To Las Vegas,&quot; &quot;I Won't Be The One To Let Go&quot; from Barbra Streisand's Duets album, &quot;Wisteria Lane&quot; from the Desperate Housewives Soundtrack, original scores from Manilow's Broadway-bound musical Harmony, and other unreleased tunes.\n\nKobalt's U.S. and U.K. creative teams will work to create collaborations for Manilow, who is writing new pop material. The company's global licensing staff and agents will also aggressively promote Manilow's works for synchronization licensing for motion picture, TV, advertising and other mediums. \n\nCommented Willard Ahdritz, CEO and Founder of Kobalt Music Group: &quot;Barry Manilow is one of the greatest performers of all time who continues to thrive as a writer/producer, as well as a recording artist, sell-out touring act, and composer. We are honored and thrilled to be working with him and Stiletto, and look forward to a long, fruitful relationship.&quot; \n\nA Songwriters Hall of Fame inductee, Manilow has written hundreds of songs and sold more than 75 million records worldwide. He has performed around the globe thrilling millions of fans, winning a Grammy, two Emmys, several Tony Awards and an Oscar nomination along the way. Between 1975 and 1983, he placed 25 consecutive Top 40 hits on Billboard's Hot 100 chart including &quot;Even Now,&quot; &quot;This One's for You,&quot; &quot;Weekend in New England,&quot; &quot;I Write the Songs,&quot; and &quot;Tryin' to Get the Feeling Again.&quot; \n\nManilow is gearing up for a busy fall taking his show, Manilow: An Evening of Music and Passion on the road, playing two special arena dates at Atlantic City's Boardwalk Hall (October 14) and Chicago's Allstate Arena (October 21). On October 31, 2006, Manilow releases The Greatest Songs Of The Sixties (Arista), the 59th album of his career and much-anticipated follow-up to the double CD The Greatest Songs Of The Fifties (Arista), which debuted at No. 1 in January 2006. Featuring thirteen classics from the most exciting decade in Anglo-American pop history, The Greatest Songs Of The Sixties was produced by Manilow, Clive Davis, and David Benson with Garry C. Kief as executive producer. \n\nManilow's film credits include the Oscar-nominated &quot;Ready To Take A Chance Again&quot; (from Foul Play), a featured song in Walt Disney's Oliver and Company, and the complete soundtracks for the animated features Thumbelina and The Pebble and the Penguin. \n\nIn 2006, Barry received his fifth Emmy nomination and an Emmy win for the PBS special Manilow: Music and Passion. The broadcast celebrated Barry Manilow's 100th performance at the Las Vegas Hilton, where his Music and Passion show opened in February 2005. Produced by Stiletto Television, the Rhino DVD of the PBS special was soon certified triple platinum. \n"
]