[
"LOS ANGELES, CA -- Multimillion-selling producer, songwriter, and engineer Rhett Lawrence has signed an exclusive, worldwide administration deal with Kobalt Music Group. The deal includes all of Lawrence's stellar Rhettrhyme back catalog, as well as current and future material under his Rhettski publishing catalog. &#8232;&#8232;\n\nKobalt is also representing Lawrence's works for film, TV, advertising and other synchronization opportunities. Commented Willard Ahdritz, Kobalt CEO and Founder: &quot;Multi-talented Rhett Lawrence is a visionary who has the ability to create career-defining hits for artists. We are thrilled to be working with him and look forward to a long relationship.&quot;\n\nAdded Lawrence: &quot;Kobalt is the future. I love the Willard Ahdritz' ideas. The team he has put together is fantastic, and I'm so happy to be a part of the Kobalt family.&quot; \n\nCurrently working with Kelly Clarkson for her next CD, Lawrence conceived and co-wrote (with Clarkson) her new unreleased song, &quot;Go,&quot; which he successfully pitched directly to Ford and J. Walter Thompson agency for the auto manufacturer's new &quot;Bold Moves&quot; campaign theme. \n\n&quot;Rhett's song &quot;Go&quot; is part of an approximately two year-long advertising campaign which is being used in ongoing broadcast and digital platforms. He masterfully created and pitched the idea, plus organized all of the key players involved. Not only is Rhett a great producer and creative force, but he also has the ability to think across platforms and push through ideas that bear fruit,&quot; said Ahdritz. \n\nLawrence produced and co-wrote Clarkson's chart-topping single &quot;Miss Independent.&quot; &quot;I consider Kelly to be one the all time great singers with the perfect combo of tone, range, power, and emotion,&quot; Lawrence said. &quot;As a producer/songwriter it's pure heaven to hear that voice jump out of the speakers when we're working together.&quot; \n\nLawrence also is famous for producing and writing numerous No.1 singles including: Mariah Carey's Grammy Award-winning career-launching hit &quot;Vision of Love&quot;; Monica and Eternal's &quot;Angel of Mine&quot;; the No. 1 U.K. Eternal song &quot;I Wanna Be the Only One&quot; (featuring BeBe Winans); and the worldwide chart-topper &quot;Never Be the Same Again&quot; by Melanie C. and Lisa &quot;Left Eye&quot; Lopes. \n\nHe also produced and co-wrote Billboard's No. 2 rap single &quot;Request + Line&quot; for the Black Eyed Peas (feat. Macy Gray), which gave them their first Top 40 hit in many countries. Other artists he has collaborated with include Earth Wind and Fire, Enrique, Selena, Whitney Houston, Gladys Knight, Jessica Simpson, Paula Abdul with Ofra Haza and Kirk Franklin."
]