[
"LONDON, U.K. -- On the heels of the release of her second solo set, The Sweet Escape (Interscope), global superstar singer-songwriter and fashion icon GWEN STEFANI has renewed her ex-North America administration deal with Kobalt Music Group (Kobalt).\n\nThrough the deal, Kobalt continues to administer her publishing company, HARAJUKU LOVER MUSIC, and represent the works for synchronization for film, TV, ringtones, advertising and other mediums. Stefani's law firm, Goldring, Hertz and Lichtenstein, continues to administer Harajuku Lover Music for the U.S.\n\nThrough the relationship with Kobalt, Stefani's publishing company will continue to utilize Kobalt's global licensing staff and state-of-the-art online client account tools, which include unique royalty analysis and royalty tracking tools allowing the client to be completely involved in the process of managing their copyrights.\n\nWillard Ahdritz, Founder and CEO of Kobalt Music, acknowledges the landmark Stefani deal as having been important in the evolution of Kobalt's significant growth over the last few years.\n\n&quot;When the team around Gwen took the decision to try out Kobalt's online transparent publishing model, it was a shot heard round the industry that certainly helped spark new interest in Kobalt's system and global teams. Therefore, we're extremely proud to continue representing Gwen Stefani and Harajuku Lover Music,&quot; said Ahdritz.\n\nThe new deal includes The Sweet Escape, which debuted at No. 3 on The Billboard 200 (Billboard 23 December 2006). The new single &quot;Wind It Up&quot; also debuted Top 10 on the UK singles chart. The single is receiving play on MTVUK as well as UK radio outlets Capital, KissFM and Radio1. The Sweet Escape also features three songs co-written and produced by Tony Kanal, Stefani's No Doubt band mate and Kobalt client.\n\nKobalt will continue to administer Stefani's works from her multi-platinum smash record, Love. Angel. Music. Baby. (Interscope). Stefani co-wrote all songs on the global chart-topping CD, which spawned a host of hits, including &quot;Hollaback Girl,&quot; which spent four weeks at No. 1 on The Billboard Hot 100.\n"
]