[
"(LOS ANGELES) November 11, 2013 -- Grammy-nominated producer/songwriter and renown label/A&amp;R executive Martin Kierszenbaum has partnered with Kobalt to launch Cherrytree Music Publishing, it was announced by Kierszenbaum, Chairman of Cherrytree Records and Martin Kierszenbaum Management, and Richard Sanders, President of Kobalt.\n\nThrough the exclusive, worldwide deal, Kobalt is providing funding, administration and creative services for Kierszenbaum&rsquo;s new Cherrytree Music Publishing company.\n\nKierszenbaum said: &ldquo;I&rsquo;m excited to be starting Cherrytree Music Publishing in partnership with Kobalt, Richard and especially Benjamin Groff who&rsquo;s been a good friend and colleague for a long time. With their expert support, I&rsquo;m looking forward to extending the Cherrytree philosophy to protect and amplify our recording artists&rsquo; and management clients&rsquo; creative visions to serve songwriters with the same attention and care.&rdquo;\n\n&ldquo;Martin Kierszenbaum exemplifies the true spirit of an entrepreneur in today&rsquo;s music business.  We look forward to be partnering with him in his new venture,&rdquo; added Sanders.\n\nBenjamin Groff, Kobalt EVP Creative, added: &ldquo;Martin has one of the best track records in the music business; in signing, developing and breaking many of the biggest recording artists in the world. The Cherrytree brand is synonymous with excellence in modern music, and I have immense excitement having the opportunity to work with Martin, and for Kobalt to represent Martin&rsquo;s Cherrytree Music Publishing clients.&rdquo;\n\nAs a record and A&amp;R executive, Kierszenbaum started his Cherrytree Records imprint in 2005 through Interscope with the release of Feist&rsquo;s debut album, Let It Die. Since its inception, Cherrytree has signed and introduced to the world such cutting-edge artists as Ellie Goulding, La Roux, Far East Movement, Robyn and LMFAO as well as released the first two albums (The Fame &amp; The Fame Monster) by Lady Gaga for which Kierszenbaum wrote and produced four songs including Gaga&rsquo;s debut album title track, &ldquo;The Fame.&rdquo; He was also nominated for an Album of the Year Grammy in 2010 as a producer for The Fame. Over the last 2 years Cherrytree Records has had 4 No.1 singles on the Billboard Top 40 Radio Chart (Far East Movement&rsquo;s &ldquo;Like a G6,&rdquo; LMFAO&rsquo;s &ldquo;Party Rock Anthem,&rdquo; and &ldquo;Sexy and I Know It.&rdquo;) and Ellie Goulding&rsquo;s &ldquo;Lights.&rdquo;  Cherrytree Records released Sting&rsquo;s new album, The Last Ship, which Kierszenbaum A&amp;R&rsquo;d, on September 24, 2013. Additionally, his management clients include Grammy-award winning mixer Robert Orton, Grammy Award-winning producer/writer Jeff Bhasker, producer/writer Mike Einziger, producer/writer Fernando Garibay, producers/writers B3taBlocker, and recording artists Natalia Kills, La&rsquo;Reda and Max and The Moon, as well as video directors Talk-BoyTV (Colette Carr). Kierszenbaum also releases his own music and remixes under the name Cherry Cherry Boom Boom. His original composition/recording &ldquo;One and Only&rdquo; hit no. 13 on the Billboard Dance/Club chart earlier this year and he&rsquo;s recently produced remixes for Imagine Dragons, RAC and Krewella.\n                                                        \n\nCONTACT: Rebekah Alperin, Kobalt SVP Communications &amp; Marketing &ndash; Worldwide\nTel/Text: +1.310.770.1045  e-Mail:  rebekah.alperin@kobaltmusic.com\n\n"
]