[
"LOS ANGELES, CA -- Kobalt Music Group has signed an administration deal for the world excluding Australia and New Zealand with prolific hit making pop songwriter Shelly Peiken. As part of the deal, Kobalt will also represent Peiken for synchronization including films, TV, advertising, ringtones, and other media.\n\nWillard Ahdritz, CEO and Founder of Kobalt commented: &quot;We're very pleased to welcome Shelly Peiken to our growing Kobalt roster of celebrated songwriters. She'll be working closely with our Los Angeles senior creative executive, Benjamin Groff, and our international creative and synch team to generate new songwriting collaborations and other opportunities in the U.S. and around the world.&quot;\n\n&quot;I'm honored to be a part of the Kobalt family, said Peiken, &quot;It's refreshing to see a company that specializes in administration have so much creative passion as well. In an ever changing music business Kobalt has the desire not only to make a difference but to be the difference.&quot; \n\nPeiken received a Grammy-nomination for &quot;Bitch&quot; recorded by Meredith Brooks, and has two No.1 Christina Aguilera songs to her credit including &quot;What a Girl Wants&quot; and &quot;Come On Over Baby&quot; among hundreds of others. \nShe also penned &quot;Almost Doesn't Count&quot; for Brandy, &quot;Human&quot; by The Pretenders, &quot;I Wanna Be With You&quot; for Mandy Moore and &quot;Stumble&quot; by Natasha Bedingfield. Additionally, platinum artists Michelle Branch, Aaliyah, Keith Urban, Celine Dion (3 songs), Cher, 'NSYNC, Backstreet Boys, Reba McEntire, Ashlee Simpson, Less Than Jake, Plain White T's, and Stroke 9 have all recorded Peiken's songs. Peiken's current and forthcoming release include projects by Ashley Tisdale, The Bratz and Miley Cyrus.\n\nPeiken's signature songs have appeared in feature films including: Music of the Heart, Center Stage, What Women Want, Saving Grace, The Good Girl, Dear God, Blue Streak, Bring It On, I Still Know What You Did Last Summer, Edtv, The Next Best Thing, The Princess Diaries, See Spot Run, A Walk To Remember, What A Girl Wants, The Lizzie McGuire Movie, Confessions Of A Teenage Drama Queen and Raising Helen.\n"
]