[
"LOS ANGELES, CA -- Kobalt has signed a worldwide administration deal with emerging superstar Ryan &quot;Alias&quot; Tedder, co-writer/producer for multiple No.1s, including Leona Lewis' No.1 U.K. hit, &quot;Bleeding Love,&quot; which is on Lewis' fastest-selling U.K. debut album. Ryan Tedder also co-wrote Leona Lewis' second single, &quot;Take A Bow.&quot; The deal with Kobalt includes Tedder's new works, excluding songs performed by the band One Republic, of which he is the lead singer. Kobalt will represent Tedder for synchronization of music in advertising, TV, film, ringtones and other media.\n\nUpon making the announcement, Willard Ahdritz, CEO and Founder of Kobalt, said,&quot;Ryan Tedder is an emerging superstar producer, songwriter and artist, and we're thrilled to sign him to Kobalt. Our global creative staff, including Kobalt Executive Vice President of Creative Sas Metcalfe and Sr. VP of Creative Benjamin Groff, whom were important in bringing in this deal, look forward to working with him.&quot; \n\nTedder said, &quot;I'm extremely excited about my new partnership with Kobalt. They are a very forward-thinking company representing the evolution of where I think music publishing is headed. I love their transparency and their constant commitment to raising the bar on how they service their writers and producers. I'm looking forward to making some great music with them. They get what I'm about and have made the decision easy.&quot;\n\nTedder wrote Natasha Bedingfield's single, &quot;Love Like This (feat. Sean Kingston),&quot; recent collaborations for Jennifer Lopez, including her current single &quot;Do It Well,&quot; as well as One Republic's smash debut single, &quot;Apologize (feat. Timbaland),&quot; which reached No. 2 on the Billboard Hot 100 and No. 1 on Billboard Hot Digital Songs chart. \n\nOther collaborations co-written by Tedder include songs for Timbaland, Hilary Duff, Ashley Tisdale (the hit &quot;He Said She Said&quot;), Esmee Denters, Chris Cornell, Paula DeAnda, Menudo, Varsity, Lemar, Frankie J., Youngbloodz, Baby Bash, Lil' Jon, Howie Day, Bubba Sparxxx, Steph Jones, Shayne Ward (X-Factor winner), T. A.T. U. and Fivestar. He has also co-written and produced the majority of the project for American Idol runner-up Blake Lewis. \n\nTedder's songs have been featured on major motion picture soundtracks for movies such as Step Up (Disney/Touchstone), Aquamarine (Fox), Without a Paddle (Paramount) and the end title for Cheaper by the Dozen 2 (Fox). He was also acknowledged in 2007 for his writing collaboration and guest performance on Paul Oakenfold's Grammy-nominated album, A Lively Mind."
]