[
"BERLIN, GERMANY -- Global independent online music publisher Kobalt Music Group has concluded an exclusive deal with multi-million selling German pop superstar, Herbert Gr&ouml;nemeyer, to administer his entire Gr&ouml;nland Musikverlag catalogue, it was announced today by Willard Ahdritz, Founder and CEO of Kobalt. \n\nThrough the deal Kobalt will administer the catalog for the world excluding the territories of Switzerland, Austria and Benelux. It is the first time Gr&ouml;nemeyer has signed a global administration deal including the territory of Germany that consolidates all of his works. Containing over 25 years of chart hits and multiple No. 1 hits, the Gr&ouml;nland Musikverlag catalogue features the songs &quot;Bochum&quot;, &quot;M&auml;nner&quot;, &quot;Mensch&quot;, Was Soll Das&quot;, &quot;Halt Mich&quot;, &quot;Alkohol&quot;, &quot;Flugzeuge Im Bauch&quot;, &quot;Land Unter&quot;, and &quot;Der Weg&quot;. Gr&ouml;nemeyer has sold in excess of 20 million records in his career. \n\nCommented Ahdritz: &quot;We're honored and excited to be working with Herbert Gr&ouml;nemeyer, who has been a leading influence in German pop music culture for more than 20 years and one of the most prolific songwriter, recording artist and performers. This global deal represents a major achievement for Kobalt especially in our expanding German operation led by Matthias Kind, our General Manager in Germany. We look forward to a long and successful relationship.&quot;\n\nEdition Polarbear, the publishing arm of Gr&ouml;nemeyer's London-based record label, Gr&ouml;nland, is also being administered by Kobalt. Edition Polarbear's catalog includes the FIFA World Cup song, &quot;Zeit Dass Sich Was Dreht/Celebrate The Day.&quot; \n\nGr&ouml;nemeyer's new multi-platinum studio album, 12, was released on March 2 and entered the charts at No. 1 in Germany, Switzerland and Austria. The first single &quot;Lied 1 - Stueck Vom Himmel,&quot; also debuted at No. 1 in Germany.\n\nSince his emergence in the Eighties, Gr&ouml;nemeyer has had nine albums reached No.1 in Germany. His multi-million selling 2003 release, Mensch, has sold over three million albums in Germany and is the best selling album of any German recording artist. \n\nIn addition to Germany, Gr&ouml;nemeyer's music has been released in the U.S. Switzerland, Benelux, Canada, England, Scandinavia, France, Spain, Australia, Greece, Poland, Czech Republic and Brazil. His breakthrough release, Bochum, a mainstay on the German charts for over a year and a half, is considered a treasure of Eighties German rock music twenty years after its debut.\n\nConcurrent with his early musical career, in 1981 Herbert Gr&ouml;nemeyer, who began performing in his teen years as a stage actor and a musical director, became famous worldwide as the war correspondent Lieutenant Werner in Wolfgang Petersen's movie Das Boot. The film was Germany's highest box office export and was nominated for six Academy Awards. \n\nThe recipient of six Echo Awards, Germany's top music honor, a 2003 World Music Award, and two Viva Comet Awards, Gr&ouml;nemeyer was acknowledged in 2005 as a &quot;European Hero&quot; by the editors of Time Magazine for his work in the fight against poverty and social injustice. A multidisciplinary artist, he has composed for the theater, creating music for Robert Wilson's production of Georg Buchner's Leonce und Lena, and a roster of films including Sommer in Lesmona, with a Grimme Award-winning score. His interest in new music and promoting of new artists led to the founding of the Gr&ouml;nland label. A compelling live artist whose performances have been captured by MTV &quot;Unplugged&quot; performances and a top selling DVD, Mensch Live, that chronicled a concert tour viewed by 1.5 million fans, he will also embark on a stadium tour in May, 2007."
]