[
"LONDON, UK -- In a unique move for a major songwriter and for the music publishing industry, veteran hit-making songwriter/producer Desmond Child has joined Kobalt Music Group as its Ambassador to the songwriter and producer community, in addition to signing an exclusive worldwide administration deal with the company. The announcement was made today by Mr. Child and Willard Ahdritz, Founder and CEO of Kobalt Music Group. \n\nThe administration deal covers future works for Child and his music publishing company, Deston Songs. For more than three decades, he has penned some of the world's best known popular songs for such major artists as Kiss (I Was Made for Loving You), Bon Jovi (You Give Love a Bad Name, Livin' on a Prayer, and Bad Medicine), Aerosmith (Dude Looks Like a Lady, Angel, What It Takes, and Crazy), Ricky Martin (Livin' La Vida Loca, the 1998 World Cup Theme The Cup of Life, She Bangs, and Nobody Wants to Be Lonely, the latter a duet with Christina Aguilera), Michael Bolton (How Can We Be Lovers), Cher (Just Like Jesse James), Alice Cooper (Poison), and Joan Jett (I Hate Myself for Loving You) among many others. In his thirty-five year career, Child has had 68 Top 40 singles while generating sales of more than 300-million-plus albums worldwide.\n\nAs part of his role as a Kobalt ambassador and spokesman, Child will join the company's senior management team in public appearances and will be featured on the cover of the Kobalt's winter industry newsletter. In addition to administration services, Kobalt will also represent Child for synchronization deals to include film, TV, advertising and other mediums. \n\nCommented Willard Ahdritz: &quot;We are thrilled and honored to have Desmond signing to Kobalt as well as representing our company. Desmond's talent and creativity, artistic integrity and stature in the industry speak for itself. He has shown so much interest in Kobalt and has been out on his own speaking to so many people about us. The new role of being Ambassador and a spokesman evolved naturally from his genuine enthusiasm. Therefore we have created this new role for him in an official capacity.&quot; \n\nMr. Child is currently producing Meat Loaf's &quot;Bat Out Of Hell III,&quot; is the executive producer of Bon Jovi's current smash album &quot;Have A Nice Day,&quot; and has also been collaborating with Hoobastank, Rooney and The Donnas. In 2005, Child was the producer of three out of Billboard's four top-selling singles for the year, winning the top No. 1 position with Carrie Underwood's Inside Your Heaven. Child remains as in-demand as ever. His latest clients include Motley Crue, Joss Stone, Bo Bice, Kelly Clarkson, Clay Aiken, Jesse McCartney and Hilary Duff.\n\nABOUT DESMOND CHILD\n\nDesmond Child has spent more than two decades as one of the music industry's most successful creative forces. His singular achievements as a songwriter, producer and music publisher make Child one of the most consistently inventive and successful hitmakers in pop history. Born in Gainesville, Florida, Child was influenced at a young age by his songwriter mother, Cuban composer Elena Casals. As a teenager in Miami, he became friends with Jerry Wexler's daughter, Lisa. Through Wexler, he was turned onto his inspiration - Laura Nyro, and crossed paths with the pillars of Atlantic Records - Ahmet Ertegun, Jerry Wexler, Arif Mardin and the brilliant producer/engineer Tom Dowd.\n\nIn 1973, Child formed Desmond Child and Rouge and signed with Capitol Records, which released two of his albums. Desmond's songs caught the ear of KISS frontman Paul Stanley, who asked him to co-write a track for the band's 1979 &quot;Dynasty&quot; album. The result was I Was Made for Loving You, one of the biggest hits of KISS' career. Stanley gave Child's phone number to up and coming New Jersey rockers Jon Bon Jovi and Richie Sambora. The three wrote what would become Bon Jovi's first number-one single You Give Love a Bad Name. They went on to create together two more chart-toppers: Livin' on a Prayer from the band's breakthrough &quot;Slippery When Wet&quot; album and Bad Medicine from the follow-up album &quot;New Jersey.&quot;\n\nChild soon duplicated the feat with Aerosmith, collaborating on Dude Looks Like a Lady and Angel (from the band's 1987 comeback album, &quot;Permanent Vacation&quot;) as well as, What It Takes (&quot;Pump&quot; 1989) and the Grammy-winning song Crazy (&quot;Get a Grip&quot; 1993). During the same period, along with co-writing Joan Jett's I Hate Myself for Loving You and Alice Cooper's Poison, he began branching out from his rock base, collaborating with Michael Bolton and Diane Warren on How Can We Be Lovers and co-writing (again with Warren) and producing Just Like Jesse James for Cher. Child also found time to record the solo album &quot;Discipline&quot; (Elektra, 1991), which contained his own Top 40 hit Love on a Rooftop. \n\nIn the late '90s, Child reached back to his Latin heritage via his collaboration with Ricky Martin which resulted in the number-one worldwide smashes Livin' La Vida Loca and the theme for the 1998 World Cup, The Cup of Life (which he co-wrote and co-produced). Livin' La Vida Loca received Grammy nominations for Song of the Year, Record of the Year and Best Pop Album, and has enjoyed a second life as the end-title of Shrek 2. Martin's second English-language album, &quot;Sound Loaded&quot; (1999), contained seven Child co-writes, including the hits She Bangs and Nobody Wants to Be Lonely, the latter a duet with Christina Aguilera. During that time Child also wrote and produced the hit single Kiss the Rain for Billie Myers, and Weird for Hanson's 10 million selling debut album, &quot;Middle of Nowhere.&quot; \n\nIn January of 2000, Child, along with Winston Simon&Atilde;&copy; and David Simon&Atilde;&copy;, formed Deston Songs. While still in its infancy, the publishing company started notching up hits, including the Baha Men's Who Let the Dogs Out and the above-mentioned Nobody Wants to Be Lonely. Since those auspicious beginnings, Deston Songs has gone on to score smashes with artists as varied as 50 Cent, Celine Dion, LeAnn Rimes, Clay Aiken (whose recording of This Is the Night was the biggest single of 2003) and Diana DeGarmo (whose Dreams was the second biggest single of 2004)."
]