[
"LONDON, U.K. -- Kobalt Music Group (Kobalt), music publisher and online publishing administrator, has been signed up by FIFA (the F&eacute;d&eacute;ration Internationale de Football Association) to be the exclusive worldwide licensor and administrator for the Official Melody of the 2006 FIFA World Cup(TM).\n\nWritten by Nadir Khayat aka Red One and Bilal Hajji, the 30-second melody, a sample from the Red One song &quot;Bamboo&quot;, will also be incorporated into several other songs, including the Official Single of the 2006 FIFA World Cup(TM) and other pieces of music to be used extensively throughout the championships including Shakira feat. Wyclef Jean &quot;Hips Don't Lie - Bamboo (2006 FIFA World Cup(TM) mix)&quot;. In addition dance, hip-hop, house and &quot;Bamboo&quot; mixes will also be sold as ringtones. \n\nWillard Ahdritz, founder and Chief Executive of Kobalt, commented: &quot;Kobalt is exploiting the content on a global basis through digital distribution partners on five continents. With an audience of more than a billion people and extensive promotion, the potential exposure and consumer base for the Official Melody is extraordinary. We are thrilled to be the administrator for FIFA to market, license and collect for both the publishing and master rights in what could be the biggest digital event ever.&quot;\n\nAs the world's largest sporting event, the 2006 FIFA World Cup(TM) kicks off June 9, 2006 in Germany. The Official Melody of the 2006 FIFA World Cup(TM) will receive extensive exposure during all FIFA World Cup(TM) events, including cross-promotion and in sponsor advertising spots from such advertisers as Adidas, Avaya, Budweiser, Coke, Continental, Deutsch Telekom, Emirates, Fujifilm, Gillette, Hyundai, Mastercard, McDonalds, Phillips, Toshiba and Yahoo. Through the deal, Kobalt is working with FIFA's concept developer Engine AB an MTG company, which is FIFA's exclusive agent for the creation and supervision of the overall music program for the 2006 FIFA World Cup(TM)."
]