[
"LONDON, U.K. -- Billy Steinberg- the legendary songwriter of massive pop hits (with co-writer Tom Kelly) such as &quot;Like a Virgin&quot; (Madonna), &quot;True Colors&quot; (Cyndi Lauper) &quot;Eternal Flame&quot; (The Bangles), &quot;I Drove All Night&quot; (Cyndi Lauper, Roy Orbison, Celine Dion), &quot;I'll Stand By You&quot; (The Pretenders), &quot;Alone&quot; (Heart), &quot;I Touch Myself&quot; (Divinyls) and &quot;So Emotional&quot; (Whitney Houston)- has signed an exclusive administration deal for the world ex-North America and Canada for his music publishing company, Jerk Awake.\n\nAs part of the deal, Steinberg will work closely with Kobalt's U.S. creative team.\nCommented Willard Ahdritz, CEO and Founder of Kobalt: &quot;We are thrilled that Billy has chosen Kobalt's unique tools and services as his publishing administration service of choice. Billy Steinberg is such a prolific and versatile songwriter whose songs have sold millions of singles throughout the world. He continues to be in demand by pop stars and upcoming bands.&quot; \n\nSteinberg has also written hits with Rick Nowels including &quot;Falling Into You&quot; (Celine Dion), &quot;I Turn To You&quot; (Mel C.), &quot;Sexual&quot; (Amber) and &quot;One And One&quot; (Robert Miles). Steinberg, whose songs have sold millions of singles worldwide, has also written songs for Linda Ronstadt, Pat Benatar, k.d. Lang, The Corrs, Kylie Minogue, Tina Turner, Cher, Bette Midler, Ace of Base, Enrique Iglesias and Belinda Carlisle. \n\nSteinberg has songs on upcoming records by Jojo (Blackground/Universal), Fefe Dobson (Island/Def Jam), JC Chasez (Jive), Katy Perry (Columbia) and Paris Hilton (Warner Bros.). His song &quot;When It All Falls Apart,&quot; recorded by The Veronicas, is currently a hit in Australia and is soon to be released in the U.S. He's also recently been in the studio with: L.P. (Island/Def Jam), Lucy Walsh (Island/Def Jam; daughter of Joe Walsh), and Jack (The Family). &#8232;&#8232;\n\nSteinberg has been co-writing and co-producing with 23-year-old talent Josh Alexander. They co-wrote &quot;All About Us&quot; for T.A.T.U., which a recent an international hit. Says Steinberg, &quot;Josh is extraordinary and such a great melody writer, keyboardist, guitarist and producer. Everything we write gets considered as a single!&quot; "
]