[
"Four-time CMA Female Vocalist of the Year Martina McBride, both a Kobalt label services and music publishing client, is already regarded as one of the country music's finest singers. Her new album, Everlasting, out April 8, 2014 and produced by the illustrious Don Was, is destined to further that claim as McBride tackles some of the most revered hits in the pantheon of American music by some of the greatest performers of all time.\n \nThe 14-time Grammy Nominee brings her extraordinary voice and impeccable music styling to songs with tremendously established prestige, as the majority of the original versions of her chosen tracks were top ten hits in their own time, and many charted at number one. Who better to take on such a daunting challenge than a seasoned chart veteran with 20 top ten hits and six number one smashes of her own? Perfect-pitched McBride stands poised to deepen the lore of these legendary songs. \n\nWhile plenty of musicians have made albums of treasured classics, McBride possesses the emotion and interpretive skills to cover an eclectic range that few could muster -- from Elvis to The Supremes to Van Morrison, spanning from 1955 to 2010. Best known for her country successes, she flexes her R&amp;B and soul muscles too with favorites that include a sublime &quot;Do Right Woman, Do Right Man&quot; made famous by Aretha Franklin, a heart-wrenching &quot;If You Don&sup1;t Know Me By Now&quot; from Harold Melvin &amp; The Blue Notes, and the Jimmy Ruffin hit &quot;What Becomes Of The Brokenhearted.&quot;\n \n&quot;Martina is a singer's singer. She brings a richness, soul and vulnerability to these songs that no one else could,&quot; says Was. &quot;It's also testimony to both Martina's vocal prowess and her strong vision as an artist that she is able to step into these well-worn, classic songs and completely make them her own...she has an approach and a point-of-view that are unmistakable.&quot;\n\n&quot;These songs have beautiful melodies and emotional lyrics, which is basically all you can ask for as a singer. While this is a bit of a departure for me song-wise, stylistically I approached these songs the way I always have which is singing with as much soul and emotion as I possibly can,&quot; adds McBride. &quot;I think my fans will love this record because they are some of the best songs of all time done in a very classic style. I'm so excited for them to hear it and to take this record, complete with a horn section, on the road in the spring.&quot;\n\nRecorded in Nashville at Blackbird and released on her own label through Kobalt Label Services, Everlasting is the second album of covers from the singer whose 20-year career has earned 18 million album sales -- she put her imprint on classic country songs for 2005's Timeless, which went platinum, hit number one on the country charts and number three on The Billboard 200, and was her fastest-selling record ever. \n\nEverlasting also features a collaboration with Gavin DeGraw on &quot;Bring It On Home To Me,&quot; originally performed by Sam Cooke. \n\nMcBride will spend 2014 busy as ever: she&sup1;ll participate in an all-star tribute to Gregg Allman in Atlanta in January, joins CMA Entertainer of the Year George Strait in spring for his last tour, and will continue her generous charity work as the spokesperson for National Domestic Violence Hotline and the National Network to End Domestic Violence, as well as through her Team Martina global volunteer organization of country music fans. \n\nStay tuned as Martina reveals the track listing for Everlasting in the coming weeks.\n"
]