[
"(January 8, 2014) --  Kobalt Music Copyrights SARL (KMC), an entity advised by Kobalt Capital Ltd., has acquired the worldwide publishing rights to the major song catalogue of Grammy Award-winning hitmaker Steve Winwood, it was announced today by Willard Ahdritz, Founder and CEO of Kobalt Music Group (Kobalt), and Johan Ahlstr&ouml;m, CEO of Kobalt Capital Ltd. (KCL).\n\nKMC has acquired ownership of Winwood&rsquo;s entire back catalog of 177 songs, from his early career with Spencer Davis Group, Traffic and Blind Faith through his extensive solo recordings to the present day.\n\nAs lead singer of The Spencer Davis Group, one of the most explosive bands in the British Invasion era, Winwood wrote numerous late-&lsquo;60s pop classics including &quot;Gimme Some Lovin'&quot; and &quot;I'm a Man. Hits featured in his solo catalog of the 70&rsquo;s, 80&rsquo;s and 90&rsquo;s  include &ldquo;Higher Love&rdquo; (#1 Billboard), &ldquo;Don&rsquo;t You Know What The Night Can Do&rdquo; (#1 Billboard),  &ldquo;Roll With It&rdquo; (#1 Billboard), &ldquo;Holding On&rdquo; (#1 Billboard), &ldquo;Back In The High Life Again&rdquo; (#1 Billboard), &ldquo;While You See A Chance&rdquo; (#2 Billboard), &ldquo;One and Only Man&rdquo; (#1 Billboard),  &ldquo;Talking Back To The Night&rdquo; and &ldquo;Valerie&rdquo; among many others.  The catalogue contains the Top 10 albums Roll With It (#1 The Billboard 200), Back In The Highlife (#7 The Billboard 200), Arc Of A Diver (#3 The Billboard 200), as well as chart-topping releases Revolutions - The Very Best Of Steve Winwood, Nine Lives, About Time, Junction Seven, Refugees Of The Heart, Chronicles, Talking Back To The Night, Steve, Go and Winwood. Winwood also penned such classics as &ldquo;Low Spark of High Heeled Boys&rdquo; and &ldquo;Rainmaker&rdquo; from the 1971 Top 10 Traffic album of the same name, as well as early hits, &ldquo;Dear Mr. Fantasy,&rdquo; and &ldquo;Heaven Is In Your Mind&rdquo; from the 1967 Traffic album Dear Mr. Fantasy, which went Top 10 in the U.S.  Winwood also wrote Blind Faith hits such as &ldquo;Can&rsquo;t Find My Way Home&rdquo; and &ldquo;Had to Cry Today&rdquo; from their self-titled 1969 No.1 (The Billboard 200) album.\n\nThrough the deal, KMC has acquired both the publisher&rsquo;s share of the copyrights, as well as the writer&rsquo;s share (excluding public performance royalties). As the official services partner for KMC, Kobalt Music Group will provide numerous services to manage and promote the rights. Kobalt&rsquo;s publishing division will administer the worldwide publishing rights and provide creative synch and licensing services. Additionally, Kobalt&rsquo;s label services division has acquired the exclusive right to license various masters controlled by Winwood, which include re-recordings of his hits, for synchronization uses.\n\n&ldquo;Steve Winwood has remained a major figure in rock &lsquo;n&rsquo; roll, a respected artist and writer who has helped to create some of pop music&rsquo;s most celebrated songs. We&rsquo;re extremely proud that Steve has chosen Kobalt to be the caretakers of his works. His great music is timeless and will remain relevant and popular for years to come,&rdquo; said Ahdritz.\n\nAlong with Ahdritz and Ahlstr&ouml;m, other executives involved in the deal include: Merril Wasserman, Kobalt EVP Business Development; Christiaan Winchester, Kobalt Group General Counsel; Jim Arnay, Kobalt SVP Business Affairs &amp; US General Counsel; Charles Sussman, Business Manager for Mr. Winwood; T.D. Ruth, U.S. attorney for Mr. Winwood; and Andrew Thompson of Lee &amp; Thompson, U.K. attorney for Mr. Winwood.\n \n                                                         # # #\n\n"
]