[
"THE CRYSTAL METHOD have kicked off 2014 by offering an advance listen of their fifth studio album, titled The Crystal Method, via Hype Machine. Marking the iconic act&rsquo;s 20th Anniversary, the album is set for release January 14 and is available to hear at Pandora.\n\nOn The Crystal Method, THE CRYSTAL METHOD&rsquo;s KEN JORDAN and SCOTT KIRKLAND explore various directions of electronic music.  &ldquo;While there&rsquo;s plenty of hissing beats, belching production and squealing-brakes  keyboards for modern EDM heads to enjoy,&rdquo; wrote Annie Zaleski of Alternative Press (Feb) in her review, &ldquo;&hellip;the album is steeped in meticulous club music emphasizing silky grooves and sculptured adrenaline rushes.&rdquo; Guests include LeAnn Rimes, Franky Perez (Scars On Broadway), Nick Thayer and mau5trap artist Le Castle Vania. &ldquo;The Voice&rdquo;&rsquo;s season #2 contestant Dia Frampton (also known  as one half of indie duo Meg &amp; Dia) is the featured vocalist on the album&rsquo;s first single &ldquo;Over It&rdquo; impacting radio this month.\n\nView the video for &ldquo;Over It&rdquo; featuring Dia Frampton here:\nhttp://www.youtube.com/watch?v=S9MpeKm-imE\n\nLook for THE CRYSTAL METHOD to appear on Los Angeles tastemaker radio program KCRW &ldquo;Moring Becomes Eclectic&rdquo; on Tuesday, January 14. Meanwhile, the pair are gearing up for a major performance at the El Rey Theatre in Los Angeles with a full live band (a first for the platinum-selling EDM duo) on January 16.\n\nAlso this month, they have DJ dates lined up in Denver January 18 and New York City January 23 alongside a live set on SIRIUS XM&rsquo;s Electric Area Electric Aquarium.  A full tour for the spring will be announced soon.\n\nPre-order THE CRYSTAL METHOD&rsquo;s The Crystal Method now through January 14 at:\nhttps://itunes.apple.com/us/album/the-crystal-method/id764089466\n\nTHE CRYSTAL METHOD&rsquo;s tour routing is as follows:\n\nDATE        CITY            VENUE\nThurs 1/16    Los Angeles        El Rey Theatre (LIVE)\nSat 1/18    Denver            Beta\nThur 1/23    New York City        Cielo\n\nwww.thecrystalmethod.com\nwww.facebook.com/thecrystalmethod\nwww.twitter.com/crystalmethod\nwww.soundcloud.com/the-crystal-method\nwww.youtube.com/thecrystalmethod\n\nPress Releases &amp; Assets:\nwww.msopr.com/n/client-roster/the-crystal-method/\n\n# # #\n"
]