[
"(February 3, 2014) -- Kobalt Music Group (Kobalt) has concluded a major new deal to administer the entire catalogue of jazz legend Miles Davis. Through the agreement struck with Miles Davis Properties LLC, the company formed by the Davis family estate, Kobalt has taken over worldwide administration of the Miles Davis catalog with immediate effect. As part of the deal, Kobalt&rsquo;s global synch licensing and creative teams will represent the works to develop new creative opportunities as well as to exploit his works for use in motion pictures, TV, advertising and other media.\n\nUpon making the announcement, Willard Ahdritz, Founder and CEO of Kobalt Music Group, said: &ldquo;Miles Davis is THE symbol of creativity and cool. He took jazz further than anyone thought it could go, inspiring and influencing listeners and musicians for six decades. As a jazz enthusiast and sax player myself, listening to his music has been a major part of my life. So it&rsquo;s especially meaningful to me and an honor for everyone at Kobalt to be working with the Miles Davis Estate and their great team including Erin Davis, Cheryl Davis, Vince Wilburn, Jr. and Darryl Porter.&quot;\n\nThe Miles Davis family commented: &quot;It's our great pleasure to be working with a forward thinking publisher who puts the artists' needs at the forefront. We are looking forward to bringing the catalog of Miles Davis to future generations with the help of Willard, Merril and the staff at Kobalt!&quot;\n\nAdded Vince Wilburn, Jr. (nephew of Miles Davis): &quot;Willard being a musician, a saxophonist to be exact, says it all. He loves music. We love Willard, Merril and the Kobalt Family.&quot;\n\nMiles Davis is widely regarded as one of the most innovative and influential musicians of the 20th Century. His publishing catalogue includes one hundred songs that appeared on such legendary albums as Kind of Blue (Legacy/Columbia), the all time best-selling record in jazz, Bitches Brew(Legacy/Sony Music Distribution), Birth of the Cool (Blue Note), and &rsquo;Round About Midnight(Legacy/Columbia/Legacy) among many others.\n\nMost recently, a box set was released entitled The Original Mono Recordings, a nine-CD set of Davis&rsquo; early Columbia albums. Miles At The Fillmore-- Miles Davis 1970: The Bootleg Series Vol.3 is due for release on March 25. In recent years, a full-scale release campaign has also included two special Columbia/Legacy releases of Bitches Brew, the album which propelled him to be the first jazzman to ever appear on the cover ofRolling Stone. Columbia has also issued a limited edition box set, The Genius of Miles Davis, and Kind of Blue in two separate vinyl LP configurations. Kind of Blue, which many consider to be one of the greatest recordings in jazz, has gone four times platinum in the U.S.\n\nAs the greatest album of jazz, Kind Of Blue was honored on its 50th Anniversary with a Congressional Resolution (H. Con. Res 894), reaffirming the work as a national treasure. In 2006, Miles Davis was inducted into the Rock And Roll Hall of Fame. This year, New York City's 77th Street on the upper west side of Manhattan will be renamed &quot;Miles Davis Way.&quot; Award-winning actor and director Don Cheadle is also currently working on a biopic based on Miles Davis&rsquo; life tentatively entitled &ldquo;Miles Runs the Voodoo Down.&rdquo; With Cheadle directing and playing the leading role of the jazz legend, the film is currently in pre-production stages and also stars Ewan McGregor and Zoe Saldana.\n\nExecutives involved in the deal include: Willard Ahdritz, Kobalt Founder and CEO; Merril Wasserman- Serling, Kobalt EVP of Business Development; attorney Jeff Biederman; and Darryl Porter, Executor of the Miles Davis Estate.\n\nAbout Kobalt Music Group Ltd. (Kobalt)\n\nAs the leading global independent music services company, Kobalt administers more than 300,000 copyrights worldwide on behalf of over 1,500 content holders, including the world's top songwriters, artists and other music publishers. Kobalt counts among its clients Paul McCartney and MPL Communications, Disney Music Group, Max Martin, Dr. Luke, Dave Grohl, Lady Antebellum, Stevie Nicks, No Doubt, Ryan Tedder, Noah Shebib, Thom Yorke, Bj&ouml;rk, The Hives, The Lumineers, Richard Ashcroft, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Dave Stewart, Joss Stone, among many others. Kobalt&rsquo;s proprietary copyrights administration platform and direct collection infrastructure has been proven to collect royalties up to two years faster with up to 25% more income over traditional models. In 2013, Kobalt Music Group was honoured as the first ASCAP Publishing Administrator of the Year and by receiving Independent Publisher of the Year at the Music Week Awards (UK) for the fifth consecutive year. For more information,visitwww.kobaltmusic.com.\n\n\nContact:\n\nRebekah Alperin, Sr. VP of Communications and Marketing - Worldwide\nrebekah.alperin@kobaltmusic.com\n"
]