[
"NEW YORK, LOS ANGELES and LONDON, 10 March 2014: Kobalt Music Group, the leading independent music publisher and music services company, today announced that an affiliate of MSD Capital, L.P., the private investment firm for Michael S. Dell and his family, has made a significant growth capital investment in the business.\n\nKobalt has built the most trusted brand in music among artists by introducing a unique service model and full transparency to its clients.  Kobalt&rsquo;s proprietary technology and global digital platform enable its clients, who include many of the world&rsquo;s best-known songwriters, to collect their royalties more efficiently.  Kobalt&rsquo;s clients enjoy a significant uplift in lifetime earnings, receiving more money, much faster, from the songs they have created and recorded.\n\nMSD Capital&rsquo;s commitment consists of a primary investment and also the acquisition of a stake from SPARK Ventures plc, a founding investor in Kobalt.  A representative of MSD Capital will join Kobalt&rsquo;s Board of Directors.  Balderton Capital, the leading technology venture capital investor, has also increased its holding.\n\nWillard Ahdritz, Kobalt&rsquo;s Founder and CEO, said: &ldquo;We are delighted to welcome MSD Capital as an investor.  The backing of such a highly-respected investment firm is a statement of confidence in the strength of our business model and our growth strategy.  We continue to invest in the future of the music industry, and MSD Capital&rsquo;s investment will assist Kobalt to continue its rapid growth.&rdquo;\n\nIn its most recent financial year, Kobalt&rsquo;s revenue grew by nearly 40%, with an outstanding client retention rate of over 98%.  The performance demonstrates that Kobalt&rsquo;s clients &ndash; who include Paul McCartney, Max Martin, Dr. Luke, Dave Grohl, Maroon 5 &ndash; embrace the platform. In 2013, Kobalt represented writers on 25% of the top 10 singles in the US, and 40% of the top US albums.  In the UK, Kobalt administered royalties for 28% of the top 10 singles, and 38% of the top albums.\n\nGlenn Fuhrman and John Phelan, Managing Partners of MSD Capital, said: &ldquo;We are thrilled to be partnering with Willard and the rest of Kobalt&rsquo;s world-class management team, as well as with Kobalt&rsquo;s existing investors.  Kobalt is addressing an enormous market opportunity.  Due to the digital revolution and the growth of online video and music streaming, the music industry is becoming increasingly complex.  Today, a single hit song can have 500,000 separate income streams.  Kobalt&rsquo;s technology platform was built for this exciting new world.  We look forward to supporting Kobalt as it expands its service offerings and continues its impressive performance.&rdquo;\n\nMichael S. Dell, Chairman and CEO of Dell Inc., added: &ldquo;Kobalt is a music company backed by and built on innovative technology, and I am excited about MSD Capital&rsquo;s investment in the company.  In addition, I am pleased  to be able to support the company through Dell Inc. as a strategic technology services partner.  As the music industry moves to the forefront of demonstrating the transformative power of information technology, Dell Inc. is the preferred partner supporting the growth and success of its leading companies.&rdquo;\n\nAbout Kobalt\n\nKobalt Music Group (Kobalt), is the leading global, independent music services company, offering music publishing, label services and neighbouring rights services worldwide.  Kobalt provides its clients with unparalleled transparency, online copyright administration and royalty tracking (including a real-time online portal), creative and synch/licensing services, weekly online balances, digital collections and advances to writers, publishers, performers and other rights holders.  With 200 employees in offices in London, New York, Los Angeles, Nashville, Atlanta, Berlin, Sydney and Stockholm as well as agents in over 20 major territories, Kobalt administers more than 300,000 copyrights on behalf of content holders, including the world&rsquo;s top songwriters, artists and other music publishers.  Kobalt counts among its clients Paul McCartney and MPL Communications, Disney Music Group, Max Martin, Dr. Luke, Dave Grohl, Lady Antebellum, Stevie Nicks, No Doubt, Ryan Tedder, Kelly Clarkson, Skrillex, and Herbie Hancock among many others.  In 2013, Kobalt Music Group was honored as the first ASCAP Publishing Administrator of the Year and by receiving independent Publisher of the Year at the Music Week Awards (UK) for the fifth consecutive year.\n\nSee more at: www.kobaltmusic.com\n\nAbout MSD Capital\n\nFounded in 1998, MSD Capital is the private investment firm for Michael S. Dell and his family.  The firm currently manages in excess of $13 billion in assets utilizing a multi-disciplinary investment strategy encompassing traditional private equity activities, real estate and investment in publicly-traded securities, in each case with the objective of building an investment portfolio focused on maximizing long-term capital appreciation.  MSD Capital&rsquo;s team operates from the firm&rsquo;s offices in New York and Santa Monica.\n\nAdditional information is available at www.msdcapital.com\n\n\nFor further information and images, please contact:\n\nRebekah Alperin, rebekah.alperin@kobaltmusic.com +1 (310) 770-1045\n\n "
]