[
"April 1, 2014, London:- Kobalt Label Services (KLS) has signed a worldwide label services agreement with British singer-songwriter David Gray for his forthcoming new studio album Mutineers. The deal sees KLS partner with Gray&rsquo;s own IHT Records to release and promote the album, due to be released on June 17.\n\nRecorded at The Church Studios in London and produced by Andy Barlow (Lamb), Mutineers is Gray&rsquo;s tenth studio album and his first in four years. A video for the track &ldquo;Gulls&rdquo; will be released via his YouTube channel today (http://smarturl.it/dggullsvid). &ldquo;Gulls&rdquo; will also be available as an Instant Grat on iTunes from today.\n\nGray will support the release with a sold-out North American tour across April and May, following up with an eight-date headline UK tour in June and July including a show at London&rsquo;s Royal Albert Hall.\n\nThe singer-songwriter from Sale captured the world&rsquo;s attention with his breakout multi-platinum hit White Ladder (1998), which reached #1 in the UK Album Chart, and earned him a Grammy nomination for Best New Artist in 2002. He has continued to build on this success, with recent albums Draw The Line (2009) and Foundling (2010), both reaching the Billboard Top 10 in the US.\n\nCommenting on the new album, Gray said: &ldquo;I know I&rsquo;ve done something here that has an authority that is inspiring me and I don&rsquo;t have to worry about my past or any of that. The lovely thing about this is we&rsquo;ve had the time to experiment, and it&rsquo;s been wonderful.&rdquo;\n\nKLS North America president Diarmuid Quinn added: &ldquo;&lsquo;Mutineers&rsquo; is an incredible record from an artist at the top of his game. We are proud to be partnering with David and look forward to working with his management team at IHT on a global campaign for the record that will enable it to fulfill its full potential.&rdquo;\n\nPaul Hitchman, KLS managing director, said of the deal: &ldquo;We believe that Kobalt is the perfect partner for artists with the kind of creative passion and artistic integrity that David has, and we are therefore very gratified that artists of his stature and quality continue to be attracted to the services that Kobalt offers.&rdquo;\n\nGray&rsquo;s manager Rob Holden added: &ldquo;We've been in conversation with Kobalt over the past year and as the record came together so has their team around the world. We've seen the success they have had with their releases and are excited to partner with them for what promises to be an exhilarating new phase for IHT and David Gray.&ldquo;\n\nUS tour dates:\n\nApr 24 - Los Angeles, CA - Wilshire Ebell Theatre\n\nApr 25 - San Francisco, CA - Palace of Fine Arts Theatre\n\nApr 27 - Tacoma, WA - Pantages Theater\n\nApr 29 - Washington, DC - The Lincoln Theatre\n\nApr 30 - New York City, NY - The Grand Ballroom at Manhattan Center\n\nMay 2 - Philadelphia, PA - Temple Performing Arts Center\n\nMay 3 - Boston, MA  - Colonial Theatre\n\nMay 4 - Toronto, ON - The Danforth Music Hall\n\nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters.\n\nEstablished as an alternative to the traditional label model, KLS maximises client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.\n\nClients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\nwww.kobaltmusic.com"
]