[
"BIG &amp; RICH LAUNCH NEW LABEL &ndash; BIG &amp; RICH RECORDS AND ANNOUNCE UNIQUE PARTNERSHIP WITH KOBALT LABEL SERVICES FOR RELEASE OF NEXT STUDIO ALBUM\n\nNASHVILLE, TN -- Big &amp; Rich, one of the most truly original musical forces ever unleashed on country music, today announce they are starting 2014 with the formation of their own new label, Big &amp; Rich Records, and a unique new partnership with Kobalt Label Services (KLS).\n\nAs Kobalt Label Services second country signing, Big &amp; Rich joins superstar artists such as Martina McBride, Prince, New Kids On The Block and Nick Cave &amp; The Bad Seeds who are using KLS&rsquo; suite of customized services and self-releasing their music with a great deal of freedom and control over marketing and distribution.\n\nRecorded in Nashville, the as-yet-untitled album, which was produced by John Rich and Big Kenny, is the award-winning duo&rsquo;s fifth studio album. Their first single, &ldquo;Look At You,&rdquo; which was written by John Rich and Shannon Lawson, will be shipped to radio soon.\n\n&ldquo;2014 is a new milestone for us. We&rsquo;re completely invigorated to be working with Kobalt and New Revolution and taking this new approach for this exciting album. The music is very fresh, and we&rsquo;re in a new creative groove which we hope our fans and new audiences will like,&rdquo; said John Rich and Big Kenny in a joint statement.\n\nNew Revolution Entertainment (NRE), CRB's 2013 Independent Promotion Company of the Year, will oversee all aspects of national radio promotion. The company is headed by veteran independent radio promoters, Rob Dalton and Jeff Solima.\n\n&quot;All of us at NRE are over the top excited about this partnership. &quot;Look At You&quot; is a very obvious sounding commercial smash. This project is top shelf and deep with big singles,&quot; said Dalton.\n\nDiarmuid Quinn, President of Kobalt Label Services North America, said: &quot;I'm thrilled to be back in business with Big &amp; Rich and I treasure my relationship with John and Big Kenny. We were lucky enough to sign them during my tenure at Warner Brothers and they&rsquo;re two of the most prolific and creative artists I've had the opportunity to work with.  They&rsquo;ve delivered an incredible studio album to us that we are eager to help bring to the world. &quot;\n\nAbout Big &amp; Rich\n\nBig &amp; Rich exploded into the public consciousness in 2003 as that rarest of breeds&mdash;true country music game changers. With 2004&rsquo;s triple-platinum Horse of a Different Color, they were able to tap into the best strands of a wide spectrum of popular music, filter them through their pens and voices and produce a sound that is instantly recognizable, if not classifiable.  Their music has always displayed great range, with well-crafted songs about love, loss, patriotism and social issues all interspersed among those party anthems. For more information go to: www.bigandrich.com\n\nAbout New Revolution Entertainment (NRE)\n\nNRE was started by industry veterans Rob Dalton and Jeff Solima.  It was created and designed to provide full service national radio promotion representation for both independent and label signed artists.  The mission at NRE is to provide a credible and valid alternative for artists to operate on the highest levels of the country format.  Hit single releases include Gloriana, &quot;Wild At Heart,&quot; (AMA Best New Artist award) The Farm &quot;Home Sweet Home,&quot; Lee Brice, &quot;Love Like Crazy,&quot; (Billboard's Most Played Song of the Year) Emerson Drive, &quot;Moments&quot; (CMA song of the year nominee), Tim McGraw, &quot;Better Than I Used To Be,&quot; Steve Holy, &quot;Love Don't Run&quot;, Martina McBride &quot;I Just Call You Mine,&quot; Darryl Worley, &quot;Sounds Like Life.&quot; Currently NRE is breaking Will Hoge, &quot;Strong.&quot;\n\nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services. Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases. \n\nKobalt/KLS PR Contact: \nRebekah Alperin, SVP Communications/Marketing-Worldwide\nTel/Text: +1.310.770.1045 e-Mail: rebekah.alperin@kobaltmusic.com\n"
]