[
"KOBALT STIM AGGREGATED RIGHTS AB CONCLUDES MAJOR MUSIC LICENSES INCLUDING iTUNES, SPOTIFY, YOUTUBE, GOOGLE, AMAZON, NAPSTER AND VEVO\n\nCANNES, FRANCE (February 3, 2014) &ndash; In less than a year Kobalt STIM Aggregated Rights AB, the partnership between Kobalt Music Group (Kobalt) and STIM, has concluded agreements with all major music companies including iTunes, Spotify, YouTube, Google, Amazon, Napster and Vevo.\n\nIn March 2013 STIM and Kobalt launched a new one-stop European licensing solution for multi-territorial digital music service providers. The partnership has since demonstrated it can implement licensing faster in digital markets than any other licensing service, having already signed deals with a majority of the European online music market.\n\nThrough a simple licence, major digital music services that have signed an agreement have received Europe-wide online rights for Kobalt&rsquo;s entire repertoire of over 300,000 songs including some of the most popular hits across Europe.\n\n&ldquo;It&rsquo;s fantastic that the business model we launched together with Kobalt has resulted in so many important agreements and also in record time. It&rsquo;s a big step on the way towards a common European market for music rights and STIM&rsquo;s aim is to be a key player on the market,&rdquo; says Kenth Muldin, CEO of STIM.\n\n&ldquo;Through our one-stop digital licensing service and our unique shared technology platform, we are very pleased to be able to quickly satisfy the market need while uniquely giving our clients transparency and significantly accelerated access to their money,&rdquo; said Willard Ahdritz, Founder and CEO of Kobalt.\n\n&ldquo;I am very pleased with the speed and ease of which the Kobalt STIM partnership has executed the licensing process to enable quick delivery of our music to digital services and to the benefit of the market and consumers. The speed and efficiency sets a new standard which benefits the DSP&rsquo;s and the industry as a whole,&rdquo; added Tomas Ericsson, Kobalt President of Society Relations.\n\nAbout STIM\nSTIM is a collecting society for music creators and music publishers. On their behalf, STIM administers and licenses performing and mechanical rights to music and lyrics. STIM is a non-profit organization owned by its members. With the new licensing service through Kobalt STIM Aggregated Rights AB, STIM adds Kobalt&rsquo;s catalogue of online multi-territorial rights across Europe to STIM&rsquo;s innovation-driven development of state-of-the-art copyright services to authors and publishers worldwide. For more information, please visit www.stim.se/en.\n\nAbout Kobalt Music Group Ltd. (Kobalt)\nAs the leading global independent music services company, Kobalt administers more than 300,000 copyrights worldwide on behalf of over 1,500 content holders, including the world's top songwriters, artists and other music publishers. Kobalt counts among its clients Paul McCartney and MPL Communications, Disney Music Group, Max Martin, Dr. Luke, Dave Grohl, Lady Antebellum, Stevie Nicks, No Doubt, Ryan Tedder, Noah Shebib, Thom Yorke, Bj&ouml;rk, The Hives, The Lumineers, Richard Ashcroft, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Dave Stewart, Joss Stone, among many others. Kobalt&rsquo;s proprietary copyrights administration platform and direct collection infrastructure has been proven to collect royalties up to two years faster with up to 25% more income over traditional models. In 2013, Kobalt Music Group was honoured as the first ASCAP Publishing Administrator of the Year and by receiving Independent Publisher of the Year at the Music Week Awards (UK) for the fifth consecutive year. For more information, visit www.kobaltmusic.com."
]