[
"On February 7, Music Week's Rhian Jones published a feature story and Q&amp;A with Kobalt Founder and CEO Willard Ahdritz. To view the entire story go to: http://www.musicweek.com/\n\nPUBLISHING SPECIAL INTERVIEW: WILLARD AHDRITZ - &lsquo;KOBALT HAS NO COMPETITORS'\n\nThe rights company&rsquo;s charismatic CEO on future growth, industry greed and his favourite concept-achieving evermore transparency for artists and writers in the digital age.\n\nby Rhian Jones (Music Week)\n\nKobalt has a habit of making big European announcements just as Midem begins. It&rsquo;s all in the timing.\n\nBack in 2012, we saw the launch of its &lsquo;label&rsquo;- style offerings: an artist services division that&rsquo;s since successfully released albums by the likes of Nick Cave and Travis, plus a new dedicated neighbouring rights company.\n\nIn 2013, it revealed a new EU-wide deal with Swedish collection society STIM. And this week, just before the music biz&rsquo;s annual trade expo in Cannes, we got a significant update: the combined company, Kobalt STIM Aggregated Rights AB, has struck deals with the likes of iTunes, YouTube, Google and Spotify across Europe, taking its &lsquo;one-stop&rsquo; European licensing offer into new territory.\n\nA couple of weeks before Midem 2014, though, Kobalt threw us a curveball. Having built a reputation in publishing for striking administration deals with writers- with shockingly generous splits- the company made a serious acquisition. Its Kobalt Music Copyrights SARL enterprise snapped up all publishing and songwriting copyrights to Steve Winwood&rsquo;s entire back catalogue of 177 songs including tracks from his early career with Spencer Davis Group, Traffic and Blind Faith.\n\nMusic Week caught up with Kobalt CEO Willard Ahdritz at Midem to ask about the company&rsquo;s STIM deal, its acquisition strategy- and why, in the execs eye, the traditional industry has a lot to learn about transparency with publishing clients&hellip;\n\n\nMUSIC WEEK: What is your strategy when it comes to acquiring right wholesale, rather than striking the administration deals you&rsquo;re better known for?\n\nAHDRITZ: &quot;Kobalt is a services company. The vision from day one was to put artists and writers first, with an awareness that the music industry will become a tech industry too. We take care of 200 music partnerships today, including National Geographic and Disney, but we also take care of people who acquire copyrights. So for writers who wanted to sell their copyright but wanted to be with Kobalt, I said: &lsquo;You can sign up with EverGreen, Songs and Crosstown for example, because they [are administered by] us.' Then BMG Rights came and suddenly I had no copyright acquirers as a client! So we took the decision that we would set up a vehicle managed by Kobalt that allowed us control over investment [Kobalt Music Copyrights SARL]. It is a family of investors. We are managing other people&rsquo;s money; they are clients of Kobalt&rsquo;s. However, I guess I made a mistake: I put Kobalt&rsquo;s name on the investment fund name [which confused the industry]. Having said that, we have now made 20 investments [using] the fund, spending around $60m. We have acquired [the catalogue of] Steve Winwood, which I&rsquo;m very pleased about, and Lindsey Buckingham. The fund can also create advances, so if a publishing client needs that advance money, we have a vehicle that can provide it. Kobalt&rsquo;s strategy is not to acquire rights [as a publishing company] and are never going to do it. But I now have a tool to use if people say, &lsquo;We want to be here, we trust you.&rsquo; I&rsquo;m not going to give them a number of another company - I&rsquo;ll say use this company that we are managing.'&quot;\n\nMUSIC WEEK: In January last year you said you had more than 180 people employed. Where does that figure stand today and what are your financial projections for FY14?\n\nAHDRITZ: &quot;Today we have 210 people in the company and we continue to grow. The revenue has gone up 40%, so for the period from July 2012 to June 2013 it was $175m. The forecast for this financial year ending in 2014 we are estimating $250m, which up another 45%.&quot;\n\nMUSIC WEEK: What is it that&rsquo;s contributing to that growth?\n\nAHDRITZ: &quot;Great clients, and all my clients have a 98.5% retention rate. They are recommending Kobalt to other people. We are signing some of the biggest acts.&quot;\n\nMUSIC WEEK: Who are your competitors?\n\nAHDRITZ: &quot;Kobalt doesn&rsquo;t have a competitor because we are here to be a service provider. It seems those other companies are asset owners-they want to acquire publishing rights. So in one sense we are unique.&quot;\n\nMUSIC WEEK: You seemed to have a fairly negative view on the music industry: deals based on greed paying those at the top loss of money while the artists don&rsquo;t get remunerated properly. Do you think that&rsquo;s changing?\n\nAHDRITZ: &quot;We all know the stories historically, but I&rsquo;m very optimistic about the future of growth in the market and believe that the internet will drive transparency. Kobalt and other companies will drive transparency. Trust is good but control is better, my wife tells me [Laughs]. We are showing out clients; this is your YouTube payments, this is the number of streams and this is the money per song. I&rsquo;m very proud of what we are delivering. As a publisher you have revenue streams from a lot of different places; CDs, downloads, performance, radio, sync and sheet music. We are paying out over half a million royalty lines for a big pop song [right now] so you can see the enormous volume of data that we can process and this was exactly what Kobalt was set up to do. My vision was that [the industry] needs global databases centralized. Kobalt is running an organ which is the best transactional database in the world. We can match Spotify, YouTube, and those big telecoms services. We have seen a lot of people on the recording side complaining about [streaming] pay. But one big song today can [spawn] 20,000 different user generated video [that Kobalt can monetize]. We have integrated our technology with YouTube so every Kobalt client can log in and get real time registration, real time data. 50p is not very much money but if there&rsquo;s 20,000 of them per month it adds up and that&rsquo;s what this is about.&quot;\n\nMUSIC WEEK: Do you still feel that there&rsquo;s a negative attitude towards what Kobalt does from some corners of the publishing industry?\n\nAHDRITZ: We don&rsquo;t comment on what other people think about us-we talk about what we do. We are nice people, we don&rsquo;t attack others. We are here to change the industry, make the industry work and to increase the cake [for rights-holders]. My kids are streaming YouTube-they don&rsquo;t watch TV. Should I tell them that you can&rsquo;t use YouTube because I don&rsquo;t like it? I think if people like to consume music through streaming, we should let them. I&rsquo;m here to maximize the value for music copyrights, over time [fellow publishers] will see that this will benefit many people. They wanted me on the board of National Music Publishers&rsquo; Association, so all the music publishers voted in May last year that we want Willard at the table. People are starting to see that maybe Kobalt is thinking [about the future], which I&rsquo;m very happy about because that&rsquo;s what we have said from day one.\n\nMUSIC WEEK: Your initial business was built on publishing administration and collecting royalties. Is that still your focus?\n\nAHDRITZ: &quot;No-I want to say that I have 42 sync people, we have 20 A&amp;R people. I have 60 creative people on my payroll, so we invest heavily in being creative advisors and support. Our procurement sync rate is 38%-that is all just through publishing. The label services has the whole social media marketing, sync aspects etc. too. My first employee [hired at Kobalt] was Sas Metcalfe-before Kobalt she had been head of A&amp;R for Warner Chappell where she had found Radiohead, David Gray, Did, Saint Etienne, Lisa Stansfield. I played saxophone for 15 years, a musician from the start. We are a music company but we are backed by technology. I&rsquo;m very happy that we are representing Thom Yorke, Trent Reznor, Paul McCartney, Alt-J and much more fantastic music. I know other people say that Kobalt is not creative. I say to those people: ask our clients what they think.&quot;\n\nMUSIC WEEK: Kobalt Label Services has already performed impressively for big acts like Nick Cave-can it ever work for emerging artists?\n\nAHDRITZ: You know, time will tell. Paul Hitchman who set up KLS, is one of the best digital guys in the world. With great people you can do fantastic things. But we would not give people half a million dollars [as an advance] and then take their rights.\n\nMUSIC WEEK: You told us last year that you wanted to double the amount of monetized consumers every year for the next three years-mainly through extracting revenue from user-generated YouTube videos and other untraditional sources.\n\nAHDRITZ: We are on target: in the coming 12 months we are going to get to 1.5bn people we are monetizing. That&rsquo;s a revolution. I said last year it would take us two years to get to 1.5bn, and 12 months later we are on target. So I&rsquo;m very pleased that with 49% growth per annum going up-that is really changing the music industry. We&rsquo;re absolutely putting the structure in place for us to have a music industry that works, artists getting paid and writers.\n\nMUSIC WEEK: What&rsquo;s the financial viability of your publishing company is that also growing?\n\nAHDRITZ: Our publishing business is profitable- it&rsquo;s been profitable for a long time, but we are investing for heavy growth. This year over 12 months we employed probably 55 people, we opened up two new offices worldwide. If Amazon invests heavily in the Cloud business that doesn&rsquo;t mean that the online book business is not profitable. I can tell you that we have some of the best financial brains in the world that are sitting on the board of Kobalt and investing in Kobalt. Spark [Investments] sold some stocks in Kobalt and Kobalt was valued at &pound;140m. That&rsquo;s your answer. [Kobalt&rsquo;s] publishing is profitable. I need to reiterate that. It will make some people unhappy, but it is a fact.\n\nMUSIC WEEK: Do you have any other upcoming news or launches?\n\nAHDRITZ: Yes, lots. Lots will come this spring, big stuff.\n\nMUSIC WEEK: So&hellip;the biggest year in Kobalt&rsquo;s history?\n\nAHDRITZ: 100%. We can say one thing: we have just started at Kobalt. Now the fun can begin. \n\n\n(MUSIC WEEK)"
]