[
"LOS ANGELES, CA (January 26, 2014) -- At the 56th Annual Grammy Awards Kobalt clients and staff celebrated major wins in 15 categories including Best Rock Song, Best Country Album, Best Dance Recording, Best Dance/Electronica Album, Best Alternative Music Album, and Best Urban Contemporary Album among others. The awards were given out Sunday, January 26 in Los Angeles during a global telecast.\n\nClients Dave Grohl, Paul McCartney (MPL) and Krist Novoselic won Best Rock Song for &ldquo;Cut Me Some Slack&rdquo; from the soundtrack album, Sound City &ndash; Real to Reel. Grohl and co-producer Butch Vig also received the Best Compilation Soundtrack For Visual Media Grammy.\n\nSongwriter and producer Shane McAnally celebrated major wins including the Best Country Album Grammy for artist Kacey Musgraves. McAnally co-wrote and co-produced Musgraves&rsquo; chart-topping album, Same Trailer Different Park (Mercury).\n\nKobalt publishing client and artist Zedd (a.k.a. Anton Zaslavski) received a Grammy for Best Dance Recording for his international smash hit, &ldquo;Clarity.&rdquo; The chart-topping Seattle-based hip-hop duo Macklemore and Ryan Lewis, a client of Kobalt Neighbouring Rights, also won four Grammys, including Best New Artist and three rap awards. Kobalt additionally administers the duo&rsquo;s publishing via client Inside Passage Music.\n\nBenjamin Levin (a.k.a. Benny Blanco) co-wrote tracks on Bruno Mars&rsquo; Grammy-winning Best Pop Vocal Album, as well as wrote songs for Rihanna&rsquo;s album, Unapologetic (Def Jam), which took honors for Best Urban Contemporary Album. Grammy-nominated producer Ariel Rechtshaid celebrated the Best Alternative Music Album win by Vampire Weekend (XL Recordings), which he produced. Wayne Shorter additionally won the Best Improvised Jazz Solo award for &ldquo;Orbits.&rdquo; \n\nThe following list highlights fifteen Grammy Awards related to Kobalt clients:\n\nWINNER\nCategory: Album Of The Year\nRandom Access Memories by Daft Punk (Columbia)\nKobalt Client: Todd Edwards (writer)\n\nWINNER\nCategory: Best Pop Vocal Album\nUnorthodox Jukebox by Bruno Mars (Atlantic)\nKobalt Client: Benjamin Levin aka Benny Blanco (writer)\n\nWINNER\nCategory: Best Dance Recording\n&ldquo;Clarity&rdquo; by Zedd Feat. Foxes (Interscope)\nKobalt Client: Anton Zaslavski aka Zedd (writer/producer/mixer)\n\nWINNER\nCategory: Best Dance/Electronica Album\nRandom Access Memories by Daft Punk (Columbia)\nKobalt Client: Todd Edwards (writer)\n\nWINNER\nCategory: Best Traditional Pop Vocal Album\nTo Be Loved by Michael Bubl&eacute; (143/Reprise)\nKobalt Client: Amy Foster (writer)\n\nWINNER\nCategory: Best Rock Song\n&ldquo;Cut Me Some Slack&rdquo; from the album Sound City - Real To Reel\nKobalt Clients: Dave Grohl, Paul McCartney/MPL Communications Inc., Krist Novoselic\n\nWINNER\nCategory: Best Alternative Music Album\nModern Vampires Of The City by Vampire Weekend (XL Recordings)\nKobalt Client: Ariel Rechtshaid (writer)\n\nWINNER\nCategory: Best Urban Contemporary Album\nUnapologetic by Rihanna (Def Jam)\nKobalt Client: Benjamin Levin aka Benny Blanco (writer)\n\nWINNER\nCategory: Best Rap Song\n&ldquo;Thrift Shop&rdquo; by Macklemore &amp; Ryan Lewis Featuring Wanz (Macklemore &amp; Ryan Lewis LLC)\nKobalt Client: Inside Passage, publisher of Macklemore &amp; Ryan Lewis\n\nWINNER\nCategory: Best Rap Album\nThe Heist by Macklemore &amp; Ryan Lewis (Macklemore &amp; Ryan Lewis LLC)\nKobalt Client: Inside Passage, publisher of Macklemore &amp; Ryan Lewis\n\nWINNER\nCategory: Best Country Album\nSame Trailer Different Park &ndash; Kacey Musgraves (Mercury Nashville)\nKobalt Client: Shane McAnally (co-writer and co-producer)\n\nWINNER\nCategory: Best Improvised Jazz Solo\nOrbits by Wayne Shorter, soloist (Blue Note)\nKobalt Client: Wayne Shorter\n\nWINNER\nCategory: Best Compilation Soundtrack For Visual Media\nSound City: Real To Reel by Dave Grohl &amp; Various Artists (RCA/Roswell)\nKobalt Clients: Dave Grohl (&amp; Various Artists) Butch Vig, compilation producer\n\nWINNER\nCategory: Best Surround Sound Album\nLive Kisses by Paul McCartney (Eagle Rock Entertainment)\nKobalt Client: Paul McCartney/MPL Communications\n\nWINNER\nCategory: Best Music Film\nLive Kisses by Paul McCartney / Jonas Akerlund, video director (Eagle Rock Entertainment)\nKobalt Client: Paul McCartney (MPL Communications)\n \n\n"
]