[
"April 24, 2014, (NEW YORK, NY) -- Kobalt Label Services (KLS) is proud to announce the signing of a worldwide label services agreement with superstar Lenny Kravitz to release and promote his upcoming studio album, Strut, which will debut on September 23, 2014. Additional album and tour details will be announced in the coming weeks.\n\nSaid Lenny Kravitz: &quot;I am looking forward to my partnership with Kobalt. They have a passionate team that share a high artistic view. I am confident that they are the right partner to carry out my creative vision for this album.&quot;\n\nAdded Richard Sanders, President of Kobalt Music Group: &ldquo;We are thrilled to be working with Lenny and the Roxie Records team.  Lenny is in peak creative form, writing and recording what we believe is some of his best material yet.  We look forward to working closely with him as part of the Kobalt family to create more unforgettable Lenny moments around the world.&rdquo;\n\nRegarded as one of the preeminent rock musicians of our time, Lenny Kravitz has transcended genre, style, race and class in a 20-year music career, one which revels in the rich influences of '60s and '70s soul, rock and funk.  Kravitz&rsquo; talents as a writer, producer and multi-instrumentalist are unparalleled.  He has won four consecutive Grammy Awards, setting a record for the most wins in the &ldquo;Best Male Rock Vocal Performance&rdquo; category.  Kravitz' most recent albums include the 20th anniversary deluxe edition of his debut, Let Love Rule, and his 2011 critically acclaimed studio release, Black and White America.\n\nHaving sold over 38 million albums worldwide, Kravitz&rsquo; musical success has afforded him many opportunities to fulfill his creative vision beyond the recording industry.  The artist appeared in the critically acclaimed film Precious, the box office smash films The Hunger Games and Catching Fire, as well as Lee Daniels&rsquo; The Butler.  In addition to his music and film work, in 2003 Kravitz launched a creative firm, Kravitz Design Inc., which provides commercial and residential design services, product development and branding.\n\nAbout Kobalt Label Services (KLS)\nPart of Kobalt Music Group, KLS provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters.  Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.  For more information, go to: www.kobaltmusic.com\n"
]