[
"MIAMI, FL (April 8, 2014) -- Kobalt Music Group (Kobalt), the leading global independent music services company, today announced it is underway in preparations for expansion into the Latin American market.\n\nAdvising the Kobalt executive team is Nestor Casonu, the former CEO of EMI Latin America and longtime regional managing director for EMI&rsquo;s Latin publishing division. Casonu is consulting with Kobalt through his own Miami-based Casonu Strategic Management.\nCasonu is working closely with Richard Sanders, President of Kobalt, in designing the roadmap to strengthen and expand Kobalt&rsquo;s existing Latin American society relations, as well as to identify opportunities to maximize income and the exploitation of rights on behalf of Kobalt clients worldwide.\n\nIn making the announcement, Sanders said: &ldquo;Since day one of joining Kobalt I have been reviewing how to augment our operations in Latin America and develop an even greater level of service to our existing and future clients. Nestor&rsquo;s first task is to further strengthen our society relationships and design the strategic path for local expansion in the region. It has taken me 2.5 years to find the right executive and with Nestor&rsquo;s experience, relationships and expertise in publishing and master rights I feel we are in good hands.&rdquo;\n\n&ldquo;I&rsquo;m very pleased to be working with Kobalt Music at this opportune time in the music business and particularly in Latin America. Kobalt&rsquo;s philosophy as a service company putting the artist and songwriter first, as well as impressive track record in providing transparency and maximizing the value of copyrights is something I personally believe in and practice,&rdquo; added Casonu.\n\nWith over 35 years experience in the music business, Casonu is a widely respected executive with a history as a change agent in the complex and ever evolving Latin American market. After beginning his career and rising through the ranks at CBS Argentina (now Sony Music) and then as head of Leader Music, in 1992, Casonu joined EMI Music Publishing as Managing Director of Argentina. During his 20-year tenure at EMI, he went on to become Regional Director in Miami. He also was President of FLADEM (Federation of Latin American Music Publishers) during this time. As EMI&rsquo;s Regional Director, he supervised operations and successfully restructured the region and signed such artists as Daddy Yankee, Don Omar, Ricky Martin, Ricardo Montaner, among others. Under his leadership, the company was also named &ldquo;Top Latin Songs Publishing Corporation&rdquo; in Billboard&rsquo;s 2010 Year-End Issue.  In 2011 he also assumed a dual role, heading up both EMI Latin&rsquo;s recorded-music and publishing operation.\n\n"
]