[
"For an English translation, go to: http://www.kobaltmusic.com/page-news-detail.php?id=WN2204\n\nMIAMI, FL (8 Abril, 2014) -- Kobalt Music Group (Kobalt), la compa&ntilde;&iacute;a independiente global l&iacute;der en servicios en el negocio de la m&uacute;sica, hoy anuncio que ha puesto en marcha las preparaciones para su expansi&oacute;n a el mercado Latinoamericano.\n\nNestor Casonu, ex-CEO de EMI Latino Am&eacute;rica y por mucho tiempo Director Regional de la divisi&oacute;n Latina de EMI Publishing esta asesorando al equipo ejecutivo de Kobalt a trav&eacute;s de su propia compa&ntilde;&iacute;a, Casonu Strategic Management la cual esta basada en Miami.\n\nCasonu esta trabajando estrechamente con Richard Sanders (Presidente de Kobalt) dise&ntilde;ando la estrategia para fortalecer y expandir las existentes relaciones de Kobalt con las sociedades Latino Americanas tanto como identificar oportunidades para maximizar ingresos y la explotaci&oacute;n de derechos para los clientes mundiales de Kobalt.\n\nAl hacer el anuncio, Sanders dijo: &ldquo;Desde mi primer d&iacute;a en Kobalt he estado investigando como aumentar nuestras operaciones en Latino Am&eacute;rica y desarrollar un aun mayor nivel de servicio para nuestros clientes existentes y futuros. La primera tarea de Nestor ser&aacute; fortalecer nuestras relaciones con sociedades y dise&ntilde;ar el camino estrat&eacute;gico para la expansi&oacute;n en los territorios de la regi&oacute;n.  Me ha llevado 2.5 a&ntilde;os para encontrar el ejecutivo adecuado y con la experiencia, relaciones y maestr&iacute;a de Nestor en Publishing y derechos de grabaciones me siento que estamos en buenas manos.&rdquo;\n\n&ldquo;Estoy muy contento de estar trabajando con Kobalt Music en este momento tan oportuno en el desarrollo del negocio de la m&uacute;sica, particularmente en Latino Am&eacute;rica.  La filosof&iacute;a de Kobalt como una empresa de servicios poniendo el Artista y Compositor primero, as&iacute; como su excelente imagen y trayectoria de brindar transparencia maximizando el valor de los creadores es algo en lo que yo personalmente creo y practico desde mis inicios en este negocio,&rdquo; agrego Casonu.\n\nCon mas de 35 a&ntilde;os de experiencia en el negocio de la m&uacute;sica, Casonu es un respetado ejecutivo con una larga historia como un precursor de modelos y adaptaciones en el complejo y siempre cambiante mercado de Latino Am&eacute;rica. Despu&eacute;s de comenzar su carera en CBS Argentina (actualmente Sony Music) donde paso por diferentes roles hasta llegar al de Director Comercial fue fundador y Director General de Leader Music. Casonu se uni&oacute; a EMI Music Publishing en el 1992 como Director local de Argentina.  Durante sus 20 a&ntilde;os en EMI, llego a ser Director Regional basado en Miami.  Tambi&eacute;n fue Presidente de FLADEM (Federaci&oacute;n Latino Americana de Editores Musicales) durante este tiempo. Como Director Regional de EMI, Casonu superviso operaciones donde exitosamente reestructuro la regi&oacute;n y firmo artistas como Daddy Yankee, Don Omar, Ricky Martin, Ricardo Montaner, entre otros. Bajo su liderazgo, la compa&ntilde;&iacute;a fue nombrada por Billboard como la &ldquo;Top Latin Songs Publishing Corporation&rdquo; en el a&ntilde;o 2010.  En el 2011, Casonu fue nombrado CEO de EMI Latino America tomando bajo su control las operaciones de la disquera y la editorial.\n\n"
]