[
"LOS ANGELES, CA (July 8, 2014) &ndash; Kobalt Label Services (KLS) has appointed Tom Smith to the position of VP of Sales and Marketing.\n\nFor the past year, Smith has been a marketing, sales and business development consultant for Kobalt helping to establish the company&rsquo;s label services footprint on the west coast. In his new position, he&rsquo;ll work alongside Shari Segalini, Kobalt&rsquo;s SVP of Sales, North America and continue to report to Diarmuid Quinn, President of KLS North America, in Los Angeles.  Smith will conduct day-to-day business on behalf of KLS clients with national, physical and digital retailers such as iTunes, Amazon, Walmart, Target, Best Buy, Anderson, Google, and other non-traditional and indie retailers. In addition, Smith will also seek strategic brand partnerships for KLS artists that connect with retail.\n\nIn making the announcement, Quinn said: &ldquo;Tom is a dynamic executive who has delivered incredible results and support for Kobalt artists since the launch of KLS. His relationships with our retail partners and our artists runs deep, and we&rsquo;re excited he has agreed to come on full time as part of the rapidly growing KLS team.&rdquo;\n\nSmith added: &quot;I am excited to be a part of the new model that Kobalt Label Services has created for artists to release their music. To be able to execute on marketing launch plans based on the artists&rsquo; vision with the artist having total control is an amazing environment to work in.  I am grateful to Willard Ahdritz, Richard Sanders, Paul Hitchman, Diarmuid Quinn and Shari Segalini for this opportunity.&rdquo;\n\nSmith, who has worked in executive roles for over 20 years in major labels, began his career at Capitol Records and then moved over to RCA Music Group as Sr. Director Sales for 12 years where he managed national campaigns for major acts including Dave Matthews Band, Foo Fighters, Christina Aguilera, Tyrese, Kelly Clarkson, Carrie Underwood, Kings of Leon, Velvet Revolver, Rod Stewart and Maroon 5. He went on to a similar role at \n\nHollywood Records where he was part of the team that launched such artists as Miley Cyrus, Jonas Brothers, Demi Lovato and Selena Gomez, among others.\n\nMost recently prior to Kobalt, Smith was head of sales and brand partnerships for New Heights Entertainment, where he launched Deep Well Records for Adam Anders and worked on campaigns for Redone and his 2101 Records imprint.  Prior to New Height Entertainment he lead global marketing teams at THQ Games for the UFC and WWE games franchises.\n"
]