[
"Kobalt Neighbouring Rights (KNR) has added another raft of major international artists to its roster, including Red Hot Chili Peppers, Lenny Kravitz, Akon, Jamaica&rsquo;s Sean Paul, the UK&rsquo;s Foxes, Steve Angello and folk legend Art Garfunkel.\n\nMulti-Grammy award winners Red Hot Chili Peppers have sold over 80 million records worldwide to date, with many of their albums, including Californication, By The Way, and Stadium Arcadium being certified platinum several times over. This year saw the Chili Peppers play the Super Bowl halftime show, which was the most watched in its history, and begin work on their 11th studio album.\n\nRevelling in the rich influences of &rsquo;60s and &rsquo;70s soul, rock and funk, Lenny Kravitz&rsquo;s talents as a writer, producer and multi-instrumentalist have seen him achieve sales of over 38 million albums worldwide. He has won four consecutive Grammy Awards, setting the record for the most wins in the &ldquo;Best Male Rock Vocal Performance&rdquo; category. Kravitz recently released &ldquo;The Chamber&rdquo;, the first single from his 10th studio album Strut, which is due to be released on September 23rd via Kobalt Label Services.\n\nAnother new addition is US R&amp;B/hip-hop artist Akon who broke records in 2007 when he became the first solo artist to hold both the number one and two spots simultaneously on the Billboard Hot 100 charts. Alongside his hugely successful music endeavours Akon runs a charity for underprivileged children in Africa called Konfidence Foundation.\n\nJoining them is multi-platinum selling Jamaican rapper and producer Sean Paul, who grabbed the Best Reggae Act award at the 2013 MOBO Awards for the fourth time. His 2014 album Full Frequency debuted at #1 on the Billboard Reggae Albums chart.\n\nKNR has also snapped up hotly-tipped British singer-songwriter Foxes who has started the year strongly, with a Grammy win in the Best Dance Recording category as featured vocalist on fellow KNR client Zedd&rsquo;s &ldquo;Clarity&rdquo;, and the #5 entry of her debut album Glorious in the UK Albums Chart.\n\nDJ, record producer and label owner Steve Angello is well recognised for his part in the hugely successful electronic dance trio Swedish House Mafia. His vast solo output has seen him work with the likes of Eric Prydz and Sebastian Ingrosso (also of Swedish House Mafia), as well as under different aliases.\nBest known as one half of the legendary folk duo Simon &amp; Garfunkel, Art Garfunkel has also maintained a long-standing solo career that includes a number of platinum-selling albums. His work as Simon &amp; Garfunkel, alongside existing KNR client Paul Simon, has seen him achieve Grammy success on several occasions, including a Lifetime Achievement Award. \n\nAnn Tausis, Managing Director of Kobalt Neighbouring Rights said: &ldquo;This year has already seen our client list grow rapidly with the addition of many prominent acts, and we&rsquo;re delighted to be able to count these artists among them. Their international appeal makes them an ideal fit for our services and we look forward to working closely with them to realise their Neighbouring Rights revenues.&rdquo;\n\n"
]