[
"(NEW YORK and LONDON) May 1, 2014 &ndash; In response to the music industry&rsquo;s growing challenge of detecting, collecting and reporting income from the mass of videos uploaded to YouTube daily, Willard Ahdritz, Founder and CEO of Kobalt Music Group (Kobalt), today announced that Kobalt&rsquo;s unique technical integration with YouTube, including the launch of ProKlaim, Kobalt&rsquo;s advanced detection technology, has significantly increased revenues collected on behalf of its clients, matching over 50 million videos to date and over 1 billion YouTube streams per month.\n\n&ldquo;Our mission has always been to help artists and songwriters maximize their digital revenue,&rdquo; said Ahdritz.  &ldquo;Our technical integration with YouTube now allows us to do that in a groundbreaking way.  We&rsquo;ve been able to deliver 100% of Kobalt&rsquo;s eligible catalog to YouTube with an extended range of high quality metadata for each song that enables much faster, more efficient content matching and reporting.  It also enables us to deliver daily automated feeds of updated new, claimed and blocked content to ensure we are quickly resolving any rights conflicts for our clients.&rdquo;\n\nThe recent launch of ProKlaim, Kobalt&rsquo;s proprietary detection technology, has also fueled a major increase in Kobalt client royalties.  Beyond the standard claims reports that music publishers use, ProKlaim supplements YouTube&rsquo;s own in-house fingerprinting technology to match copyright information with unclaimed YouTube UGC videos featuring music.\n\n&ldquo;One hit song can generate up to 50,000 user-generated videos, many of which remain unclaimed by its proper rights owners,&rdquo; said Ahdritz.  &ldquo;With the launch of ProKlaim, we are seeing a phenomenal increase in the speed and accuracy in which we find and claim missing content.  Kobalt is now processing over 1 billion streams per month, and this is only the beginning!&rdquo;\n\nThe announcement comes just under a year since the company debuted its groundbreaking Kobalt Portal, an advanced analytics engine that provides transparent, user-friendly, live reporting, giving clients unprecedented access to a wide range of account activity, including YouTube video streams and their respective income.\n\nAbout YouTube\nYouTube is the world's largest online video community, allowing millions of people to discover, watch, and share original videos.  YouTube provides a forum for people to connect, inform, and inspire others across the globe and acts as a distribution platform for original-content creators and advertisers large and small.  YouTube, LLC, is based in San Bruno, California, and is a subsidiary of Google, Inc.\n\nAbout Kobalt Music Group\nKobalt Music Group (Kobalt) is the leading global, independent music services company, offering music publishing, label services and neighbouring rights services worldwide.  Kobalt provides its clients with unparalleled transparency, online copyright administration and royalty tracking (including a real-time online portal), creative and synch/licensing services, weekly online balances, digital collections and advances to writers, publishers, performers and other rights holders.  With 210 employees in offices in London, New York, Los Angeles, Nashville, Atlanta, Berlin, Sydney and Stockholm as well as agents in over 20 major territories, Kobalt administers more than 300,000 copyrights on behalf of content holders, including the world&rsquo;s top songwriters, artists and other music publishers.  Kobalt counts among its clients Paul McCartney and MPL Communications, Disney Music Group, Max Martin, Dr. Luke, Dave Grohl, Lady Antebellum, Stevie Nicks, No Doubt, Ryan Tedder, Kelly Clarkson, Skrillex, and Herbie Hancock among many others. In 2013, Kobalt Music Group was honored as the first ASCAP Publishing Administrator of the Year. The company was named Independent Publisher of the Year for the sixth consecutive time at the 2014 Music Week Awards (UK).\n\n                                                                                                           # # #\n\nKobalt Contact:\nRebekah Alperin, SVP Communications &amp; Marketing &ndash; Worldwide\nTel/Text: +1-310-770-1045 &ndash; rebekah.alperin@kobaltmusic.com"
]