[
"Kobalt Label Services (KLS) has undertaken an internal reorganisation of its team in response to the continued expansion of its services and strong growth in clients and sales.\n\nVincent Clery-Melin has been promoted to the role of Managing Director KLS UK. In addition to his current responsibilities as Managing Director of AWAL, Clery-Melin will now head up the Label Services team in the UK, and will oversee the marketing of KLS releases in the territory. He will also be responsible for signing new clients to KLS, and will continue to identify and sign new clients for AWAL's digital distribution services worldwide. \n\nIn addition, Pete Dodge has been appointed VP, KLS Operations and Distribution from his former position as General Manager of KLS. In his new role, Dodge will oversee KLS' global digital distribution platform and digital account management, as well as its relationships with physical distribution partners internationally and the physical product supply chain. \n\nClery-Melin and Dodge will both continue to report to Paul Hitchman, who has also assumed a new position as President of Kobalt Label Services International.\n\nHitchman said: &ldquo;Vincent and Pete have both made huge contributions to the success of KLS and I&rsquo;m delighted to see them in these new roles as we continue to expand both our team and our services.&rdquo;\n\nVincent Clery-Melin commented: &ldquo;It&rsquo;s a real honour to be heading up such a fantastic team, and I look forward to continuing to work closely with Paul to offer a first-class service to KLS and AWAL clients.&rdquo;\n\nPete Dodge added: &ldquo;It is very satisfying to be creating a global infrastructure that supports both digital and physical releases at the highest level, and to offer a truly viable and progressive alternative to the traditional labels.&rdquo;\n\nAlready this year, KLS&rsquo; full-service model, which sees artists retain master ownership, has continued to attract significant talents with recent signings including Lenny Kravitz, David Gray, Billy Idol, Die Antwoord, Todd Terje, Julian Casablancas, Karen O, Kele Okereke, Macy Gray.\n"
]