[
"NEW YORK, NY (July 21, 2014) &ndash; Sarah Landy has been appointed to the new position of General Manager for AWAL North America, a division of Kobalt Label Services.\n\nReporting to Vincent Clery-Melin, Managing Director of AWAL, Landy is based in Kobalt&rsquo;s New York office and works alongside the UK-headquartered AWAL team and the Kobalt Label Services teams in NYC, LA and London to lead business development in North America.  The role encompasses bringing in artist and label clients, overseeing client marketing campaigns in the US and Canada for label partners and developing artists signed to AWAL with label services, in addition to liaising AWAL&rsquo;s core digital distribution service and sales support. \n\nFor the past 12 years Landy has held various positions in the music business, most recently as Senior Director of Marketing for Sony&rsquo;s RED Associated Labels, which was preceded by a four year tenure as Senior Director of RED Distribution&rsquo;s independent marketing agency, &lsquo;stache media, where she spearheaded the company&rsquo;s launch and directed advertising, college lifestyle marketing, consumer research, online marketing and publicity services.  Before &lsquo;stache media, Landy worked in several positions, including Sr. Director of Media Relations for the label services company World&rsquo;s Fair, where she managed media relations, PR and marketing campaigns for such clients as Nat Geo Music, Daptone Records, The Dandy Warhols' Beat The World Records, Fabric, PIAS, Bella Union and Rough Trade among others.  Prior to World&rsquo;s Fair, she opened and managed the NYC office of Quannum Projects, handling publicity and tour marketing, and she was also an independent publicist for KSA PR/Press Here in New York.\n\nUpon making the announcement, Clery-Melin said: &ldquo;I&rsquo;m over the moon that Sarah is joining us to lead the AWAL business in North America.  I couldn&rsquo;t think of someone with better experience and energy to launch AWAL in the US.  I&rsquo;m looking forward to working with her to offer services to artists and labels from overseas as well as sourcing US-based label and artist clients for AWAL.&rdquo;\n\n&quot;I am invigorated to have come on board with Kobalt and to be working with Vincent and the AWAL team to further develop the business in North America.  I have immense respect for Kobalt's philosophy of transparency and artist friendliness, plus the technology roots of Kobalt and AWAL,&quot; added Landy.\n"
]