[
"Julian Casablancas+The Voidz are premiering &ldquo;Human Sadness,&rdquo; the first track from their forthcoming debut album, Tyranny. Tyranny is out on Cult Records September 23 in the U.S./Canada and October 14 internationally. Beginning today, Tyranny is available for pre-order via www.cultrecords.com and all major digital/physical retailers.\n\nIn addition to its digital release, Tyranny will be available in multiple physical configurations including cassette, CD and vinyl.  Most notably, Tyranny will also be available as a limited edition lighter sleeve containing the 12-track album as high quality MP3s on a built in USB flash drive. The first of its kind, the lighter sleeve features custom Julian Casablancas+The Voidz artwork and will be available in white, black and yellow. Tyranny is available for preorder now digitally for $3.87, and &ldquo;Human Sadness&rdquo; is available today for $.59 via Cult Records.\n\nWritten and recorded over the past year, Tyranny features Casablancas and Voidz band members Jeramy Gritter and Amir Yaghmai (Salt &amp; Pepper)&mdash;guitar, Jeff Kite&mdash;keyboards, Jake Bercovici&mdash;bass, Alex Carapetis&mdash;drums and was produced by Shawn Everett. Please see below for full track listing.\n\nOf the album&rsquo;s title Casablancas says, &ldquo;Tyranny has come in many forms throughout history. Now, the good of business is put above anything else, as corporations have become the new ruling body. Most decisions seem to be made like ones of a medieval king: whatever makes profit while ignoring and repressing the truth about whatever suffering it may cause (like pop music, for that matter).&rdquo;\n\nJulian Casablancas+The Voidz will begin their first ever &ldquo;American tour to melt peoples&rsquo; faces off&rdquo; as Casablancas calls it, here in the U.S. on Thursday, October 16 in Philadelphia, PA. Other cities include Seattle, Washington, D.C. and Los Angeles. More dates to be announced soon, more info and ticket links can be found on www.cultrecords.com.\n"
]