[
"The Art Of McCartney is a long awaited and very special project celebrating one of the most universally acclaimed songwriters of all time, Sir Paul McCartney. With backing provided by McCartney&rsquo;s long time band, classic tracks such as Maybe I&rsquo;m Amazed, My Love, The Long And Winding Road, When I&rsquo;m 64, Let It Be, Helter Skelter, Eleanor Rigby, Live And Let Die have been recorded by some of the world&rsquo;s greatest artists.\n\nThe calibre of artists showing their respect to Paul&rsquo;s songwriting genius is truly staggering. Bob Dylan, Billy Joel, The Cure, The Who&rsquo;s Roger Daltrey, Brian Wilson, Alice Cooper, Def Leppard, Dr John, Yusuf, Barry Gibb, Jamie Cullum, KISS, Chrissie Hynde, ELO legend Jeff Lynne, and many more have recorded McCartney songs exclusively for this album.\n\nThe Art Of McCartney is the brainchild of Los Angeles producer, Beatles and McCartney fanatic, Ralph Sall, who has driven this project from conception to delivery. Sall met and worked alongside Paul in 2003 when they revived a song from the 1971 Ram sessions for a movie soundtrack. Ralph then asked Paul and his publishing company if they would support his making this album to honour him. They came back with Paul&rsquo;s own blessing and thumbs aloft for the project to go ahead.\nRalph became a man on a mission, first recruiting McCartney&rsquo;s gifted backing guitarists, Rusty Anderson and Brian Ray, keyboard player Paul &ldquo;Wix&rdquo; Wickens, plus the larger than life drummer, Abe Laboriel, Jr. They know Paul&rsquo;s extensive back catalogue intimately and this is the first time they have recorded his songs with anyone else since they first started working together with Paul over 12 years ago.\n\nRalph then set about approaching the world&rsquo;s greatest performers to invite them to step forward and make their mark. This has been a labour of love, not only for Ralph but also for the artists who gave their time to be part of it. All have spoken of the importance of McCartney and his songwriting in their own careers and wanted to show their appreciation.\nA key strength of The Art Of McCartney is the way these world class artists have got to grips with the sheer range and quality of Paul&rsquo;s work. From his groundbreaking recordings with The Beatles, through to key moments with Wings and his solo compositions, they are all featured on the album.\n\nLegendary Beach Boy, Brian Wilson, was the first to take up the challenge. Undoubtedly he set the bar very high with his rendition of Wanderlust from the underrated 1982 album Tug Of War.\n\nThere are very few artists whose own work rivals The Beatles. So when producer Ralph Sall approached Bob Dylan to take part, he knew it was ambitious. Dylan&rsquo;s choice was Things We Said Today &ndash; a track from The Beatles&rsquo; soundtrack A Hard Days Night &ndash; and audiences will be captivated as he growls his way through his remarkable version.\nThere are so many great interpretations here but look out for Willie Nelson&rsquo;s heartfelt Yesterday, Roger Daltrey&rsquo;s frenzied version of Helter Skelter, B.B. King&rsquo;s atmospheric On The Way and The Cure&rsquo;s Hello Goodbye. Also Smokey Robinson who makes his version of So Bad from Paul&rsquo;s Pipes of Peace album his own, his tender vocals taking the song in a new direction.\nAll aspects of Paul&rsquo;s peerless back catalogue have been explored from The Beatles to his experimental early solo work, to Wings and his latter solo output. Lesser-known hidden classics such as Junk and Every Night are given a fresh outing and interpretation.\n\nThe lead off track from the album is The Cure&rsquo;s take on The Beatles classic &lsquo;Hello Goodbye&rsquo; which is the band&rsquo;s first release in 6 years and also features Sir Paul&rsquo;s son James on keyboards. The track is available for download now for those who pre-order The Art Of McCartney.\n\nWhether it is The Cure&rsquo;s Robert Smith, Corinne Bailey Rae, Smokey Robinson, Bob Dylan, Billy Joel or KISS, they each bring their own special talent to Paul&rsquo;s much-loved songs. In so doing, they have created versions that are both new and classic at the same time.\n\nThe Art of McCartney is the very definition of the universal appeal and timeless magic of Sir Paul McCartney&rsquo;s songs and songwriting.\nThe Art Of McCartney is an audiophile&rsquo;s dream. It is available in five beautifully packaged formats for the McCartney fan in your life. \n\nThe Art Of McCartney is available to pre-order now via The Art of McCartney Online Store, iTunes and Amazon.\n\nOfficial Website: http://www.theartofmccartney.com/\nFacebook: https://www.facebook.com/theartofmccartney\nTwitter: https://twitter.com/artofmc...\nInstagram: http://instagram.com/artofmccartney/\nYouTube: http://smarturl.it/SubscribeToTAOM\n"
]