[
"Lenny Kravitz\nNew Album Out September 23rd\n\nUpcoming TV Performances on: America&rsquo;s Got Talent, TODAY, &amp; The Late Show with David Letterman\n\nStream &lsquo;STRUT&rsquo; on iTunes Radio First Play: http://smarturl.it/lkstrutstream \n\nExclusive Lenny Kravitz &lsquo;STRUT&rsquo; Boxset ON SALE TODAY \n\nFour-time GRAMMY Award winner Lenny Kravitz&rsquo; tenth studio album 'Strut' is set to debut on September 23rd via Roxie Records/Kobalt Label Services. Pre-order Strut on iTunes:  http://smarturl.it/strutit\n\nIn conjunction with the release of the album, Kravitz will be making appearances on America&rsquo;s Got Talent (9/17), TODAY (9/22), and The Late Show with David Letterman (9/23). 'Strut' will be available to stream via iTunes Radio First Play prior to the release. Stream the entire album here: http://smarturl.it/lkstrutstream \n\nLenny Kravitz recently premiered the official music video for the track &ldquo;The Chamber,&rdquo; his debut single off of 'Strut'. Check it out: http://smarturl.it/thechambervd \n\nAdditionally, the album&rsquo;s twelve tracks&mdash;including such titles as &ldquo;New York City,&rdquo; &ldquo;I Never Want to Let You Down&rdquo; and &ldquo;She&rsquo;s a Beast&rdquo; &ndash; hit hard rhythmically and explore desire in all its forms, from the most physical to the most idealized. These songs wear their heart on their sleeve, and that&rsquo;s the way Kravitz intended it. He&rsquo;s had massive hits over the years and sold nearly forty million albums. Now is a perfect time to get to the heart of the matter. \nAn exclusive Lenny Kravitz 'Strut' Boxset is on sale TODAY, and will be available on December 9th. Pre-order the boxset here: http://smarturl.it/strutamzdeluxe \n\nThe limited edition collector&rsquo;s package will include: \n&bull;         &ldquo;THE MIAMI BEDROOM REHEARSALS&rdquo; 28-PAGE PHOTO BOOK\n&bull;         ORIGINAL &ldquo;DIRTY WHITE BOOTS&rdquo; POLAROID PERSONALLY PAINT-SPLATTEREDBY LENNY\n&bull;         2X SILVER, RED &amp; WHITE SPLATTER GATEFOLD HEAVYWIGHT 180-GRAM VINYL\n&bull;         FACSIMILE OF HANDWRITTEN &ldquo;STRUT&rdquo; LYRIC SHEET\n&bull;         12&rdquo;X12&rdquo; PHOTOGRAPHIC PRINT\n&bull;         HOUSED IN A LEATHER-LIKE FOIL EMBOSSED BOX \n&bull;         24x36 PSYCHEDELIC POSTER\n&bull;         FULL LENGH CD OF &ldquo;STRUT&rdquo; \n&bull;         EACH BOX NUMBERED IN EDITION\n\n \nRegarded as one of the preeminent rock musicians of our time, Lenny Kravitz has transcended genre, style, race and class into a 20-year musical career, one which revels in the rich influences of '60s and '70s soul, rock and funk. Kravitz&rsquo;s talents as a writer, producer and multi-instrumentalist have resonated now through ten studio albums into a timeless catalog. He has won four consecutive GRAMMY Awards, setting a record for the most wins in the &ldquo;Best Male Rock Vocal Performance&rdquo; category. Kravitz's most recent albums include the 20th anniversary deluxe edition of his debut, Let Love Rule, and his 2011 critically acclaimed studio release of Black and White America. Having sold over 38 million albums worldwide, Lenny Kravitz&rsquo;s musical success has afforded him many opportunities to fulfill his creative vision beyond the recording industry. The artist appeared in the critically-acclaimed film Precious, the box office smash films The Hunger Games and Catching Fire, as well as  Lee Daniels&rsquo; The Butler, alongside Forest Whitaker, Oprah Winfrey and Cuba Gooding Jr. In addition to his music and film work, in 2003 Kravitz launched a creative firm, Kravitz Design Inc., which provides commercial and residential design services, product development and branding. \nwww.lennykravitz.com \n\n"
]