[
"KOBALT NEWSWIRE -- As one of pop music&rsquo;s preeminent hit makers Ryan Tedder can do it all: write brilliant songs, produce dazzling tracks, and create magic with his instantly identifiable voice. First emerging as the lead vocalist for the band OneRepublic, Tedder has artfully augmented his career as the band&rsquo;s front man with songwriting and production projects for a spectrum of top artists and projects.\n \nTedder is a six-time Grammy nominee with a 2009 nod for Record of the Year for Leona Lewis' &quot;Bleeding Love.&rdquo; In 2010, he received two nominations: Record of the Year for &quot;Halo&quot; and Album of the Year for I Am...Sasha Fierce, both by Beyonce. This year, in addition to a nomination for Producer of the Year, he was presented with a Grammy for his work with Adele for her album, 21. OneRepublic secured a nomination in 2009 in the Best Pop Performance by a Duo or Group with Vocals category for the song &quot;Apologize.&quot;\n \nTedder&rsquo;s impact is global, with recent activities including songs in film and television shows, film trailers, advertising campaigns and promos in multiple international territories. As a Kobalt client, he can optimize the company's creative worldwide staff.\n \n&ldquo;The new frontier is licensing and syncs,&rdquo; Tedder told Billboard magazine in a recent feature. &ldquo;You look at the breakdown of a song and you&rsquo;re like, 'Whoa, 30% or 40% of what I made on this came from licensing. How did that happen?&rsquo; I&rsquo;ve just started seeing that in the last two of three years. For new writers,  that is something they should focus on. When you&rsquo;re pursuing a publishing deal, don&rsquo;t think you have to sign that deal and then immediately go write Usher&rsquo;s next single.&rdquo;\n \nTedder has experienced a tremendous amount of success with film &amp; TV synchs, whereas a few years ago, writers may not have seen such success in that light. Major synchs have included the use of &ldquo;Brighter Than The Sun&rdquo; in the trailer for the film, The Help and use in all X Factor, American Idol, and The Voice television shows. Globally, Tedder has also had major recent synchs in the UK, Italy, Spain, Germany and Turkey procured by Kobalt&rsquo;s Synch staff. His songs have been prominent in feature films including Abduction, Precious and Crazy Stupid Love. Television placements include Glee, Smash, plus multiple network promos and commercials for G.E, Fisher-Price, and Disney Theme Parks. \n \nKobalt&rsquo;s powerhouse Nashville office is an additional resource: Crossing over to country, with introductions by Kobalt, Tedder co-wrote &ldquo;Good in Goodbye,&rdquo; with superstar Carrie Underwood for her latest full length, Blown Away, and he is also writing with members of Lady Antebellum. In London, Kobalt's UK team helped organize his collaborations with Adele, which led to his two songs &quot;Rumor Has It &quot; and &quot;Turning Tables&quot; becoming cuts on 21. Other recent credits include writing &ldquo;Love Somebody&rdquo; for Maroon 5; &ldquo;Hurt Me Tomorrow&rdquo; for K'naan; the cuts &ldquo;Not Over You&quot; and &quot;Sweeter&quot; for Gavin Degraw; &quot;Calling (Lose My Mind)&quot; by Alesso and Swedish House Mafia's Sebastian Insgrosso; co-writing &ldquo;Satellite&rdquo; by the Brit pop phenomenon, The Wanted, for their eponymous U.S. debut EP; and multiple tracks for B.o.B&rsquo;s Strange Clouds.\n \nIn 2009, Tedder launched his own record company, Patriot Records, and Patriot Games Publishing, a joint venture with Kobalt. Patriot Games Publishing writer Noel Zancanella has had recent major success with Gym Class Heroes. With these enterprises, Tedder plans to accelerate the careers of the next generation of music creators from around the world."
]