[
"Kobalt Music Group is thrilled to announce the signing of a services agreement with UK independent label, publishing, and management company Marathon Artists. \n    \nUnder the terms of the agreement, Kobalt Label Services will provide international representation, multi-territory physical distribution, digital distribution and sales as well as marketing services to Marathon Artists&rsquo; label roster in the UK and Europe. \n\nKobalt Music Publishing, meanwhile, will administer and provide publishing services and synchronization licensing services worldwide to Marathon&rsquo;s growing publishing roster, which includes most of the artists signed to the label.\n\nFounded in 2012 by Jimmy Mikaoui, Philippe Ascoli and Paul-Rene Albertini in London, Marathon Artists has rapidly become one of the prominent independent labels and new publishing companies to emerge out of the UK, with an exciting roster of new talent across all music genres, with hotly tipped new artists such as Jagwar Ma, Courtney Barnett, We Are Shining and Max Jury.\n\nThe first release under the new agreement will be &ldquo;KARA&rdquo;, the debut album by London based group We Are Shining, on October 27, to be followed by debut full lengths by Courtney Barnett, Elliott Power and Southern in the New Year.\n\nSaid Vincent Clery-Melin, Kobalt Label Services UK Managing Director, of the partnership: &ldquo;We are incredibly excited to be working with Marathon Artists. They are simply the most exciting new independent label around, and their music taste and aesthetic are as impeccable as the commercial potential of their artists is undeniable. This also represents a significant move and commitment for Kobalt Label Services to work with developing talent in the UK and Europe. We can&rsquo;t wait to get started!&rdquo;\n\nNick Robinson, Senior VP Business Development at Kobalt Music Publishing, added: &quot;We're really pleased to be working with Philippe, Jimmy and all the Marathon staff.\nThe combination of their vast experience at developing new artists along with the administrative skills of our worldwide publishing teams will help fully realise the huge potential of their eclectic and very exciting young roster.&quot;\n\nPhilippe Ascoli, Chief Creative Officer at Marathon Artists said : &ldquo;We are all thrilled at Marathon to be heading into a partnership with Kobalt Label Services. I&rsquo;ve known Vincent for years, having worked with him in the past, and am very excited at the prospect of working together once again. I look forward to working with the teams at Kobalt Publishing &amp; at KLS in this important time in the development of Marathon Artists, and knowing that both Kobalt &amp; Marathon have a united vision makes us feel very confident indeed.&quot;\n"
]