[
"Kobalt Neighbouring Rights (KNR) has added a wealth of musical talent to its roster by signing international hit-maker Pitbull, the UK&rsquo;s London Grammar, Jess Glynne and Frightened Rabbit, and German rapper Cro for the collection of neighbouring rights income.\n \nGrammy-winning rapper and record producer Pitbull has notched up number #1 hits in more than 15 countries, and together with Jennifer Lopez and Claudia Leitte, performed the official FIFA 2014 World Cup anthem &quot;We Are One (Ole Ola)&quot;. Joining him is Germany&rsquo;s most commercially successful rapper, Cro, who fuses striking rap rhythms with catchy pop melodies to great success having already struck four platinum-selling singles.\n \nAlso joining KNR are a trio of acts from across the UK. One of the most exciting international breakthroughs in recent years, London Grammar have taken home numerous awards already this year, including an Ivor Novello for the &lsquo;Best Song Musically and Lyrically&rsquo;, a BRIT nomination for &lsquo;Best Breakthrough Act&rsquo; and two AIM awards for &lsquo;Independent Breakthrough&rsquo; and &lsquo;PPL Most Played New Independent Act&rsquo;. \n \nDominating the UK airwaves with the most airplay of any artist so far this year, singer-songwriter Jess Glynne recently scored a Best Newcomer nomination at the forthcoming Mobo awards, whilst renowned live performers Frightened Rabbit enjoyed Top Ten success with their latest effort, 2013&rsquo;s &lsquo;Pedestrian Verse&rsquo;.\n \nAnn Tausis, Managing Director of Kobalt Neighbouring Rights said: &ldquo;I&rsquo;m proud to welcome these hugely talented artists to our roster. Like all our clients, they will benefit from our expertise, technology and relationships with collecting societies to maximise their earnings and timeliness of payment in this complex area.&rdquo;\n \nThe new signings follow Kobalt Music Group&rsquo;s recent website refresh, emphasising the simplicity and transparency of the company&rsquo;s technological approach. The launch video entitled &ldquo;The Future of Music Really Is This Simple&rdquo; can be seen here http://www.kobaltmusic.com/?auto\n \n"
]