[
"The Waterboys will release a brand new album entitled Modern Blues on Harlequin And Clown, via Kobalt Label Services on January 19, 2015.  Recorded in Nashville, produced by Waterboys leader Mike Scott and mixed by Bob Clearmountain, Modern Blues contains nine passionate new songs, evoking the very best of the band&rsquo;s past work while forging forth to explore new ground.  \n\nThe Waterboys will launch the album with two concerts as follows:\nMon Feb 2, 2015    Coventry, Warwick Arts Centre \nTues Feb 3, 2015    London Roundhouse \n(Tickets on sale Fri Oct 10)\n\n\nThe decision to record in the United States proved catalytic to the album&rsquo;s swaggering sound and spirit. &ldquo;People should expect the unexpected from The Waterboys,&rdquo; says Mike Scott, a grin in his voice. It&rsquo;s a mission statement which has inspired three decades of compelling musical shape-shifting, and one which yields thrilling results on The Waterboys&rsquo; magnificent eleventh album. \n\nModern Blues is an electric, eclectic, soulful, bold and gloriously freewheeling rock'n'roll record, arriving at a time when the relevance and popular reach of The Waterboys has never been greater. In 2013 Ellie Goulding scored a top 3 UK hit with their &ldquo;How Long Will I Love You&rdquo; and earlier this year Prince performed &ldquo;The Whole of the Moon&rdquo; solo at the piano during his Hit + Run show at Ronnie Scott&rsquo;s in London, while the same song was performed by finalist Sally Barker on primetime BBC 1 show The Voice. In recent times &ldquo;A Pagan Place&rdquo; has become a live staple for hot US indie band The War on Drugs and Waterboys&rsquo; songs have been used in movies like About Time, Dom Hemingway and What We Did On Our Holiday. \n\nScott entered the studio intent on harnessing the rolling, spontaneous energy that fuelled some of The Waterboys&rsquo; greatest albums. &ldquo;I set out to make a record with an ensemble playing live, to get that performance spirit. It&rsquo;s how I recorded Fisherman&rsquo;s Blues.&rdquo;  To that end, he corralled old hands and new friends. Ralph Salmins, a mainstay on drums for the past four years, appears alongside Scott and talismanic Waterboy Steve Wickham, who weaves a dizzying fuzz fiddle spell on several tracks of Modern Blues. Fresh to the ranks are Memphis keyboard player &ldquo;Brother&rdquo; Paul Brown, and David Hood, legendary bassist from the heyday of FAME studios and Muscle Shoals. &ldquo;I&rsquo;ve got the man who played on &ldquo;R-E-S-P-E-C-T&rdquo; on bass!&rdquo; Scott laughs. &ldquo;He and Paul had a huge impact on the sound.&rdquo; \n\nAsked why he chose to record in Nashville, Scott (who lives mostly in Dublin) explained, &ldquo;Nashville has a reputation as Music City, USA and I fancied some of that. It&rsquo;s one of the few cities that still has a recording studio industry intact, which brings the spur of competition. I know that across town Jack White's making a record, The Black Keys are making theirs.  I like that competitive feeling, it&rsquo;s exciting. It's a spur.&rdquo;\n\nIn true Waterboys&rsquo; style, a spirit of exploration defines the album. Few bands have changed as much as this one. Formed in 1983, on their first three albums The Waterboys sculpted a layered post-punk sound, culminating in 1985&rsquo;s sky-scraping This is the Sea. Since then the music has never ceased to evolve, from the hugely influential mix of Celtic folk, gospel, country and rock on the classic Fisherman&rsquo;s Blues, to the New York guitar sounds of Dream Harder, the agitated Millennial sonic exploration of A Rock in the Weary Land, and the fired-up poetic passion of An Appointment with Mr Yeats. Having emerged from what Scott calls a &ldquo;rootless&rdquo; period, the band returned to their potent, poetic best on An Appointment with Mr Yeats, an album of fourteen W.B. Yeats poems set to rapturous rock music. Released in 2011, the record and tour were widely acclaimed as a career peak.  That was followed in 2013 by Fisherman&rsquo;s Box, an astonishing seven-disc collation of The Waterboys&rsquo; epic Irish sessions between 1986 and 1988, released to celebrate the 25th anniversary of Fisherman&rsquo;s Blues. \n\nTrack listing:\nDestinies Entwined\nNovember Tale\nStill A Freak\nI Can See Elvis\nThe Girl Who Slept For Scotland\nRosalind You Married  The Wrong Girl\nBeautiful Now\nNearest Thing To Hip\nLong Strange Golden Road\n"
]