[
"&quot;This place is pretty cool,&quot; says Julian Casablancas. It's a late-summer evening, and the 36-year-old Strokes frontman is browsing through a volunteer-run radical bookstore a few blocks from his Lower East Side apartment. There's a pet white rat perched on the shoulder of the spiky-haired woman near the checkout counter, and Jimmy Cliff is on the stereo. Casablancas is leafing through a copy of Noam Chomsky's How the World Works, then notices a book about CBGB, the historic punk club that closed in 2006. &quot;We were about to play 'Modern Age' for the first time, and the sound guy shut us off,&quot; he says, recalling an early Strokes show from 2000. &quot;They were such dicks. I mean, the place is obviously legendary, but I didn't cry for it when it closed. I'm like, 'Just open one in Times Square.'&quot;\n\nThe Strokes' days as a club act didn't last long: The year after that CBGB gig, Casablancas' band would reinvigorate New York rock with its debut, Is This It, and pave the way for a generation of rockers from the Black Keys to the Arctic Monkeys. (&quot;They opened doors for us, because we started getting booked into clubs for being a garage-rock band,&quot; says the Keys' Dan Auerbach.) Casablancas would become famous as the deadpan, elegantly wasted personification of New York cool. These days, though, he's the sober, married father of a four-year-old boy, Cal, and spends most of his time at his home in upstate New York. When he stays up late, he might be jotting down passages from Howard Zinn's A People's History of the United States or checking out lefty websites like Truthout and Truthdig. &quot;Anything with the word 'truth' in it, I'm good,&quot; he says with a self-aware smile.\n\nHe's also just completed a new solo record, Tyranny, released on his own label, on which he's backed by a band called the Voidz. The album is musically dense and politically charged. It's a far cry from the Strokes' sharp tunes, and Casablancas is clearly OK with that. &quot;This is the final destination &ndash; this record is what I've been wanting to make since the first record,&quot; he says, referring to his debut solo LP, Phrazes for the Young. &quot;If anything, I'm just hungry to try to inspire something as big if not bigger [than the Strokes], but with more meaning. You know? Especially now that I'm a little older.&quot;\n\nRead the full article here: http://www.rollingstone.com/music/features/julian-casablancas-radical-reinvention-20141015#ixzz3GKbL77pj"
]