[
"Kobalt Music Publishing, a division of Kobalt Music Group, today announced the appointment of Jamie McLaughlin to the position of Creative Director. \n\nAs a member of Kobalt&rsquo;s Global Creative team, McLaughlin will be responsible for signing new talent, arranging writer collaborations for the company&rsquo;s creative roster and  pitching songs.  Since joining Kobalt, she has already participated in the signing of DJ White Shadow (real name: Paul Blair), who has collaborated with Lady Gaga on her last two studio albums, Born This Way (2011) and ARTPOP (2013).\n\nBased in Los Angeles, McLaughlin will report to Kobalt&rsquo;s President, Global Creative Sas Metcalfe and GM of Creative and Acquisitions Sue Drew. \n\n&ldquo;I am excited to welcome Jamie to the Kobalt family,&rdquo; said Sue Drew. &ldquo;She is the perfect addition to our creative team with her enthusiasm and respect from the songwriting community.&rdquo;\n\nMost recently, McLaughlin served as Director of Creative Services, Pop/Rock at ASCAP, where she signed such artists as Big Sean and HAIM. Prior to that, she spent three years as the Executive Assistant to Roc Nation Co-founder and President Jay Brown, assisting day-to-day management duties for clients along with their writer and producer roster. McLaughlin started her career as a promotions assistant at Epic Records in 2007. She attended William Paterson University in Wayne, New Jersey, where she studied the music business.\n\nIn a further representation of Kobalt Music Publishing&rsquo;s ongoing investment in the expansion and development of its creative services, the company has also promoted Anna Schlafer and Amanda Samii to the position of Creative Manager.\n\nIn their new roles, Schlafer and Samii will work with Kobalt&rsquo;s Creative team in pitching songs and setting up collaborations for existing clients, as well as identifying new talent. They are both based in Los Angeles and report to Kobalt&rsquo;s Sas Metcalfe and Sue Drew.\n\nSchlafer, who has been with Kobalt for six-and-a-half years, formerly served as an assistant to Kobalt Founder and CEO Willard Ahdritz, and has held other roles assisting the company&rsquo;s Synchronization and Creative teams. During her three years with Kobalt, Samii has held the role of assistant to Executive VP, Head of Creative &ndash; West Coast Benjamin Groff and was later promoted to Creative Coordinator for Sas Metcalfe. \n\n&ldquo;Anna and Amanda have proven themselves stellar Kobalt employees and it is always a pleasure to promote from within,&rdquo; said Sue Drew. \n"
]