[
"Kobalt, the leading global music publishing and music services company for artists, songwriters, labels and publishers, will tomorrow announce a milestone in the growth of streaming revenues: its writers&rsquo; European earnings from Spotify have overtaken those from iTunes. \n\nKobalt represents 6,000+ songwriters and artists, comprising half of this weeks Top 10 Billboard songs and albums and the top three albums in the Official UK Album Chart.\n\nKeynoting at the Web Summit in Dublin tomorrow, Kobalt founder and CEO Willard Ahdritz will reveal the news and explain that royalties collected from Spotify&rsquo;s streaming service in Q1 2014 were 13% higher than those from the iTunes download store. \n\nBy comparison, Kobalt writers&rsquo; earnings over the two previous quarters showed European iTunes publishing income 32% higher than that for Spotify in Q3 2013, with the gap shrinking to 8% in Q4 2013. \n\nGraph 1: http://bit.ly/1x3bzGB\n\nDuring this nine-month period from Q3 2013 to Q1 2014, Kobalt saw 5% growth of combined iTunes and Spotify publishing revenues in Europe. \n\n\nStreaming Revenues Continue To Grow Globally\n\nOn a global level, streaming revenues for Kobalt writers tripled over the past two years, accounting for 10% of overall global publishing income in Q2 2014. This includes subscription services, YouTube, Internet radio and royalties from live performances of compositions, radio performance and those from CDs and concert DVDs. The share of publishing income made up by streaming has grown steadily, trebling since Q4 2011, when it was 3%. \n\nGraph 2: http://bit.ly/1x3bq5O\n\nThe findings highlight a seismic shift taking place in the recordings business, in which the access model of music consumption is on its way to overtaking the ownership one. Moreover, it demonstrates that streaming can prove a viable business model when tracked and collected on properly.\n\nAhdritz will also explain that through its technology and results-oriented business model, Kobalt is also able to collect more revenue, on average securing 30% higher revenues than other publishers for exploitation of the same work. \n\n&ldquo;Kobalt is changing the future of music. Our unique model and our technology allow us to embrace streaming because our clients know they will be paid - and with total transparency!&rdquo; said Willard Ahdritz, founder and CEO of Kobalt. &ldquo;Spotify overtaking iTunes in Europe is an important new milestone in streaming. What Kobalt offers to artists, songwriters, and publishers has become more important than ever as the music industry&rsquo;s infrastructure is failing them, unable to efficiently account for the enormous volumes of data from digital transactions. We are fixing those clogged pipes and, for Kobalt clients, the money is flowing. Andy happy music creators means the whole ecosystem will flourish.&rdquo;\nAhdritz will present the findings during his Web Summit keynote: &ldquo;How is publishing evolving and where is the artist in all this?&rdquo; on Thursday 6th November.  He will be tweeting throughout the conference at @WillardAhdritz and @Kobalt.\n"
]