[
"In 2009 the freakishly captivating rave rap duo Die Antwoord (Afrikaans for &ldquo;The Answer&rdquo;) consisting of NINJA and &yen;O-LANDI VI$$ER burst onto the international scene out of the deep dark depths of South Africa and introduced Zef culture into the pop culture lexicon.  Five years, two albums and hundreds of millions of video views later, they unleashed their third full-length studio album DONKER MAG from their own label ZEF RECORDZ on June 3rd.\n\nToday, Die Antwoord released their stunning new video for DONKER MAG track, &ldquo;Ugly Boy.&rdquo;  Directed by NINJA, &quot;Ugly Boy&quot; features myriad of cameos including Jack Black, Marilyn Manson, Flea, Dita Von Teese, The ATL twins, and Cara Delevingne.\n\n&quot;Ugly Boy&quot; is the second video from their most recent album-- a follow up to the release of the hypnotically vexing video for &quot;Pitbull Terrier.&quot;   Between the two video projects, Die Antwoord coursed through Europe and North America selling out headline dates and owning festival stages on both continents.\n\nThe macabre and addictive nature of their video projects cannot be understated.  Their initial explosion onto the world&rsquo;s music stage came to pass when early video releases of &ldquo;ZEFSIDE&rdquo; and &ldquo;Enter The Ninja&rdquo; from debut album $O$ racked up views in the tens of millions and was met with innate fascination from press and fans alike.   As that fascination evolved into hunger, major record labels scrambled to sign them, eventually penning a million dollar deal with Interscope.  Refusing to allow message to become compartmentalized, Die Antwoord outspokenly broke off from their label deal and created ZEF RECORDZ in which they released their sophomore album TEN$ION in 2012.\n\nIn explanation of Zef, a term which roughly translates to &ldquo;common&rdquo; and refers to the lower-middle class counterculture of South Africa, &yen;O-LANDI VI$$ER says &quot;It's associated with people who soup their cars up and rock gold and shit. Zef is, you're poor but you're fancy. You're poor but you're sexy, you've got style.&quot;\n\nWatch the Video Here:\nhttps://www.youtube.com/watch?v=uMK0prafzw0\n\n\n\nDie Antwoord - DONKER MAG\n\nTrack Listing\n\n1     Dont Fuk Me\n2     Ugly Boy\n3     Happy Go Sucky Fucky\n4     Zars\n5     Raging Zef Boner\n6     Pompie\n7     Cookie Thumper!\n8     Girl I Want 2 Eat U\n9     Pitbull Terrier\n10   Strunk\n11   Do Not Fuk Wif Da Kid\n12   Rat Trap 666 (featuring DJ Muggs)\n13   I Dont Dwank\n14   Sex\n15   Moon Love\n16   Donker Mag\n\n\nComplete International Tour Dates:\n\n \nJan 14 &ndash; ABC - Glasgow, UK\nJan 15 &ndash; Birmingham Institute - Birmingham, UK\nJan 16 &ndash; Albert Hall - Manchester, UK\nJan 17 &ndash; Brixton Academy - London, UK\nJan 19 &ndash; Live Music Hall - Cologne, Germany\nJan 20 &ndash; X-tra - Zurich, Switzerland\nJan 21 &ndash; Tonhalle - Munich, Germany\nJan 23 &ndash; Columbiahalle - Berlin, Germany\nJan 24 &ndash; Lotto Arena - Antwerp, Belgium\nJan 25 &ndash; Rockhal - Luxembourg\nJan 26 &ndash; Batschkapp - Frankfurt, Germany\nJan 28 &ndash; Zenith - Paris, France\nJan 29 &ndash; Heineken Music Hall - Amsterdam, Holland\nJan 31 &ndash; Stadium Live - Moscow, Russia\nFeb 1 &ndash; A2 - St Petersburg, Russia\nMar 1 &ndash; Future Music Festival - Perth, Australia\nMar 7 &ndash; Future Music Festival - Brisbane, Australia\nMar 8 &ndash; Future Music Festival - Melbourne, Australia\nMar 9 &ndash; Future Music Festival - Adelaide, Australia"
]