[
"Kobalt, the leading global music publishing and music services company, has expanded its award-winning Kobalt Portal to deliver ultimate transparency to all of its clients, creating the world's first integrated data insights tool for artists, labels, publishers and songwriters to track their music, royalties and more globally in real-time.\n\nNow accessible to Kobalt Label Services (KLS), clients can view their statements and catalogue information and compare sales, streams and views from Spotify, YouTube and iTunes in real-time through the Digital Sales Tracker. The Kobalt Portal enables detailed analysis of global revenue by various criteria such as territory or income type according to whichever time frame the artist chooses. Furthermore, clients can track views and earnings for top YouTube user-generated and partner-provided content and watch the associated videos.\n\nIn addition, the publishing section of the Portal has received a significant upgrade with writers now able to view digital collection data from Spotify, YouTube and iTunes in real-time for total transparency.\n\nDepending on which of their rights are being administered by Kobalt, clients can use the Portal to move seamlessly between neighbouring rights, label services and publishing data for a 360 degree view on their income.\n\nIncorporating an array of features and user-friendly analysis tools, the Kobalt Portal makes it easy for neighbouring rights, publishing and label services clients alike to review and understand all income streams, from physical sales to downloads, streaming to performance royalties. All such account activity is brought together in a customisable, global, real-time feed for quick access and overview.\n\nKLS and publishing clients can also use the Kobalt Portal to follow the Synch pipeline at every stage of the licensing process. Publishing clients can additionally take out advances on their income through the Portal.\n\nWillard Ahdritz, founder and CEO of Kobalt said: &ldquo;This is another giant step toward creating an industry platform that offers a more transparent future for artists, songwriters and publishers around the world. The incorporation of label services as a third strand of the Kobalt Portal completes its transition into the world&rsquo;s first fully comprehensive rights tool.  With one hit song today creating billions of transactions, our Portal offers an unparalleled level of transparency, enabling Kobalt clients to understand what is happening with their music throughout the global market.&rdquo;\n\nThe advanced nature of the Kobalt Portal continues to be recognised throughout the industry, most recently at the Music Ally Digital Music Awards (UK) where Kobalt took home the &ldquo;Innovation in Publishing&rdquo; award for the Kobalt Portal. \n\nA launch video for the enhanced portal entitled &ldquo;All Your Data, Working For You&rdquo; can be seen here: http://smarturl.it/kobaltportal\n\nMedia Contact:\nBeth Cleveland\nMob:+1 415 283 7333\nE-mail: kobalt@praytellstrategy.com \n\nSam Shemtob\nMob: +44 79 5722 7183\nE-mail: sam@namepr.co.uk\n\n"
]