[
"Today, British trio Until The Ribbon Breaks premiered their brand new video from their new single &ldquo;Revolution Indifference&rdquo; featuring Run The Jewels. The video premiered on pitchfork.com \n \n&ldquo;Revolution Indifference&rdquo; featuring Run The Jewels is the new single taken from the band&rsquo;s highly anticipated forthcoming debut album &ldquo;A Lesson Unlearnt&rdquo; which is scheduled for worldwide release on January 20th 2015, just in time for the start of their North American tour with fellow trailblazing Brits London Grammar. \n \nThe video for &ldquo;Revolution Indifference&rdquo; ft Run The Jewels was co-directed by the band&rsquo;s front man, producer and chief lyricist Pete Lawrie-Winfield and friend Storme Whitby-Grubb in Los Angeles.  &ldquo;Revolution Indifference is about all of us hurtling towards complete apathy, and eventual total collapse, generic smartphone in tow.&rdquo; Pete told pitchfork.com who premiered the powerful new video today &ldquo;We are a strange breed sometimes. Pocket sized personal computers permanently stuck to our thumbs. We swipe left, right, eyes down, seemingly entirely indifferent to the world outside our own social networks.&rdquo;\n \n&ldquo;Revolution Indifference&rdquo; ft. Run The Jewels will be available via iTunes, Amazon and Spotify on 11/4/2015\n\n\n&quot;A LESSON UNLEARNT&quot;\n1. The Other Ones (Intro)\n2. Orca \n3. A Taste Of Silver\n4. Romeo\n5. Perspective (Feat Homeboy Sandman)\n6. Spark \n7. Revolution Indifference (Feat Run The Jewels)\n8. Persia \n9. Pressure \n10. Goldfish\n11. Until The Ribbon Breaks\n\n\n\nNORTH AMERICAN TOUR DATES WITH LONDON GRAMMAR\n01/21 &ndash; Sound Academy &ndash; Toronto, Canada 01/23 &ndash; Olympia &ndash; Montreal, Canada (upgraded from Club Soda)*\n01/24 &ndash; State Theatre &ndash; Portland, ME (upgraded from Port City Music Hall)*\n01/26 &ndash; House of Blues &ndash; Boston, MA*\n01/27 &ndash; Terminal 5 &ndash; New York, NY*\n01/29 &ndash; 9:30 Club &ndash; Washington, DC*\n01/30 &ndash; Electric Factory &ndash; Philadelphia, PA*\n02/02 &ndash; Deluxe @ Old National Centre &ndash; Indianapolis, IN*\n02/03 &ndash; First Avenue &ndash; Minneapolis, MN*\n02/06 &ndash; Roseland Theatre &ndash; Portland, OR*\n02/07 &ndash; The Fox Theatre &ndash; Oakland, CA*\n"
]