[
"Berklee College of Music and Kobalt Music Group today announce an innovative collaboration for driving growth in the new music industry. Kobalt is providing a two-year grant for Berklee&rsquo;s Rethink Music initiative to continue its series of global events and fund a student study in conjunction with Berklee&rsquo;s newly formed Institute for Creative Entrepreneurship. The student-led project will review the ways technology and transparency can help address global music licensing issues and bring artists, writers, publishers, labels and distributors closer together. \n\nAdditionally, in an effort to support up-and-coming songwriters, Kobalt is providing a $10,000 merit-based scholarship annually to songwriting majors at Berklee. The Kobalt Scholarship will be named after various Kobalt songwriters each year.  \n\n&ldquo;We are extremely excited and grateful to be working with Kobalt. Kobalt is well known as a leader and forward-thinking company in the music space, and this partnership will allow us to continue to pursue our goal of fostering the new music industry,&rdquo; said Allen Bargfrede, executive director of Rethink Music for Berklee College of Music. &ldquo;Through our project work in the coming months on technology and transparency, and via our entrepreneurship events, we expect outputs which will both alter the space and create opportunities for Berklee students.&rdquo;\n\nWillard Ahdritz, founder and CEO of Kobalt said, &ldquo;We are thrilled to be working together with this prestigious school and their outstanding young students. They are our future! The motives and objectives of Berklee&rsquo;s Rethink initiative align closely with our own at Kobalt, and I&rsquo;m confident that the work we are doing together will produce direction and solutions that will help shape the music industry of the future.&rdquo;\n\nBerklee&rsquo;s Rethink Music began in 2010, and in collaboration with academic partners at Harvard Law School, Babson College and IE Business School, the program fosters dialogue and ideas for the new music industry. Rethink maintains its strong affiliation with Midem, the annual music industry trade conference in Cannes, France, and will continue its search for the next music business entrepreneurs and creators through a series of events in 2014-2015, including its annual Venture Day in Berlin, which has quickly become one of the largest events in Europe focused on music entrepreneurship.\n\nRethink Music is expanding its reach this year, with the global licensing research project led by BerkleeICE&rsquo;s research lab which is seeking to work closely with other universities including Harvard&rsquo;s Berkman Center for Internet and Society and MIT&rsquo;s School of Engineering. Kobalt is supporting the initiative by providing anonymized publishing data, allowing researchers to better understand revenue sources, royalty matching and licensing terms. \n\n&ldquo;We&rsquo;re very appreciative for Kobalt&rsquo;s support&rdquo; said Panos Panay, Founding Managing Director of Berklee&rsquo;s Institute for Creative Entrepreneurship. &ldquo;Our mission is to foster entrepreneurial thinking, disruptive ideas and innovation through cross-discipline collaboration. Tackling the complexity of music licensing issues - with perspectives from various universities - should prove very insightful and can help inform the future of the music industry.&rdquo; \n\n\nFor further information, please contact:\n\nBerklee College of Music:\nAllen Bush\nDirector of Media Relations \nTel: +1 617 747 2658\nMob:+1 617 529 7303\nE-mail: abush@berklee.edu\n\nKobalt:\nBeth Cleveland\nMob:+1 415 283 7333\nE-mail: kobalt@praytellstrategy.com \n"
]