[
"Willard Ahdritz is staring intently into my eyes.  His wrist perches unnervingly close to my forearm, his fingers gently patting my elbow.\n\nHe nods with reassuring deference. &ldquo;I love your music,&rdquo; he says with a soft, sincere burr. &ldquo;That&rsquo;s all that matters, Tim. Your music is sensational.&rdquo;\n\nAhdritz&rsquo;s playful advances are uncomfortably conspicuous within the prim breakfast hall of west London&rsquo;s Millennium Mayfair Hotel. This is evidence of two things: first, that the Swedish-born exec cares little for stuffy business-like etiquette when making points he feels essential; and second, how sincerely angry he feels about the slight-of-hand deal-making that&rsquo;s screwed creators within the record and publishing industries over the past century. \n\nAhdritz&rsquo;s charm offensive, you realise, is a caricature; he is lampooning self-serving fat cats, an executive strain he worries is still dominant in music - and that&rsquo;s gradually choking this industry to death. \n\n&ldquo;Your songs are magic,&rdquo; he continues, building up to his carefully considered kiss-off: &ldquo;What does money, royalties have to do with this? Nothing. Let me take care of all that boring stuff.&rdquo;\n\nKobalt&rsquo;s very business model is predicated on being the antithesis to Ahdritz&rsquo;s crooked stooge - helping artists and songwriters get open access to every detail of &ldquo;the boring stuff&rdquo; and understanding why they&rsquo;ve been paid what, when. \n\nThe company, founded in 2000, believes that commercial power will increasingly migrate into the hands of artists and songwriters in the next few years - and that they will use it to seek out &ldquo;transparency, flexibility and ownership&rdquo; from their industry partners. \n\nKobalt offers notoriously generous revenue splits to its clients, but rarely pays out big advances. Instead its gives creators the chance to own their copyrights, while picking from a menu of services that includes online global copyright administration, sync, A&amp;R, digital collections, label services and neighbouring rights management.\n\nAhdritz professes that the reporting and collection mechanisms at major publishers and labels are under-performing and opaque, and that Kobalt&rsquo;s setup is simply more efficient. He claims that writers at big publishers sometimes receive royalties 24 months after they should - and that they are forced to pay 50% or more of their gross royalties to &lsquo;intermediaries&rsquo; like collection societies. \n\nThis, says Ahdritz, is unfair on the most important parties in the music business. Well, what he actually says - in vernacular refreshingly unpolluted by copyright double-speak - is that he&rsquo;s &ldquo;sick and tired of the bullshit&rdquo;.\n\nHe rubs his temples. &ldquo;If people were focused on building a great industry, we would have a great industry,&rdquo; he snaps. &ldquo;We do not. The current back-end structures are not prepared for the new digital business. The pipes are broken.&rdquo;\n\n\nRead the full article here:\nhttp://www.musicweek.com/news/read/kobalt-s-willard-ahdritz-the-music-industry-is-suffering-from-a-slow-death/060197"
]