[
"Kobalt Music Publishing is welcoming the return of country music hit writer, producer and ACM Songwriter of the Year 2014 Shane McAnally, after completing a new worldwide admin and creative services deal with the songwriter and his publishing company SMACKSongs.\n\nThe deal covers all new works written from July 1, 2014. It also encompasses McAnally&rsquo;s works from 2009 to 2012, which have been with Kobalt since inception as the result of an earlier admin deal, a period during which he penned the #1 singles (Billboard Hot Country Songs) &lsquo;Somewhere With You&rsquo; (Kenny Chesney), &lsquo;Alone With You&rsquo; (Jake Owen), &lsquo;Kiss Tomorrow Goodbye&rsquo; (Luke Bryan), &lsquo;Downtown&rsquo; (Lady Antebellum) and &lsquo;Mama&rsquo;s Broken Heart&rsquo; (Miranda Lambert), as well as hits by Lee Ann Womack (&lsquo;Last Call&rsquo;), Chris Young (&lsquo;Neon&rsquo;) and Love &amp; Theft (&lsquo;Running Out Of Air&rsquo;).\n\nAdditionally, the agreement covers all works from McAnally&rsquo;s publishing company SMACKSongs. SMACKSongs currently represents Matthew Ramsey (Dierks Bentley, Kenny Chesney, Luke Bryan), Matt McGinn (Jake Owen, Joey Hyde) and Jo Eldridge (Billy Ray Cyrus) with an eye on developing future talent, as well as partnering with established songwriters. SMACKSongs is helmed by Michael Baum along with a creative team that includes industry veteran Robin Palmer and Creative Manager Robert Carlton.\n\nMcAnally is a multiple Grammy Award winning country music singer, songwriter and producer. He co-produced Kacey Musgraves&rsquo; Grammy Award winning debut album (Best Country Album), Same Trailer, Different Park, with her and fellow songwriter Luke Laird. He also co-wrote nine of the album's twelve tracks including &lsquo;Merry Go 'Round&rsquo;, which won him the 2014 Grammy Award for Country Song of the Year. Furthermore, McAnally took home the 2014 Country Music Association's (CMA) Song of the Year for &lsquo;Follow Your Arrow&rsquo;, which is taken from the same album. This is in addition to being named Songwriter of the Year (2014) by the Academy of Country Music (ACM).\n\nOther credits include co-producer and co-writer of Sam Hunt&rsquo;s debut album for MCA Records/Universal Music Group, including the recent #1 single, &lsquo;Leave The Night On&rsquo;. McAnally is currently working on original music for a major Broadway musical inspired by the iconic TV show &ldquo;Hee Haw&rdquo; with fellow collaborator and artist Brandy Clark. He&rsquo;s also working on Kacey Musgraves&rsquo; follow up album. \n\nShane McAnally said of the deal: &ldquo;Kobalt's model is one that is often imitated, but has yet to be perfected by anyone else. The combination of their incredible creative team along with the accuracy and reach of their collection methods, make them an undeniable perfect partner for me and the Smack family. We are all very excited to be working together again!&rdquo;\n\nKobalt Senior VP, Creative (Nashville) Whitney Daane added: &ldquo;The opportunity to work with Shane McAnally again, as well as to partner with the team at SMACKSongs, is fantastic. We started this journey with Shane in 2009, and to be a part of the profound impact he has had on contemporary country music and help him continue to expand his career as both a writer and producer is thrilling. His talent and passion for music are inspirational.&quot;\n\nOther Kobalt Music Publishing clients include Maroon 5, Dave Grohl, Paul McCartney, Vince Gill, Max Martin, Jessi Alexander, Dr. Luke, Skrillex, Ryan Tedder, Paul Overstreet, Thom Yorke, Stevie Nicks, Mark D. Sanders, Disney, Gwen Stefani, Shellback, Kelly Clarkson, Steve Diamond, Gotye, Herbie Hancock, Moby, Kid Cudi, Ashley Monroe, Joss Stone, and the Miles Davis Estate.\n"
]