[
"Clients signed to Kobalt, the leading global music publishing and music services company, have taken the nominations for the 57th Annual GRAMMY awards by storm, contributing to 63 nominations across 35 of the 83 categories.\n\nAside from the sheer number of nominees, Kobalt clients dominate the main categories. Max Martin and Paul Epworth both claim nominations for Producer Of The Year, Non-Classical, meanwhile Kobalt clients contributed to four of the five nominations for Album Of The Year &ndash; including Benjamin Levin and Johnny McDaid for Ed Sheeran&rsquo;s &ldquo;X&rdquo; and Eg White for Sam Smith&rsquo;s &ldquo;In The Lonely Hour&rdquo;.\n\nFour clients are nominated in the Record Of The Year category &ndash; Max Martin and Johan &rdquo;Shellback&rdquo; Schuster (for Taylor Swift&rsquo;s &ldquo;Shake It Off&rdquo;) and Charli XCX and Kurtis McKenzie (for Iggy Azalea featuring Charli XCX &ldquo;Fancy&rdquo;).  \n\n&ldquo;Shake It Off&rdquo; sees Martin and Schuster also nominated for Song Of The Year, meanwhile, Charli XCX, McKenzie, Martin, Savan Kotecha and Dr. Luke are among Kobalt clients participating in three of the five nominations for Best Pop Duo/Group Performance.\n\nSeveral clients in addition to Max Martin received multiple nominations, including singer-songwriter Beck, with five nominations for Album Of The Year, Best Rock Album, Best Engineered Album, Non-Classical, Best Rock Song and Best Rock Performance.\n\nKobalt clients also participated in five of the six nominations for Best Pop Vocal Album, with Benjamin Levin contributing to tracks on three nominated albums (&ldquo;Prism&rdquo; by Katy Perry, Ed Sheeran&rsquo;s &ldquo;X&rdquo; and Ariana Grande&rsquo;s &quot;My Everything&quot;), and Eg White once again nominated for work on Sam Smith&rsquo;s &ldquo;In The Lonely Hour&rdquo;.\n\nKobalt clients also contributed to four of the five nominations for Best Country Album.\n\nSean Paul is nominated for Best Reggae Album for &quot;Full Frequency&rdquo;, meanwhile, other key nominations for Kobalt clients include: \n\n&bull; In the Dance/Electronic Music categories &ndash; Little Dragon (Yukimi Nagano, Erik Bodin, Fredrik Kallgren Wallin and Hakan Wirenstrand), R&ouml;yksopp, Mez Austin, Barbara Bland, Duke Dumont, Jess Glynne, Jan Ai El-Goni, and Matt Zo.\n\n&bull; In the R&amp;B categories &ndash; Marcella Araica, Jean Baptiste, Ryan Buendia, Joshua Coleman, Damien &ldquo;Dammo&rdquo; Farmer, Caroline Polachek, William Roberts, Noah &quot;40&quot; Shebib, Ryan Tedder and Keith Thomas.\n\n&bull; In the Rap categories &ndash; Shante Franklin, Sarah Hudson, Benjamin Levin, Dr. Luke, Kurtis McKenzie, Steve McKinley, Lecrae Moore, John Padgett, Joseph Prielozny, Rick Ross, Noah &quot;40&quot; Shebib and Natalie Sims.\n\n&bull; In the Jazz categories &ndash; Brian Blade, Chick Corea, John Christopher Cowherd, Steve Martin and Marvin James Sewell.\n\nSaid Willard Ahdritz, Kobalt founder and CEO &ldquo;We are thrilled to see so many of our clients being recognised this year across so many styles and genres.  I couldn&rsquo;t be prouder of them and yet I know many of them are already writing the biggest hits of tomorrow!&rdquo;\n\nThe 57th Annual GRAMMY Awards will take place Sunday, Feb. 8 at the Staples Center in Los Angeles.\n"
]