[
"By ED CHRISTMAN\nTen-year-old Kobalt Music loves playing the role of the pioneering upstart.\n\nWhile all music publishers provide advances or even loans against future royalty payments, Kobalt was the first leading publisher to move the process online. Kobalt songwriters can access their royalty payments as easily as workers at major corporations can get a loan from their 401(k) retirement account by sitting in front of their computer.\n\nIt's a focus that's helped enhance its appeal to new clients, including Pearl Jam, Ti&euml;sto and Kid Cudi, who have all signed administration deals with Kobalt this year.\n\nNow Kobalt is providing clients with weekly royalty balances, as well as the ability to be paid immediately in the form of an advance on expected royalties.\n\n&quot;With a traditional structure it takes songwriters up to two-and-a-half years to get paid for overseas song usage,&quot; says Kobalt founder/CEO Willard Ahdritz, adding that it marks a significant step toward its ultimate goal of providing songwriters with global real-time information on collections.\n\nThe proliferation of new digital revenue models and the heightened importance of TV and film synchronization deals have greatly expanded the number of income streams that publishers and administrators must track. Even though collections are enormously more complicated than a decade ago, Kobalt's weekly balance updates effectively bring it to within seven days of its goal of real-time collections information.\n\nBased on secondary data sources on music sales, radio airplay and other metrics, as well as actual payments made to Kobalt, the company projects payments from song usage and posts the information every week on its online portal, where songwriters can track the activity.\n\nIf they want, they can opt to receive that projected income immediately, paying Kobalt a 1%-2% fee for that privilege, with the exact size of the fee leaning toward the lower end of that range the closer the request is made to the end of a given quarter.\n\nKobalt's system also enables songwriters and publishers to see exactly what they are being paid for&mdash;information that hasn't always been readily available, even in quarterly accounting statements.\n\n&quot;It's a much more complex world, so transparency is even more important,&quot; Ahdritz says. &quot;Songwriters wonder, 'Am I being paid correctly? Am I paid on time? How does royalty tracking work?' We listened to our clients and came up with a way to service them best.&quot;\n\nBy providing its clients with weekly balance updates, Kobalt allows them to make informed business decisions today instead of guessing how much cash they will have in a couple of years, Ahdritz says.\n"
]