[
"KOBALT NEWSWIRE: Country superstars Big &amp; Rich, including Kenny Alphin (aka &ldquo;Big Kenny&rdquo;) and John Rich, have each joined the Kobalt Nashville roster. Through the deals, Kobalt represents their works on their upcoming new album. Big &amp; Rich's first single, &quot;That&rsquo;s Why I Pray,&rdquo; was the highest debuting country single by a duo in the history of Billboard&rsquo;s Country Chart. \n\nBIG KENNY\n\nAlphin&rsquo;s influences range from old-school gospel to U2, or as he puts it, &ldquo;the soul of Ray Charles, the honesty of Merle Haggard and the joy of Louis Armstrong.&rdquo; With recent cuts on The Farm (Elektra Records) and The Lacs (Average Joes), Kenny has been writing with his favorite collective of Nashville writers and artists as well as Jaron Lowenstein, Bon Jovi and Richie Sambora. He has also been working on the upcoming Big and Rich album with his &ldquo;partner in crime&rdquo; John Rich. As one of the founders (with Rich) of the &ldquo;Muzik Mafia,&rdquo; he adds that for him today it&rsquo;s all about creating the next wave of &ldquo;Muzika Without Prejudice.&rdquo; \n\n&ldquo;My inspiration for my music is my life, the experiences, the people, the passion and emotion of it all,&rdquo; says Alphin, &ldquo;Great ideas all come in a moment. I like to keep it moving. I work hard but I never force it.&rdquo; \n\nOne of his greatest passions is performing, and Big &amp; Rich plan to hit over 50 cities in their upcoming tour to support the new record, and they might throw in a few electro-dance after parties just to mix it up. When asked about his new relationship with Kobalt, Alphin adds, &ldquo;The most fun I ever have is pushing the limits to find something that I love. I don&rsquo;t do well in a box. Kobalt is the most cutting edge game in town, and the edge is where I thrive!&rdquo;\n\nJOHN RICH\n\nFor artist/songwriter/producer and 2011 Celebrity Apprentice winner John Rich and his publishing companies Godfather Rich Muzik and Program 360 Kobalt will represent all new and previously released works in these two catalogs as administration company for the world plus representation for synch.\n\nRich and business partner, Charlie Pennachio, began Program 360 to sign and develop artist-writers. &ldquo;With the advent of MySpace and Facebook they are as close away as a click. We were going through 1,000 -1,500 pages a month and I came up with the concept of the &lsquo;Get Rich Talent Search&rsquo; with a cash prize where I would invite the top 10 best artists and writers out of thousands to come play on my dime at 12th &amp; Porter in Nashville. These artists began to get major record deals and interest,&rdquo; said Rich.\n\n&ldquo;I love discovering something that is brilliant that just needs a little fine tuning,&rdquo; Rich continues. &ldquo;Gretchen Wilson went from being my bartender to selling eight million CDs in about 24 months. That&rsquo;s when the bug bit me. The folks at Kobalt are real &lsquo;music passion&rsquo; people. It makes economic sense and it&rsquo;s a fun place to do business.&rdquo;\n\nRich and his longtime partner Kenny Alphin (aka &ldquo;Big Kenny) are currently working on the next Big &amp; Rich project for Warner Music Group with producer Dann Huff, as well as launching a multi-city tour for summer. Rich also just inked a deal with the CW to star this fall in their latest music-based reality show, The Star Next Door, alongside co-stars Queen Latifah, Pink and Gloria Estefan. On the TV show celebrity mentors will travel to cities across the U.S. to seek out local performers with potential for music stardom.\n\nRich&rsquo;s publishing company also publishes Jason Aldean&rsquo;s multi-week No. 1 hit single, &ldquo;Don&rsquo;t You Wanna Stay&rdquo; (featuring vocal superstar Kelly Clarkson). He also has another new hit at home. Rich welcomed his second son, Colt Daniel Rich, who was born on September 29, 2011!"
]