[
"NEW YORK, NY and LONDON (July 24, 2012) &ndash;  Kobalt Music Group Ltd. (Kobalt) is honored to announce the signing of an exclusive long-term deal with Paul McCartney and MPL, one of the world&rsquo;s largest, privately owned music publishing companies, which was founded by Paul McCartney in 1971.  The deal will take effect from July 1, 2012.  \n\nWith the exception of the US, Canada, UK and Eire territories, Kobalt will administer the songs of three MPL catalogues: MPL Communications, MPL Music Publishing, and Cherio Corporation (Cherio) throughout the world and provide synch licensing. MPL encompass one of the largest collections of classic hits by Paul McCartney, as well as over one thousand major songwriters and composers.\n\nWillard Ahdritz, Founder and CEO of Kobalt, stated: &quot;We are honored that MPL has chosen Kobalt to be its administration company outside the US, Canada and UK/Eire. We look forward to a long and fruitful relationship with Paul McCartney and MPL, and to represent this prestigious publishing company, which includes some of the most timeless hits ever written.&quot;\n    \nAn MPL spokesperson said, &quot;Kobalt is a forward-thinking, state-of-the-art company with excellent leadership and staff and is a great fit for our catalogues.  We are excited to see what new opportunities this relationship will present.&quot;\n\nThe MPL Communications catalogue includes all of Paul McCartney's post-Beatles solo material, works by Linda McCartney and songs by Paul McCartney &amp; Wings.  Major hits include &quot;Ebony and Ivory,&quot; &quot;Say Say Say,&quot; &quot;Jet,&quot; &quot;My Love,&quot; &quot;Band On The Run,&quot; &quot;My Brave Face,&quot; &quot;Listen To What The Man Said,&quot; &quot;With A Little Luck,&quot; &quot;Spies Like Us,&quot; &quot;Silly Love Songs,&quot; &quot;Vanilla Sky,&quot; &quot;Freedom,&quot; &quot;Dance Tonight&quot; and the recent single, &quot;My Valentine,&quot; among many others.     \n\nThe MPL Music Publishing and Cherio catalogues contain an unsurpassed collection of standards written by such legends as Frank Loesser, Carl Perkins, Joe Young, Harry Warren, Big Joe Turner, Jelly Roll Morton, Maurice Williams, Louis Jordan, Bessie Smith, Loudon Wainwright III, Hugh Masekela, Jule Styne, Roy Orbison, Hoagy Carmichael and over 1,200 other major songwriters.  They include songs from famous Broadway musicals such as Guys and Dolls, How to Succeed in Business Without Really Trying, and The Music Man, among others and such classics as &quot;Unchained Melody,&quot; &quot;Blue Suede Shoes,&quot; &quot;Till There Was You,&quot; &quot;Baby, It&rsquo;s Cold Outside,&quot; &quot;Luck Be a Lady,&quot; &quot;Sentimental Journey,&quot; &quot;Wonderful Copenhagen,&quot; &quot;The Inch Worm,&quot; &quot;Seventy Six Trombones,&quot; &quot;Stay,&quot; and &quot;Honey Don&rsquo;t&quot; among thousands of others.\n"
]