[
"NEW YORK, NY (October 10, 2012) &ndash; As part of the Kobalt Music Group (Kobalt), Kobalt Capital Ltd., an FSA regulated and authorized investment advisor, plans to invest up to 100m USD in the next 12 months in music royalties.\n\nIn making the announcement, Willard Ahdritz, CEO and Founder of Kobalt Music Group, said:  &ldquo;In order to respond to existing and new clients&rsquo; needs for bigger advances, or part or whole acquisitions, Kobalt formed an investment advisory company in 2011 which now has substantial capital resources backed by blue chip family office and other institutional investors.&rdquo;\n\nAs the leading, global independent music services company, Kobalt has already made a number of investments and is in talks to invest in and acquire rights in royalty streams generated by some of the world&rsquo;s most popular artists and songwriters. The company already manages more than 300,000 copyrights worldwide on behalf of over 1000 content holders and counts among its clients top artists and songwriters such as Paul McCartney and MPL, No Doubt, Max Martin, Kid Rock, Dr. Luke, Ryan Tedder, The Hives, Bj&ouml;rk, Garbage, Richard Ashcroft, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Dave Stewart, Joss Stone, among many others.\n\nJohan Ahlstr&ouml;m, CEO of Kobalt Capital Ltd., further added: &ldquo;As we enter our second year of activity of KCL we are looking at stepping up our investment in royalty advances and copyrights acquisitions with a focus on rights where value uplift can be achieved through Kobalt&rsquo;s efficient royalty collections and value enhancement through active management and marketing.&rdquo;\n\nKobalt&rsquo;s proprietary copyrights administration platform and direct collection infrastructure has been proven to collect royalties up to two years faster with up to 25% more income over traditional models.\n     \nContact:  \nRebekah Alperin, SVP Communications and Marketing-Worldwide\nE-Mail: rebekah.alperin@kobaltmusic.com     Tel: +1.310.770.1045\n"
]