[
"SYDNEY, AUSTRALIA -- (12 November 2012) &ndash; In a move signalling Kobalt&rsquo;s fast-forward expansion beyond music publishing and the emergence of the company&rsquo;s global music distribution and marketing services provider, Kobalt Label Services (KLS) has launched in the Australia and New Zealand markets and hired experienced local executive Ben Godding as Manager of Label Services.\n\nAdditionally Kobalt has concluded a physical distribution agreement with Inertia, which will handle retail sales and physical distribution for KLS in Australia and New Zealand. KLS digital distribution will be handled worldwide by AWAL, which was acquired by Kobalt last year.\n\nKLS aim to empower recording owners with a similar level of control, transparency, accuracy and efficiency that Kobalt has successfully provided to songwriters and other owners of copyrights. The new services will enable artists and other rights holders the opportunity to maximize revenues from a wide range of digital retail, physical retail, subscription, D2C and social media services, and advanced data analytics. \n\nSimon Moor, Managing Director of Kobalt Music Australia, commented: &ldquo;With the establishment of Kobalt Label Services in Australia and New Zealand and the appointment of Ben Godding, Kobalt continues to create a better alternative for artists, writers and content owners to take control of their future and maximize the value of their music.&rdquo;\n\nPaul Hitchman, Managing Director of Kobalt Label Services, further added: &quot;Australia and New Zealand are important markets for Kobalt Label Services releases, and we are therefore thrilled to be able to offer our clients the best possible retail sales representation in the territory via our partnership with Inertia. We aim to offer the best of both worlds -- expert local representation for physical sales in all of the key markets worldwide combined with global digital distribution via our own AWAL platform.&quot;\n\nBased in Kobalt&rsquo;s Sydney office, Ben Godding will be working with the global Kobalt Label Services team reporting to Moor and Hitchman, who is based in London.  His duties will include marketing and product management support for KLS releases, as well as releases for AWAL.  Godding comes to Kobalt with a wealth of label and marketing experience, having overseen successful international and domestic campaigns for artists such as Coldplay, Sigur Ros, Crowded House, Angus and Julia Stone and Lily Allen, among many others. Godding has held marketing roles at EMI UK and EMI Australia and most recently at Original Matters, an independent management and marketing company.\n\nAbout Kobalt Label Services (KLS)\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n"
]