[
"MUSIC WEEK FEATURE STORY - FEBRUARY 2013\n\nFOR YOUR INFORMATION\n\nIts hardcore philosophy of transparent data via technology has seen Kobalt grab a hug amount of publishing marketshare in the past decade. Unsurprisingly, it&rsquo;s rivals aren&rsquo;t too delighted &ndash; but the company&rsquo;s enthused founder says he&rsquo;s too busy trying to save the music business to care.\n\nWillard Ahdritz has built his independent publishing empire by boldly questioning this industry and seeking out transparency at every turn. Evidently, that goes double for smirking Music Week journalists.\n\nAs would surely please a man who prides himself on pinpoint accuracy, Ahdritz&rsquo;s jokey accusation during our hour-long interview is spot on. (Behind the scenes, chatty rival publishers aren&rsquo;t so much threatened by Kobalt as outright obsessed with its gameplan.)\n\nStill, Music Week&rsquo;s tell-tale simper in front of the Swedish exec isn&rsquo;t half as rosy as the grin he wears when recounting Kobalt&rsquo;s startling growth over its 13-year history. Ahdritz has little enthusiasm for wrestling with giants like Universal or Sony/ATV/EMI over catalogue copyrights. Instead, Kobalt&rsquo;s core publishing business is built on a simple offer of administration &ndash; handling the rights for more than 200 separate publishing partners &ndash; and execution, collecting royalties for each of them around the globe.\n\nKobalt doesn&rsquo;t trouble itself with laying endless gigantic advances in front of top modern writers, but instead encourages them to keep their own rights &ndash; and, vitally, promises to take a mere single digital percentage service fee from their on-going royalties. To some writers used to seeing their publisher gobble up 50% of their rights money, it&rsquo;s proven a revelation.\n\nKobalt considers its web-based technological setup as one of its core differences to the competition; one steeped in Ahdritz&rsquo;s mantra of &ldquo;transparency, transparency, transparency&rdquo;. \n\nThe firm allows its clients to access their song-related financial data instantly, whenever and wherever they are in the world &ndash; an elementary privilege which Ahdritz considers the traditional music industry to have disastrously failed at delivering. By raking in payments direct from global collection societies, Kobalt also claims to have halved the average time in which writers receive royalties into their bank accounts.\n\nFor the full story go to:\n\nhttp://www.musicweek.com/news/read/kobalt-s-ahdritz-it-is-not-a-game-about-cash-advances-anymore-our-world-is-getting-bigger/053556\n"
]