[
"LONDON, UK (26 November 2012) -- Bob Dylan, Dr. Luke, Gotye, Max Martin, Paul Simon, Ryan Tedder and Shellback (a.k.a. Johan Schuster) are among the global superstar talent that have recently concluded deals and chosen Kobalt to manage their neighbouring rights, it was announced today by Willard Ahdritz, CEO and Founder of Kobalt Music Group (Kobalt), and Hans van Berkel, Executive Chairman of Kobalt Neighbouring Rights Ltd. (KNRL).\n\nThe artists and producers join KNRL&rsquo;s growing client roster which also includes Anders Hansson, Benny Gallagher, Carly Simon, Gary Numan, Guy Chambers, Iva Davies, OneRepublic, Paul Tucker (Lighthouse Family), Roger Taylor (Duran Duran), and Mary Wilson, among others.\n\n&ldquo;We are privileged to be representing many of the world&rsquo;s top artists and producers for neighbouring rights and bringing them the most transparent and efficient way to maximize their revenues,&rdquo; said Hans van Berkel, Executive Chairman of KNRL. &ldquo;In some territories, we have found monies that have been held for 10 years or longer. It is our mission to find the income that clients are properly due and have it released by the respective neighbouring rights societies throughout the world. Our clients are very positive about the Kobalt way of simplifying a very complex process, maximizing earnings and speeding up payments.&rdquo; \n\nIn addition, the company today unveiled the next generation in technology and services for Kobalt neighbouring rights clients who can now view online all account detail showing exactly where their income is coming from, and from which territory. KNRL is the first company to offer this level of transparency and detailed accounting with monthly statements for neighbouring rights. Accounts are continually updated and viewable 24/7.\n\nWillard Ahdritz, CEO and Founder of Kobalt Music Group, said: &ldquo;As KNRL enters its second year of operation, we are very proud to offer the industry the next standard in global direct collections in this segment of the business. We&rsquo;ve applied Kobalt&rsquo;s modern approach and unique technology to neighbouring rights collections and are seeing a significant uplift in collections over traditional neighbouring rights models.&rdquo;\n\nAs Kobalt Music Group has firmly established itself globally as an alternative and groundbreaking service provider in the music publishing sector, the company&rsquo;s KNRL division, was established as an alternative to the traditional neighbouring rights model. Utilizing Kobalt&rsquo;s advanced global relational databases, highly detailed royalty tracking and direct collections infrastructure, KNRL offers a bespoke service proven to provide more accuracy, faster distributions, global performance data and repertoire/database quality control in each territory. \n\n                                                                 # # #\n\nKobalt Music Group/KNRL Contact: \nRebekah Alperin, Tel/Text +1.310.770.1045- e-Mail: rebekah.alperin@kobaltmusic.com\n\n"
]