[
"SOURCE Reed MIDEM\n\nmidem to Address Core Music Industry Issues From Copyright to New Business Opportunities and Innovation\n\nPARIS, Dec. 13, 2012 /PRNewswire/ -- The upcoming edition of midem will confirm its place as the world's premier music industry forum with a series of summits, conferences, training sessions and networking events to help the sector keep pace with a rapidly changing ecosystem. Organised by Reed MIDEM, midem 2013 will take place in Cannes, 26-29 January.\n\nThe midem music summits will focus on several key aspects of today's industry, including segments dedicated to publishers, authors' societies and lawyers. Willard Ahdritz, founder and CEO of Kobalt Music Group, will deliver a keynote on Tuesday 29 January in which he will discuss the opportunities and challenges facing music publishers and business models that better service the needs of songwriters and rights-holders in today's increasingly complex landscape of online music consumption.\n\nAfter his keynote, the Confederation Internationale des Societes d'Auteurs et Compositeurs (CISAC) and the International Confederation of Music Publishers (ICMP) will join forces to spearhead a look at current trends in Collective Rights Management and the latest moves towards the Global Repertoire Database (GRD) during a series of panels and presentations. Sessions organised in partnership with the International Association of Entertainment Lawyers (IAEL) include the launch of the book: &quot;The New Economics of the Entertainment Industry: Creative Lawyering as a Growth Catalyst in a Global Market,&quot; co-edited by Flipboard's Cecily Mak and French lawyer Anne-Marie Pecoraro.\n\nRounding off this focus on copyright, the European Commission Internal Market Directorate will hold a partners' conference on the various reforms underway in the field of copyright management and pan-European licensing. This includes the participation of Michel Barnier, Commissioner responsible for internal market and services, and a panel featuring all the stakeholders involved in the sector.\n\nmidem will look to the future on Visionary Monday, when innovation &ndash; whether controversial or broadly welcomed &ndash; will be under the spotlight. This promises to deliver a high-octane debate in which music makers, rights holders and collecting agencies will voice their views on the music industry's ability to embrace disruption and leverage the current creative renaissance. Robert Ashcroft, CEO of PRS for Music (UK) and Jean-Noel Tronc, CEO of SACEM (France) are among the contributors so far confirmed. \n\nTraining will be on the menu through the midem academy, which sets out to provide attendees with practical skills. This includes 14 courses on music industry basics, entrepreneurship and marketing. The programme has been designed to be highly interactive and relevant, with high-profile experts, including lectures in association with Berklee College of Music, Sciences Po, IMPALA/WIN, and the Berlin School of Creative Leadership.\n\nmidem will also highlight new business opportunities and innovation through four content areas located within the exhibition floor: Brand Central, exploring the flourishing relationships between music and brands; Innovation Factory, where  the latest cutting-edge technologies are demoed, discussed and explained; Direct2Fan Camp, focusing on key aspects of audience engagement for music entrepreneurs; and the Classical Discussion Lounge, where industry professionals will explore topics that matter within the classical and jazz business. \n\nOnce again, the Networking Village features a series of one-to-one speed meetings with managers, publishers, indie labels, lawyers, collecting societies and advertising experts, providing a chance to connect with industry professionals from all over the world.\n\nOther major music companies involved in midem's conference programme include publishers Downtown Music Publishing, peermusic, and BMG; and the music labels Ministry of Sound, Rostrum Records, Glassnote Entertainment Group, EMI Music, Warner Music Group, Atlantic Records, Sony Music Entertainment, [PIAS] Media, Virgin Classics, Naive, Decca Classics, Naxos of America, and X5 Music.\n"
]