[
"NEW YORK (January 22, 2013) Kobalt has signed an exclusive, worldwide administration deal with Foo Fighters lead vocalist, guitarist and founder Dave Grohl, it was announced today by Willard Ahdritz, CEO and Founder of Kobalt.\n\nThrough the deal Kobalt will immediately begin providing worldwide creative and synch services, representing Grohl&rsquo;s new works, including songs from the upcoming Sound City - Real to Reel, the companion album to the Grohl-directed documentary debuting at Sundance this week, then premiering in Hollywood and opening worldwide later this month.\n\nSet for release in March 2013, the Sound City - Real to Reel album is a collection of original music created by Grohl and a cast of musical legends specifically for the film about the hallowed and now-shuttered Sound City recording studio. Preceded by currently available first single &ldquo;Cut Me Some Slack&rdquo;&ndash;performed by Paul McCartney, Dave Grohl, and Grohl's former Nirvana bandmates Krist Novoselic, and Pat Smear&ndash;the album also features the likes of Stevie Nicks, Trent Reznor, Rick Springfield, Tim Commerford and Brad Wilk of Rage Against The Machine, Joshua Homme of Queens of the Stone Age, Rick Nielsen of Cheap Trick, Corey Taylor of Slipknot and Stone Sour, Grohl&rsquo;s fellow Foo Fighters (Taylor Hawkins, Nate Mendel, Chris Shiflett, Smear again) and many more. \n\nGrohl's personal connection to Sound City dates back over 20 years, to the 1991 recording of Nirvana's Nevermind, which sold over 30 million copies worldwide, transforming the entire modern musical landscape and forever altering the course of Grohl's life.\n\nAdditionally, In 2014 Kobalt will begin representation of the Grohl repertoire that chronicles his ascension to legendary status as one of the most beloved and respected figures on the international music scene: from his generation-defining work with Nirvana, through the Foo Fighters' catalog that has won 11 Grammy Awards and sold 25 million records, and Them Crooked Vultures, the Grammy-winning supergroup he formed with Led Zeppelin's John Paul Jones and Queens of the Stone Age's Joshua Homme, and more.\n\nIn making the announcement Ahdritz stated: &ldquo;It&rsquo;s a privilege and thrill for all of us to be working with Dave Grohl, John Silva and his management team. As a rock musician, multi-instrumentalist, singer-songwriter and film director, vocalist, guitarist, and songwriter, Dave is a force and an immense and diverse talent with a catalogue of amazing songs. We look forward to a long relationship and the new Sound City &ndash; Real to Reel album due next month.&rdquo;\n\nAdded Bob Bortnick, Kobalt SVP Creative: &ldquo;Dave is one of the most amazing musicians and songwriters on the planet and we&rsquo;re honored that he&rsquo;s joined us at Kobalt.&rdquo;\n\n# # #\n\nCONTACT: Rebekah Alperin, SVP Communications/Marketing-Worldwide\nTel. +1.310.770.1045   e-Mail: rebekah.alperin@kobaltmusic.com\n"
]