[
"FIRST KLS RELEASE: NICK CAVE &amp; THE BAD SEEDS &ndash; PUSH THE SKY AWAY &ndash; FEB. 18, 2013\n\nTwo tracks from the album, &quot;We No Who U R&quot; and &ldquo;Jubilee Street&rdquo; now available via all digital retailers, album pre-orders through nickcave.com\n\nLONDON (22 JANUARY 2013) &ndash; Kobalt Label Services (KLS), in collaboration with Nick Cave and his management at ATC, is proud to announce the release of Push the Sky Away (Bad Seed Ltd.), the fifteenth studio album by Nick Cave &amp; The Bad Seeds. \n\nWorking closely with Cave and his management on all aspects of the release, KLS is providing a full spectrum of label services to include global distribution via digital retail, D2C, physical retail and subscription services, as well as marketing and promotion, advanced data analytics and royalty tracking, synch licensing and other services.  Push the Sky Away will be released on CD, Limited CD-DVD, Vinyl and Digital formats and represents a watershed moment for KLS. \n\n&ldquo;We are extremely proud to count Nick Cave &amp; The Bad Seeds as a key client for KLS.  The new album is highly anticipated and the response from our extensive network of distribution partners worldwide has been phenomenal. We look forward to unveiling a wide range of promotional activity in support of the release this year,&rdquo; said Paul Hitchman, MD of Kobalt Label Services.\n\n&ldquo;The Push The Sky Away album campaign represents the start of a new, exciting and inspiring chapter for Nick, both creatively and in business. The skills and expertise KLS has to offer across the globe, especially in the digital space, gives us a service provider that best fits our expanding requirements.&rdquo; said Brian Message, Nick Cave &amp; The Bad Seeds&rsquo; manager out of ATC.\n\nAbout the Album:  Push the Sky Away was produced by Nick Launay and recorded at La Fabrique. \n\nTracklisting\n\nWe No Who U R\nWide Lovely Eyes\nWater's Edge\nJubilee Street\nMermaids\nWe Real Cool\nFinishing Jubilee Street\nHiggs Boson Blues\nPush The Sky Away\n\n\nNick Cave - Vocals, piano, Rhodes, backing vocals\nWarren Ellis - Violin, viola, flute, tenor guitar, synthesizer, loops, Rhodes, backing vocals\nMartyn Casey - Bass\nThomas Wydler - Drums\nJim Sclavunos - Percussion\nConway Savage - Vocals\n\nFor more information: www.nickcave.com  \n\nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\nContact: Rebekah Alperin, SVP Communications/Marketing-Worldwide\nTel. +1.310.770.1045   e-Mail: rebekah.alperin@kobaltmusic.com\n"
]