[
"\nNASHVILLE, TN (January 24, 2013) -- Kobalt Music Group (Kobalt) has concluded an exclusive, worldwide administration deal with seven-time Grammy Award-winning American trio Lady Antebellum. \n\nThrough the deal Kobalt will provide full global creative and synch services and represent all songs written by the trio (Hillary Scott, Charles Kelley and Dave Haywood) for their highly anticipated, upcoming Capitol Nashville release. \n\nIn addition, Kobalt will also represent select Lady Antebellum catalog repertoire, including works on their multi-million selling 2011 album, Own The Night (Capitol Nashville), including the recent smash hits &ldquo;We Owned The Night&rdquo; and &ldquo;Just A Kiss,&rdquo; and the songs &ldquo;Cold As Stone,&rdquo; &ldquo;Singing Me Home,&rdquo; and &ldquo;Somewhere Love Remains&rdquo; among others.\n\n&ldquo;It is a privilege to have the opportunity to work with such unique individual and collective talent as Charles Kelley, Dave Haywood and Hillary Scott. As songwriters, they each bring their own creative vision for Lady Antebellum. Their collaboration has created one of country music&rsquo;s top bands, and they are truly a global ambassador for the format. We are honored that Lady Antebellum has chosen Kobalt and look forward to being a part of their ongoing and future success,&rdquo; said Whitney Daane, Senior VP of Kobalt Music Group.\n\n&ldquo;It&rsquo;s very gratifying to be recognized by Lady Antebellum and their team as their publishing partner. As writers and performers they are one of music&rsquo;s most respected acts. We look forward to a long relationship,&rdquo; said Richard Sanders, President of Kobalt Music Group.\n\nLady A&rsquo;s three studio albums have sold over 11 million copies, scored six career No.1 hits and seven GRAMMY awards. The ACM and CMA award-winning trio holds the record for the most downloaded country song of all time while simultaneously earning chart-topping hits in multiple radio formats in the US as well as overseas. Last year alone, more than one million fans in over 11 countries welcomed the trio on their headlining tour, which also earned Billboard&rsquo;s 2012 &ldquo;Breakthrough&rdquo; touring award.  The group recently announced a new charitable initiative called LadyAID&trade;, a philanthropic effort created to bring awareness to and generate support for children in need locally, nationally and globally.\n"
]