[
"CANNES, FRANCE (29 Jan 2013) -- Kobalt Music Group (Kobalt), the leading global independent music publisher, and Swedish copyright management organization STIM have launched Kobalt STIM Aggregated Rights AB, a partnership that enables multi-territorial digital music service providers a very efficient, large-scale one-stop European licensing solution for song rights.\n\n&ldquo;Kobalt and STIM both look after some of the most successful songwriters and songs in the world and share a visionary approach to copyright administration in the new music economy. With our publisher/CMO copyright partnership, cross-border digital music services can now easily access these seamlessly integrated rights that cover all of Europe,&rdquo; said Tomas Ericsson, STIM Deputy CEO.\n\nThe licensing service will be administered through a newly formed subsidiary of STIM poised to start operations on March 1, 2013. The creation of this separate company, with board members to include STIM Deputy CEO Tomas Ericsson and Kobalt Music Group CFO James Fitzherbert-Brockholes, enables STIM and Kobalt to leverage a unique, shared technology platform to give Kobalt clients full transparency in usage data, rates and costs per licensee. It will also give clients significantly accelerated access to their money, as fast as a month from when the music was used, which is unique in publishing.\n\nAs Kobalt represents major songwriters who have written on approximately one in five Top 40 songs across Europe (or around 35% of the Anglo American Top 40 songs), this new pact not only satisfies the commercial marketplace&rsquo;s demands, but also offers a major step towards the creation of a single common European market for music rights. The agreement will enhance the European licensing process and administration of online rights for all Kobalt Music Group&rsquo;s Anglo-American repertoire, which includes over 250,000 songs.\n\n&ldquo;We are excited to once again be announcing innovative changes to the global collection structure for music rights. This unique partnership with STIM will provide a step change in transparency, speed and efficiency for our client&rsquo;s digital collections across Europe. We also hope that this licensing simplification will assist in bringing new and exciting music services to market. STIM has shown itself to be both technologically advanced and highly adaptable, which made it the obvious partner for this venture,&rdquo; said Willard Ahdritz, Founder &amp; CEO of Kobalt.\n\n&ldquo;We are delighted to collaborate with Kobalt, a truly innovative music company that combines thought-leading technology with a client roster that dominates the global music scene. This new licensing service is a business model that will take online rights administration to a new level,&rdquo; added Ericsson."
]