[
"LOS ANGELES, CA (February 11, 2013) &ndash; Kobalt Music Group congratulates its clients Gotye, Kelly Clarkson, Skrillex, Chick Corea, Noah &quot;40&quot; Shebib, and Bj&ouml;rk who are among the superstar artist, producer, and songwriters celebrating wins from the 55th Annual Grammy Awards held in Los Angeles.\n\nWally de Backer a.k.a. Gotye, whose multi-million-selling hit single, &ldquo;Somebody That I Used To Know&rdquo; featuring Kimbra [Universal Republic], topped charts worldwide this year, won all three Grammy Awards for which he was nominated. Prince presented Gotye and Kimbra the prestigious Record of the Year Award award for &quot;Somebody That I Used to Know.&quot;  Gotye also received a Grammy for Best Pop Duo/Group Performance for the global smash hit, and also received the Best Alternative Music Album award for his record, Making Mirrors [Universal Republic]. According to a statement by Gotye's management/PR firm, Bossy Music, this is only the second time in the 54-year history of the Grammys that the Record of the Year prize has been won by an Australian artist, as well as the first time ever that an Australian male solo artist has received multiple Grammys in the same year.\n\nSkrillex, already a multiple Grammy winner from last year, also received wins for all three categories for which he was nominated including Best Dance Recording for &quot;Bangarang&quot; by Skrillex feat. Sirah [OWSLA/Big Beat/Atlantic], Best Dance/Electronica Album for Bangarang and Best Remixed Recording, Non-Classical for &quot;Promises&quot; (Skrillex &amp; Nero Remix) [Interscope].\n\nPop superstar Kelly Clarkson won for Best Pop Vocal Album for Stronger [RCA Records/19 Recordings Limited].\n\nJazz legend and Kobalt client Chick Corea won the Grammy Award for Best Instrumental Composition for &quot;Mozart Goes Dancing&quot; by Chick Corea &amp; Gary Burton [Concord Jazz].\n\nBrill Building writer Cody ChesnuTT Category is celebrating his contributions to the Best Comedy Album win by Jimmy Fallon for his record, Blow Your Pants Off [Warner Bros. Records/LoudMouth Entertainment].\n\nBj&ouml;rk received the award for Best Recording Package for her album, Biophilia [One Little Indian/Nonesuch].\n\nProducer/writers celebrating wins also include Kobalt clients Noah &ldquo;40&rdquo; Shebib, Doc McKinney, Tristan Jones and First &lsquo;N Gold Publishing&rsquo;s Rick Ross for the Best Rap Album award for Take Care by Drake [Cash Money Records]. \n"
]