[
"CANNES, FRANCE -- Willard Ahdritz, Founder and CEO of Kobalt Music Group has announced the appointment of Richard Sanders as President. Reporting to Ahdritz, Sanders will oversee Kobalt's global front office operations to include artist relations, business development, synch licensing and creative services across Kobalt's multiple rights divisions.\n\nUpon making the announcement, Ahdritz said: &quot;As Kobalt enters this new phase of global expansion and rolls out next generation client services for our artists, labels and content owners I am very pleased to welcome Richard, an executive who shares my vision and can work alongside me, providing a recording rights DNA to our proven publishing service model. Richard is a dynamic entrepreneurial leader with vast international experience, relationships and a uniquely successful track record of delivering both operational and creative results as well as managing both creative and executive talent.&quot;\n\nAdded Sanders: &quot;I'm thrilled to be joining the entire Kobalt team and supporting Willard's vision for the continued expansion of the company and the development of artist and label services. Throughout my career supporting the needs of the artist has always been my passion and focus, thus I am particularly excited to join Kobalt which continues to set new standards in transparency and carries a solid reputation as a client-friendly company designed to serve that same objective.&quot;\n\nWhether in the role of a major label executive, manager or road manager, Sanders is a pioneering music executive who has always put the artist and writer first. With 30 years experience across the full spectrum of international and domestic media, entertainment and digital services, Sanders was previously Sony Music's Chairman of International &amp; President of Global Marketing where he oversaw the global company's 43 operating units ex-US and transformed Sony Music's International operations from one dimensional labels into full service digital media and entertainment service companies. He additionally shepherded Sony Music Live, which produced over 5,000 live events per year. Sanders led Sony Music's market share ascent to No.1 in 12 countries fueled by major marketing campaigns and brand partnerships for such artists as Britney Spears, Shakira, Beyonce, Kings of Leon, Foo Fighters, P!nk, Alicia Keys, Dido, Michael Jackson, MGMT, Usher, Bruce Springsteen, Bob Dylan, Christina Aguilera, Pearl Jam, Kelly Clarkson, Justin Timberlake, Avril Lavigne, Leona Lewis, Il Divo, among many others.\n\nPrior to his tenure at Sony, he held executive positions at RCA Records, Sir Richard Branson's V2 Records and Arista Records. "
]