[
"LONDON, UK -- Pete Dodge has been appointed to the position of GM/VP of Kobalt Label Services. The new hire represents another step in Kobalt Music Groups ongoing investment in the expansion and development of new client services including the distribution and marketing of recorded music. \n\nThe announcement was made today by Willard Ahdritz, CEO and Founder of Kobalt Music Group (Kobalt), just three weeks after the leading global indie publishing company announced its evolution into a new kind of full-service music company now also offering artist and label services and neighbouring rights management.\n\nPreviously Managing Director of IODA UK and VP IODA International, Dodge, a well-known and successful executive in the distribution and marketing space, will be based in London reporting to Paul Hitchman, who joined Kobalt this month as Managing Director of Kobalt Label Services. As part of his new role, Dodge will work closely with client implement sales and marketing strategies for recording rights. In addition, Dodge will work closely with Hitchman and the management team of AWAL, the leading digital distribution and marketing services provider recently acquired by Kobalt, to expand the companys global digital and physical distribution channels.\n\nUpon making the announcement, Ahdritz said: &quot;In response to our clients needs we are investing on many levels including the hiring of top experienced and dynamic executives such as Pete Dodge and Paul Hitchman. We are committed to empowering artists and labels with the same high level of transparency, creative, technology, accuracy and efficiency for their recording rights as Kobalt has successfully provided to songwriters and other owners of copyrights.&quot;\n\nAt IODA, Dodge was responsible for the overall operations of IODA's digital business in the UK as well as expanding initiatives and partnerships in key European territories. Dodge joined IODA via the 2007 acquisition of UK digital distribution pioneer Uploader, where he was a Partner and Managing Director. Prior to Uploader, he managed European operations for independent hip-hop label Definitive Jux and was General Manager for PIAS (Play It Again Sam) Recordings, where he oversaw numerous UK chart album and single successes, working with artists such as Jurassic 5, Public Enemy, Soulwax and Laurent Garnier.\n\nCommented Hitchman: &quot;I am delighted that Pete is joining the Kobalt team as we begin to expand and develop new services. His very broad experience of more than 20 years of managing successful campaigns for independent artists and labels in both digital and physical markets will be invaluable as we roll out services to our clients during 2012.&quot;\n\nAdded Dodge: &quot;I am looking forward to joining the Kobalt team and working with the management team at AWAL. Artists, labels and managers want fair, transparent and effective routes to market, as well as global reach and expertise in dealing with the representation of their rights. These are the principles on wthich Kobalt has built its business and Im excited to help the team expand the Kobalt approach into artist and labels services.&quot;\n\nIn 2012 Kobalt Label Services division will roll out next generation services that will enable Kobalt and AWAL clients the opportunity to maximize revenues from a wide range of digital retail, subscription, D2C and social media services plus benefit from advanced data analytics."
]