[
"JOHN RICH\n\nKobalt is representing John Rich worldwide including all new and previously released works via a deal with his publishing companies, Godfather Rich Muzik and Program 360. Rich and business partner, Charlie Pennachio (Linear), began Program 360 to sign and develop artist-writers. &ldquo;With the advent of MySpace and Facebook they are as close away as a click. We were going through 1,000 -1,500 pages a month and I came up with the concept of the &lsquo;Get Rich Talent Search&rsquo; with a cash prize where I would invite the top ten best artists and writersout of thousands to come play on my dime at 12th &amp; Porter in Nashville. These artists began to get major record deals and interest,&rdquo;said Rich. &ldquo;I love discovering something that is brilliant that just needs a little fine tuning,&rdquo; Rich continues. &ldquo;Gretchen Wilson went from being my bartender to selling eight million CDs in about 24 months. That&rsquo;s when the bug bit me. The folks at Kobalt are real &lsquo;music  passion&rsquo; people. It makes economic sense and it&rsquo;s a fun place to do business.&rdquo; Rich&rsquo;s publishing company also publishes Jason Aldean&rsquo;s multi-week No. 1 hit single, &ldquo;Don&rsquo;t You Wanna Stay&rdquo; (featuringvocal superstar Kelly Clarkson). as well as Big &amp; Rich&rsquo;s current single, &ldquo;Party Like Cowboyz.&rdquo; Aside from the Big &amp; Rich national tour, writing, producing and workingwith his publishing companies, Rich spends his time on charitable endeavors and has raised millions of dollars on behalf of St. Jude Children&rsquo;s Research Hospital and Second Harvest Food Bank. With all the good work Big &amp; Rich do to help others, it&rsquo;s no surprise they have has been announced as the recipient of the prestigious CRS 2013 Artist Humanitarian Award to be presented at Country Radio Seminar on February 27, 2013. \n\nBIG KENNY\n\nSuperstar country artist/writer and producer Big Kenny &ndash; the &ldquo;Big&rdquo; of Big &amp; Rich) has influences that range from old-school gospelto U2, or as he puts it, &ldquo;the soul of Ray Charles, the honesty of Merle Haggard and the joy of Louis Armstrong.&rdquo; When asked about his new relationship with Kobalt, Big Kenny adds, &ldquo;The most fun I ever have is pushing the limits to find something that I love. I don&rsquo;t do well in a box. Kobalt is the most cutting edge game in town, and the edge is where I thrive!&rdquo; With recent cuts on The Farm (Elektra Records) and The Lacs (Average Joes), Big Kenny has been writing with his favorite collective of Nashville writers and artists, as well as Jaron Lowenstein, Bon Jovi and Richie Sambora. As one of the founders (with Rich) of the &ldquo;Muzik Mafia,&rdquo; he says that for him it&rsquo;s all about creating the next wave of &ldquo;Muzik Without Prejudice.&rdquo; &ldquo;My inspiration for my music is my life, the experiences, the people, the  passion and emotion of it all,&rdquo; says Big Kenny, &ldquo;Great ideas all come in a moment. I like to keep it moving. I work hard but I never force it.&rdquo; One of his greatest passions is performing, and Big &amp; Rich toured over 50 cities in 2012 to support their most recent album, Hillbilly Jedi (Warner Music Nashville). Its debut single &ldquo;That&rsquo;s Why I Pray&rdquo; was Big &amp; Rich&rsquo;s fastest rising single of their career. Big Kenny was recently the 2nd U.S. recipient of the African Children&rsquo;s Choir Malaika Award in recognition of his work in the Sudan presented to him at its 4th Annual Benefit Gala in New York City on December 3, 2012. \n"
]