[
"KOBALT GERMANY SPOTLIGHT: \n\nTOBIAS KUHN\n\nTobias Kuhn&rsquo;s first band Miles became one of the most influential German indie rock groups, internationally recognized with over 120,000 in album sales, a No.1 single success in Japan and tours worldwide. Afterwards he made two records with his solo project, Monta, and subsequently director Wim Wenders asked him to write music for his movie Palermo Shooting. It was during this time, that Kuhn became known as a very creative and talented producer and writer. In 2008 he produced Sportfreunde Stiller&rsquo;s album, MTV Unplugged in New York, which went to No.1 on German album charts and garnered him an Echo nomination. Additionally he wrote music and co-produced a track on the album of Udo Lindenberg, which sold over 1 million units in Germany. Kuhn&rsquo;s most recent success was his work with Die Toten Hosen, whose album sold over 600,000 units. He has also produced an album for Scottish band Martin &amp; James (Universal Music Germany) in Los Angeles, where  he&rsquo;ll continue to work on projects in 2013. \n\nBOYS NOIZE\n\nBerlin-based DJ and producer Alex Ridha &ndash; known professionally as Boys Noize &ndash; is signed to Kobalt for worldwide administration including creative services. Since inaugurating his career as one of electronic music&rsquo;s most innovative artists, as a producer, Ridha has been behind the board for such artists as Kelis, the Black-Eyed Peas and Kano (co-produced with Damon Albarn). As a remixer, he has reimagined tracks for David Lynch, N.E.R.D., Depeche Mode, Daft Punk, Snoop Dogg, Feist and The Chemical Brothers. His recent projects have included the single &ldquo;Only The Horses&rdquo; from the Scissor Sisters full-length Magic Hour, as well as work with Usher, Snoop Dogg and Chris Brown. He recently teamed up with filmmaker and producer Mr. Oizo for a brand new project called Handbraekes.\n\nDAVID JOST\n\nLA-based producer and hit-songwriter David Jost co-wrote Chris Brown&rsquo;s new single, &ldquo;Nobody&rsquo;s Perfect,&rdquo; in collaboration with Brown and Livingston, Hilbert and Showtek for Brown&rsquo;s upcoming album. He&rsquo;s had 74 platinum records and 108 gold records and written and produced 14 No.1 hits. Jost has worked with major artists including Lady Gaga, Limp Bizkit, Tokio Hotel, Nelly Furtado, Keri Hilson, Justin Bieber, Far East Movement, Melanie C (Spice Girls), and Adam Lambert among others. For Gaga, Jost produced the &ldquo;Born This Way Jost &amp; Naaf Remix.&rdquo; Jost has also composed numerous songs for film, TV and advertising campaigns including BMW, Mercedes, Veltins, Verizon and Motorola among other major brands.\n"
]