[
"BERLIN, GERMANY (March 4, 2013) &ndash; As Kobalt celebrates the No.2 chart debut in Germany of its release of Nick Cave &amp; The Bad Seeds&rsquo; album, Push The Sky Away (Bad Seed Ltd. via Kobalt Label Services) and prepares several new spring releases, the company is pleased to announce the hiring of experienced label manager and record promotion/marketing executive Curt Keplin to the position of Marketing Director, GSA of Kobalt Label Services. \n\nThe announcement was made today by Matthias Kind, Managing Director of Kobalt Music Group Germany GmbH (KMG Germany), and Paul Hitchman, Managing Director of Kobalt Label Services (KLS).\n\nThe hiring of Keplin signifies Kobalt&rsquo;s further commitment to broaden its label services operations in the German market and GSA territory, which has been successfully worked for the Nick Cave &amp; The Bad Seeds release by consultant Tina Funk and her company Creative Lobby. Keplin will work closely with the entire Kobalt Label Services team on the highly anticipated new releases of New Kids On The Block&rsquo;s album, 10 (The Block/Boston Five via Kobalt Label Services), which is set for release in April, and Little Boots&rsquo; Nocturnes (On Repeat via Kobalt Label Services), which is expected to release in May.\n\n&ldquo;We have been thrilled with the excellent work Tina Funk has delivered thus far to support the Nick Cave &amp; The Bad Seeds release and propel Kobalt Label Services' entry into the GSA market,&rdquo; says Kind, &ldquo;Now with the new addition of Curt Keplin to our team, we will build upon this initial success to establish and strengthen our position as the leading label services company.&rdquo; [Matthias Kind Quote in German: Dank der hervorragenden Arbeit die Tina Funk und Ihre Firma Creative Lobby geleistet haben, ueberzeugt der Einstand von Kobalt Label Services auch in GSA. Mit Curt Keplin werden wir unsere Position als fuehrendes Unternehmen im Markt etablieren und ausbauen. Wir freuen uns auf weitere gemeinsame Erfolge.]\n\nReporting to Kind and Hitchman, Keplin will now be responsible for managing and coordinating the marketing and promotion of KLS releases in Germany, Switzerland and Austria. Keplin will also manage the relationship with KLS&rsquo; local physical distribution partner, Rough Trade/Good To Go, as well as with local PR, promotion, media and digital partners.\n\nKeplin joins Kobalt after seven and a half years at Cooperative Music where he started the German office in Berlin as a Label Manager in September 2005. At Cooperative Music Keplin worked and overviewed releases from such artists as Mumford &amp; Sons, Phoenix, Bloc Party, Fleet Foxes, Two Door Cinema Club, The Knife, Soulsavers with Dave Gahan and Dropkick Murphys. Keplin started his music career as the original founder and editor in chief of the online music fanzine alternativenation.de before he joined the Jazz &amp; Catalogue marketing department of EMI Music Germany in March 2003.\n\n&quot;We are very pleased to welcome Curt to Kobalt Label Services as the latest addition to our global team of marketing experts. Curt's broad experience and deep knowledge will bring huge benefit to Kobalt's label services clients across Germany, Switzerland and Austria,&quot; said Hitchman.\n\n&ldquo;I&rsquo;m thrilled to join Kobalt Label Services and help to develop and establish their new business in Germany, Switzerland and Australia (GSA). Working for KLS is an exciting opportunity as it presents a modern and fresh business approach to release records,&rdquo; added Keplin.  [Curt Keplin Quote In German: &ldquo;Ich freue mich Kobalt Label Services beizutreten und ihnen der Entwicklung und Etablierung ihres neuen Gesch&auml;ftsmodells in Deutschland, &Ouml;sterreich und der Schweiz mit Rat und Tat zur Seite zu stehen. Die moderne und innovative Herangehensweise von KLS Alben ver&ouml;ffentlichen ist eine spannende und aufregende Aufgabe.&quot;]\n\nAbout Kobalt Label Services (KLS)\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\n                                                # # #\n\nKobalt Music Group Contact:\nRebekah Alperin, +1.310.770.1045   rebekah.alperin@kobaltmusic.com\n"
]