[
"NEW YORK, NY (February 26, 2013) &ndash; Kobalt Music Group has appointed experienced digital marketing executive Karen Lieberman to the position of VP Digital Strategy and Marketing.\n\nReporting to both Richard Sanders, President of Kobalt Music Group, and Paul Hitchman, Managing Director of Kobalt Label Services, Lieberman will be based in New York and serve a global role that will benefit both Kobalt&rsquo;s music publishing and label services clients.\n\nBased in NYC, Lieberman comes to Kobalt from Sony Music Global Marketing where she was VP of Global Marketing and worked on many successful release campaigns for such artists as Foo Fighters, Bruce Springsteen, Jack White, Kelly Clarkson, and Foster the People among many others. Prior to Sony, she worked in digital marketing, sales and marketplace analysis roles at RCA Music Group, J Records and Island Def Jam.\n\nIn making the announcement Sanders said, &quot;As Kobalt continues to grow its client services around the world, Karen's expertise in all areas of social media, analytics and digital marketing is an invaluable asset to our writers, producers and artists.&rdquo;\n\n&ldquo;We are excited to have Karen joining the global Kobalt team. In addition to her responsibilities in digital marketing and strategy for Kobalt's label services clients, she&rsquo;ll be working on ways to drive innovation and maximize opportunities across digital platforms and social media for all Kobalt&rsquo;s clients,&rdquo; said Hitchman.\n\nIn addition to directing and implementing marketing campaigns for Kobalt Label Services, Lieberman will utilize her experience to support new initiatives that promote and expand revenue opportunities for Kobalt Music Publishing clients.\n\nRegarding her appointment, Lieberman said, &quot;I am thrilled to be a part of the team at Kobalt Music, where technology meets music and brings a unique and progressive approach to servicing the needs of clients.&quot;\n  \nAbout Kobalt Label Services (KLS)\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\n                                                        \nContact: Rebekah Alperin, Kobalt SVP Communications &amp; Marketing &ndash; Worldwide\nTel: +1.310.770.1045, e-Mail: rebekah.alperin@kobaltmusic.com"
]