[
"NICK CAVE &amp; THE BAD SEEDS SOAR TO NEW HEIGHTS WITH CHART-TOPPING GLOBAL RELEASE OF PUSH THE SKY AWAY WHICH DEBUTS TOP 4 IN 18 COUNTRIES (INCLUDING SEVEN #1s) \n\nNICK CAVE &amp; THE BAD SEEDS ALBUM ACHIEVES MAJOR GLOBAL SUCCESS AS THE FIRST RELEASE BY BOTH KOBALT LABEL SERVICES AND CAVE&rsquo;S OWN BAD SEED LABEL\n\nLONDON, UK (March 1, 2013) &ndash; A major hit out of the starting gate - the first international release for Kobalt Label Services (KLS), Nick Cave &amp; The Bad Seeds Push The Sky Away (Bad Seed Ltd. via KLS), has debuted at the tops of international album charts with six No.1 positions -- Australia (#1), Austria (#1), Belgium (#1), Holland (#1), Denmark (#1), New Zealand (#1), Portugal (#1). It also went Top 4 in the UK (#3), Germany (#2), Greece (#2), Norway (#2), Finland (#3), Poland (#2), Switzerland (#2), Sweden (#3), France (#4), Czech Republic (#3), and Ireland (#3). In North America, the album made impressive debuts in Canada (#20) and on The Billboard 200 (#29), the band&rsquo;s highest ever chart placing in the U.S. \n\nAs the must-have alternative record of this year, in the U.S. the critically-acclaimed album also went straight to #1 on Billboard&rsquo;s Current Alternative Chart as well as #1 on Billboard&rsquo;s Indy/Small Chains and #1 LP/Vinyl Albums Charts. First week U.S. sales of the album are up 50% on the band&rsquo;s prior two album releases. In Cave&rsquo;s original home territory of Australia, Push The Sky Away has become Nick Cave's first-ever No. 1, and in the U.K. the release experienced his highest chart placing and highest week one sales ever.\n\nBrian Message, from Nick Cave &amp; The Bad Seeds&rsquo; management company, ATC, said: &ldquo;It's been a fabulous week, a culmination of considerable effort and talent from many people, pulling together to deliver great art and effectively execute an ambitious global plan.  It's a big moment for all of us.&rdquo;\n\nAs Cave&rsquo;s first release on his own new label, Bad Seed Ltd., and KLS' first international release, this initial success is testament to both the extraordinary quality of Push The Sky Away, and the ability of Kobalt&rsquo;s unique, services-based approach to maximize the potential of clients&rsquo; releases globally, with a level of professionalism and creativity that is at least the equal of a traditional major record label. \n\nIn partnership with Bad Seed and management company, ATC, KLS formulated a campaign strategy that included both a high quality, diversified physical product mix including deluxe CD and special vinyl edition for indie stores, and an innovative digital sales and marketing campaign that leveraged the opportunities offered by partners including iTunes, YouTube, Spotify and Amazon. \n\nPaul Hitchman, MD of Kobalt Label Services, said: &ldquo;Nick, the band, and their tireless management team at ATC have been the ideal partners with whom to launch the Kobalt Label Services model, and have embraced the opportunities offered by our model to evidently great effect. I am hugely proud of the achievement of Kobalt&rsquo;s global label services team in helping to deliver such a great start to what we hope will be a long and successful campaign for this extraordinary record. I would also like to thank all of our partners globally who have combined with us to deliver such impressive chart positions around the world.&rdquo;\n\nPush The Sky Away was released simultaneously in more than 30 markets worldwide by KLS&rsquo; own in-house digital distribution platform (AWAL) and in partnership with KLS&rsquo; global network of physical distribution and marketing partners including Proper (UK, Eire), Alliance Entertainment (US), PIAS (France, Benelux), Rough Trade/Good To Go (GSA), Playground (Nordics), Popstock Everlasting (Spain, Portugal), Self/SpinGo  (Italy), Hostess (Japan), Mystic (Poland), and Sony (Canada, Greece), among others. \n\nFor the Direct to Consumer campaign, KLS worked closely with the band&rsquo;s e-commerce  partner Sandbag for sales via http://www.nickcave.com.\n\nAs part of the launch strategy for the album, Nick Cave &amp; The Bad Seeds performed the album in its entirety at intimate shows in London, Paris, Berlin and LA. The Los Angeles show held Feb. 21 at Fonda Theatre was webcast globally by Lovelive in partnership with Rockfeedback and YouTube, and promoted by media partners Pitchfork, The Guardian and Spotify.  More than 100,000 people viewed the performance stream.\n\nNick Cave &amp; The Bad Seeds tour globally throughout the year to support the record starting this week with three sold out nights at the Sydney Opera House. On March 12, Cave will be at SXSW for a special appearance in conversation with Larry Ratso Sloman and on March 13 the band will appear at Stubb&rsquo;s in Austin for NPR Music&rsquo;s SXSW showcase.\n\nCritics and tastemakers worldwide have hailed the record as an instant classic. Below are excerpts from recent album reviews around the globe:\n\n&ldquo;Not many rockstars become better as they age. Actually none of them do. But Nick Cave seems to achieve just that.&quot;\nDer Spiegel [GERMANY]\n\n&ldquo;Push the Sky Away may be broken into nine pieces, but the whole is paced like one magnificent 43-minute Nick Cave song: tense and mysterious at first, then increasingly full-blooded and lovely&quot; - NPR [USA]\n\n&quot;&hellip;predictably unpredictable in &quot;Push The Sky Away&quot;&hellip; an unshakeable feeling and a belief that rock 'n' roll &quot;gets you right down to your soul&quot; - LA TIMES [USA]\n\n&ldquo;They&rsquo;ve made their best album&rdquo; - THE INDEPENDENT [UK] &ndash; ALBUM OF THE WEEK 5*****\n\n&ldquo;A masterpiece&rdquo; - NME [UK]\n\n&quot;His excellent new album is full of cinematic detail and gorgeously dark sonic dread&quot; - ENTERTAINMENT WEEKLY, THE MUST LIST [USA]\n\n&quot;Push the Sky Away&quot; is yet another gem in a long string of fiercely literate offerings from the poet laureate of post-punk.&quot; - ASSOCIATED PRESS\n\n&quot;Push the Sky Away presents an uncharacteristically weightless, eerily atmospheric sound; we have foggy reveries built upon ominously rumbling bass lines, twitchy rhythmic tics, and hushed-voice intimations...&quot; - PITCHFORK\n\n&quot;the fundamental power of his music has been surprisingly steady for decades now. And so Push The Sky Away is merely one more very good album in a long, long string of them.&quot; &ndash; STEREOGUM - ALBUM OF THE WEEK\n\n&quot;Saint Nick has again given us vigorous spiritual sanctuary. We should thusly appreciate every note, every word, as if we were the hungry flock and it were the thousand loaves.&quot; &ndash; FILTER [USA]\n\n&quot;Push the Sky Away&quot; merges the erotic and the ominous in a cocoon of electronic loops, sparse keyboards, murmured voices, and post-3 a.m. narratives.&quot; - CHICAGO TRIBUNE [USA]\n\n&quot;captivating&quot; - BOSTON GLOBE [USA]\n\n&quot;Along with a special lyrical acuity comes some of the most textured music they've yet produced, making this latest album one of the strongest in the band's discography.&quot; &ndash; PASTE [USA]\n\n&quot;Seedy and slick, grandiose and intimate, mysterious and matter-of-fact, Nick Cave's songs unfold like his menacing lyrics and goose-prickling noir accompaniment have been refined to perfection on Push The Sky Away&quot; &ndash; CMJ [USA]\n\n&quot;As always, just beyond Cave's solemnity, there's wicked and lovely fun to be had.&quot; - SPIN\n\n&ldquo;Their most melodic and refined album to date&rdquo;- Telerama [France]\n\n&ldquo;With this album Nick Cave penned a classic record which is up there with his masters Bob Dylan and Leonard Cohen&rdquo; - La Stampa [Italy]\n\n                                                               # # #\n\nKLS/Kobalt Music Group Contact: Rebekah Alperin, SVP Communications/Marketing-Worldwide\n+1.310.770.1045  rebekah.alperin@kobaltmusic.com\n"
]