[
"NEW YORK, NY (February 26, 2013) - On the heels of its successful global release of Nick Cave &amp; The Bad Seeds' Push Sky Away (Bad Seed Ltd), Kobalt Label Services (KLS) has formally announced the opening of its NYC office and the hiring of experienced executive Shari Segalini to the position of SVP of Sales, North America.\n\nReporting to Paul Hitchman, Managing Director of Kobalt Label Services, Segalini, was previously VP of Field Sales at RED Distribution. Prior to RED Distribution she was a long-time VP of Sales at RCA Records. In her new position, Segalini will oversee retail sales campaigns for North America releases.\n\n&quot;We are very pleased to have Shari join the KLS team. From unknown and established artists to superstar talents, Shari has contributed to the success of artists in all genres and at all levels of development. Her deep experience and contacts will be a tremendous asset to Kobalt Label Services clients,&quot; said Hitchman.\n\n&quot;I feel extremely fortunate to be back on the label services side of the business and especially at a unique company like Kobalt. The ability to give the personal attention to each artist brings me a lot of gratification, as well as the satisfaction in knowing we have the structure here to provide each client with the most focused effort to help realize full potential of the release,&quot; added Segalini.\n\nAbout Kobalt Label Services (KLS)\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services.  Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n\n                                                        # # #\n\nContact: Rebekah Alperin, Kobalt SVP Communications &amp; Marketing &ndash; Worldwide\nTel: +1.310.770.1045, e-Mail: rebekah.alperin@kobaltmusic.com\n  "
]