[
"Los Angeles, CA and Sydney, Australia (March 5, 2013) &ndash; Disney Music Group (DMG) and Kobalt Music Publishing Australia (Kobalt) have concluded an exclusive agreement for Kobalt to become the official sub-publisher for DMG in Australia, New Zealand and associated APRA territories. \n\nKobalt will provide DMG with copyright administration, synch licensing and creative services, representing the songs owned by Disney&rsquo;s music publishing companies including the music from timeless major motion picture scores, themes and classics works from The Lion King, The Little Mermaid, Beauty and the Beast, Cinderella, and Toy Story among many others. \n\n&ldquo;I am thrilled and honored for Kobalt to be working with Disney Music Group. Not only are the Disney music catalogues historic with some of the most memorable and classic songs ever written, the energy and vibe of the people working for Disney is very exciting. The current talent associated with their numerous music companies is also continually on the cusp of generating popular hits that impact globally,&rdquo; said Willard Ahdritz, Founder and CEO of Kobalt Music Group.\n\n&ldquo;We are excited to partner with Kobalt. We have long been fans of their proactive and transparent approach to the music publishing business.  Willard and his team clearly see the future of the business and we are looking forward to the road ahead,&rdquo; said Ken Bunt, executive vice president, Disney Music Group.\n\nDeeply rooted in the history of the Walt Disney Company, the broad range of globally familiar catalog includes such memorable favorites as &ldquo;Mickey Mouse March,&rdquo; (The Mickey Mouse Club), &ldquo;A Whole New World&rdquo; (Aladdin), &ldquo;Beauty and the Beast&rdquo; (Beauty and the Beast), &ldquo;Can You Feel the Love Tonight&rdquo; (The Lion King), &ldquo;It&rsquo;s A Small World,&rdquo; &ldquo;Under the Sea&rdquo; (The Little Mermaid), &ldquo;Winnie the Pooh,&rdquo; (Winnie the Pooh), &ldquo;Circle of Life&rdquo; (The Lion King), &ldquo;A Dream Is a Wish Your Heart Makes&rdquo; (Cinderella), &ldquo;You&rsquo;ll Be In My Heart&rdquo; (Tarzan), &ldquo;Bibbidi-Bobbidi-Boo&rdquo; (Cinderella), &ldquo;The Bare Necessities&rdquo; (The Jungle Book), &ldquo;You&rsquo;ve Got a Friend in Me&rdquo; (Toy Story), &ldquo;Supercalifragilisticexpialidocious&rdquo; (Mary Poppins) and more.\n\nIn addition Disney&rsquo;s stellar roster of contemporary songwriters and artists includes Demi Lovato, Selena Gomez, Zendaya,  Matt Squire (writer of Yougblood Hawke's single &quot;We Come Running&quot; and Ke$ha's &quot;Dirty Love&quot;), John Fields, Adam Watts and &amp; Andy Dodd, Adrian Newman, Jay L-Oreal, Melissa Peirce, Nashville recording artist Caanan Smith, McClain Sisters, Bridgit Mendler, ZZ Ward, Coco Jones, Cole Plante, Grace Potter &amp; The Nocturnals, Redlight King, R5, and Stefano, among many others.\n\nSimon Moor, Managing Director of Kobalt Music Publishing Australia, commented: &ldquo;Disney's music is a touchstone in everyone's lives and for Kobalt Music Publishing Australia to be representing this amazing catalogue is very exciting. I look forward to working closely with Disney and believe that we will be able to provide both first class administration whilst creating new and exciting opportunities for their songs, writers and artists.&rdquo;\n\nAbout Disney Music Group\n\nDisney Music Group is home to Hollywood Records, Walt Disney Records and Disney Music Publishing.  The labels&rsquo; genre-spanning rosters include Selena Gomez, Demi Lovato, Grace Potter &amp; The Nocturnals, Lucy Hale, American Idol finalist Stefano, Coco Jones, R5, Bridgit Mendler, Plain White T&rsquo;s, Redlight King, ZZ Ward, and more.  DMG also releases family music and film and television soundtracks such as the Grammy-nominated soundtracks for The Muppets and Brave, as well as Avengers Assemble, Phineas and Ferb, A.N.T. Farm, Shake It Up, and  Wreck-It Ralph.  \n\nAbout Kobalt Music Publishing Australia\n\nKobalt Music Publishing Australia is part of the Kobalt Music Group Ltd. (Kobalt), the leading global, independent music publishing company and music services company, which offers unparalleled transparency, online copyright administration and royalty tracking, creative and synch/licensing services, weekly online balances, digital collections and advances to writers, publishers, performers and other rights holders. With over 180 employees in offices in London, New York, Nashville, Los Angeles, Berlin, Sydney and Stockholm, as well as agents in over 20 major territories, Kobalt administers more than 250,000 copyrights worldwide on behalf of over 1,200 content holders, including the world's top songwriters, artists and other music publishers. \n\n                                                      # # #\n\n\nDisney Music Contact:  Lillian Matulic, VP Publicity Disney Music Group\nTel 1.818.560.6197  e-Mail: lillian.matulic@disney.com\n\nKobalt Music Contact:  Rebekah Alperin, SVP Communications &amp; Marketing-Worldwide\nTel./Text +1.310.770.1045  e-Mail: rebekah.alperin@kobaltmusic.com  \n"
]