[
"LONDON (2 April 2013) &ndash; Kobalt Neighbouring Rights Ltd. (KNRL) has concluded an exclusive agreement with renowned artist, producer and composer Dave Stewart to manage his neighbouring rights, it was announced today by Willard Ahdritz, Founder and CEO of Kobalt Music Group (Kobalt), and Hans van Berkel, Executive Chairman of Kobalt Neighbouring Rights Ltd. (KNRL).\n\nThrough the new deal, which goes into effect immediately, KNRL will represent in the U.S. the legendary artist&rsquo;s entire repertoire, including all of his performances on master recordings, including Eurythmics, to find and have released the monies due to him from the respective neighbouring rights societies throughout the world. Beginning in October 2013, KNRL will additionally assume representation for Dave Stewart for the rest of the world. Stewart is also a worldwide music publishing client of Kobalt Music Group, parent company of KNRL.\n\n&quot;It's great working with a company that is completely transparent and has the artist's interest at heart. Willard and I have a shared vision,&quot; said Dave Stewart.\n\n&ldquo;I&rsquo;ve had the privilege of knowing Dave for years, and I&rsquo;m very proud to extend our relationship with him to include another one of the services Kobalt offers its clients,&rdquo; said Ahdritz.\n\nWith direct global collections and advanced technology, KNRL provides clients with complete transparency and numerous services that help speed up and simplify the complex process of managing &ldquo;Neighbouring Rights&rdquo; - the right that gives producers and performers in a commercially released recording remuneration for usages of a song in broadcasts, public performances, private copying, rental and lending, among other uses.\n\nDave Stewart is recognized as one of the most respected and accomplished talents in the music industry today.  Beyond his creative work as a musician, Stewart&rsquo;s music career spans three decades and more than 100 million album sales, highlighted by his collaboration with Annie Lennox in the groundbreaking pop-rock duo Eurythmics. Behind the scenes, he&rsquo;s produced albums and co-written songs for Bono, Bryan Ferry, Gwen Stefani, Tom Petty, Katy Perry, Mick Jagger, and Sinead O&rsquo;Connor, racking up numerous Producer, Songwriter, Golden Globe, and Grammy Awards along the way. As an entrepreneur, Stewart has established Weapons of Mass Entertainment (WME), a &quot;media company for the new world&quot; (LA Times), linking creative ideas to a host of projects in music, film, television, books, theatre, and new media.\n\n                                                               # # #\n\n\n\nKobalt Music Group/KNRL Contact: Rebekah Alperin, SVP Communications/Marketing&ndash;Worldwide\nTel/Text +1.310.770.1045 e-Mail: rebekah.alperin@kobaltmusic.com\n"
]