[
"April 12, 2013 (London)-- Multi-award winning British producer/DJ Maya Jane Coles, 25, ends months of speculation by revealing today that she will release her debut studio album &ldquo;Comfort&rdquo; on her own I/AM/ME label through a new global deal with Kobalt Label Services.\n\nColes said today: &ldquo;It's very exciting to be in charge of my debut album. Kobalt has given me total creative freedom and that is a necessity for me as an artist. The infrastructure is also there to support my music internationally so I look forward to seeing the response and hope that others will love the album just as much as I loved working on it.&rdquo;\n\nSet for release in July 2013, &ldquo;Comfort&rdquo; was produced, mixed, engineered and performed by Maya herself, with additional guest vocal performances. In support of the upcoming release, Maya has already booked to promote the album in 30 countries during 2013, with a string of high profile Ibiza shows including the Ushuaia opening party, and a festival schedule that includes every major festival in the world from the likes of Glastonbury (UK) and Fuji Rocks (Japan) through to Coachella (USA) where Maya will perform on both 14th  April 2013 &amp; 21st April 2013 respectively.\n\nMaya Jane Coles&rsquo; manager Steven Braines of The Weird &amp; The Wonderful / Crown Talent said of the deal: &quot;I think it's a very exciting model for both artist and management as it allows management to really empower the artist and their vision. Moreover, Kobalt can offer all the resources one needs to drive things both domestically and internationally combined with a commercial model that is perfectly aligned with the interests of the artist.&quot;\n\nPaul Hitchman, Managing Director of Kobalt Label Services, added: &ldquo;Maya is exactly the kind of artist client we want to be working with. She has an extraordinary talent combined with a clear vision of what she wants to achieve and an inspiring independence of spirit. We are truly excited by the opportunity of working with Maya and her management team.&quot;\nUnder her own name and the aliases She is Danger and Nocturnal Sunshine, Maya has remixed artists such as Massive Attack, Little Dragon, Florence &amp; The Machine, Gorillaz, Tricky, 2:54 and Lianne La Havas, as well as for labels such as Leftroom, Cross Town Rebels, and Get Physical.\n\nMaya has been featured on front covers of 14 international magazines including DJ Mag Weekly (UK), Groove (Germany), Mixmag (UK), Trax (France), Vicious (Spain) and Village Voice (USA), whilst also enjoying coverage in LA Times, Rolling Stone, Dazed and Confused, Fader, Clash, Spin, The Metro, The Guardian, Flaunt, ID, Nylon, The Sun, Village Voice, Vibe, Pitchfork, NYC Timeout and beyond.\n\nDuring 2012, Maya enjoyed compilation chart success around the globe with the release of her mix in the DJ Kicks series, which was named compilation of 2012 by both Mixmag and DJ Mag amongst others. With inclusions in the top 20 International DJs of 2012 polls, including placing: 9th in Resident Advisor (International), 5th in Mixmag (UK), no.1 in Timeout: London (UK) and 15th in Rolling Stone (USA), cementing her reputation as one of the world's best DJs.\n\nKobalt Label Services&rsquo; first international album release, &ldquo;Push The Sky Away&rdquo; by Nick Cave &amp; the Bad Seeds, recently debuted at number one in seven countries and top four in thirteen other countries. KLS has since announced the signing of the forthcoming album by Pet Shops Boys.\n\nAbout Kobalt Label Services (KLS)\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, sync licensing, D2C and social media services. Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt&rsquo;s proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.\n"
]