[
"(New York, NY) &ndash; Following appearances on The Today Show, The View, Kathie Lee &amp; Hoda, Watch What Happens Live with Andy Cohen, E! News, OMG! Insider, VH1, Fuse and others, New Kids on the Block&rsquo;s latest album 10 secured a Top 10 spot, debuting at #6 on Billboard&rsquo;s Top 200 chart, alongside impressive company such as Justin Timberlake, The Band Perry, and more. \n\nHaving sold over 50,000 albums in a week, 10 also debuted in the top ten across the globe including top markets such as Australia, Germany, Denmark, Finland, Greece, New Zealand, Canada, Mexico and Spain.  The album also took the #1 iTunes spot in Sweden.  The Pop supergroup, featuring Joey McIntyre, Donnie Wahlberg, Danny Wood and Jordan and Jonathan Knight, is adding more album sales to their already impressive stats of over 80 million records sold worldwide and back-to-back international #1 songs.\n\nIn 2008, the band released The Block, which debuted as the #1 Pop Album in the country and #2 overall on the Billboard Top 200 chart.  With the strong debut of 10, charting in the top 10, NKOTB has solidified their place in today&rsquo;s music scene.\n \nThe album, 10, has been receiving rave reviews, &ldquo;&hellip;puts to shame their contemporary counterparts,&rdquo; hailed Associated Press, continuing, &ldquo;this 12-track album separates the men from the boys in the musical arena. They sing with confidence&hellip;&rdquo; Confidence that secured their place at the top of the charts.\n\nAlso announced earlier this year on their total takeover of The View, NKOTB revealed plans of a 2013 summer headlining tour. Very special guests, multi-platinum selling artists 98 Degrees, and Grammy Award winning Boyz II Men, the best-selling R&amp;B group of all time, will be opening for NKOTB on their tour, aptly titled THE PACKAGE TOUR.  The tour kicks off on May 31st in Uncasville, CT and tickets can be purchased at www.ThePackage-Tour.com.\n\nPurchase the new album on iTunes and please visit www.ThePackage-Tour.com or Ticketmaster.com for up to date information or join the discussion at #thepackagetour.\n\nNew Kids On The Block has sold more than 80 million albums worldwide -- including back-to-back international #1 songs, 1988&rsquo;s Hangin&rsquo; Tough and 1990&rsquo;s Step By Step -- and a series of crossover smash R&amp;B, pop hits like &ldquo;You Got It (The Right Stuff),&rdquo;  &ldquo;Cover Girl,&rdquo; &ldquo;Didn&rsquo;t I (Blow Your Mind This Time),&rdquo; &ldquo;Hangin&rsquo; Tough,&rdquo; &ldquo;I&rsquo;ll Be Loving You,&rdquo; &ldquo;Step By Step&rdquo; and &ldquo;Tonight.&rdquo;  The group shattered concert box office records playing an estimated 200 concerts a year, in sold out stadiums throughout the world.  They still hold many of these records to date.  They were Forbes highest paid entertainers of 1990, beating out Michael Jackson and Madonna.  The band boasted an extensive and highly profitable merchandise line which included everything from lunch boxes and sleeping bags to comic books, marbles and dolls.  More Information is available at www.nkotb.com.\n\nAbout Kobalt Label Services (KLS)\n\nKobalt Label Services&rsquo; first international album release, &ldquo;Push The Sky Away&rdquo; by Nick Cave &amp; the Bad Seeds, recently debuted at number one in seven countries and top four in thirteen other countries. KLS has since announced the signing of the forthcoming album by Pet Shops Boys and Maya Jane Coles.\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides the next generation of services for artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, sync licensing, D2C and social media services. Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt&rsquo;s proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases."
]