[
"NEW YORK, NY  (April 15, 2013) &ndash; Kobalt Music Copyrights SARL (KMC), an entity advised by Kobalt Capital Ltd has acquired the rights to The B-52s song catalogue, it was announced today by Willard Ahdritz, Founder and CEO of Kobalt Music Group Ltd. (Kobalt), and Johan Ahlstr&ouml;m, CEO of Kobalt Capital Ltd. (KCL).\n\nThrough the deal, KMC assumes ownership of 100% of the band&rsquo;s music publishing rights. Additionally, the song catalogue is now being administered worldwide by Kobalt Music Group, the leading global independent music company.\n\nThe B-52s catalogue includes hundreds of classic party tunes such as &ldquo;Love Shack,&rdquo; &ldquo;Roam,&rdquo; &ldquo;Planet Claire,&rdquo; &ldquo;Rock Lobster,&rdquo; &ldquo;Channel Z,&rdquo; &ldquo;Good Stuff,&rdquo; &ldquo;Dance This Mess Around,&rdquo; &ldquo;Private Idaho,&rdquo; &ldquo;Legal Tender&rdquo; and &ldquo;Deadbeat Club&rdquo; among many other hits.\n\n&ldquo;We are very excited about our new relationship with Kobalt and believe this is the right home for the caretaking of our catalogue and the continued promotion and exposure of our music to new generations of fans around the world,&rdquo; said The B52s.\n\nUpon making the announcement, Ahdritz said: &ldquo;I am very happy to announce our acquisition of The B-52s catalogue. It&rsquo;s great, timeless music that everyone loves, and we are excited to bring the depth of this catalogue to a wider audience around the world.&rdquo;\n\n&ldquo;Our entire company is thrilled and proud to have concluded the acquisition of such unique and recognizable repertoire. We&rsquo;re especially privileged to be working closely with Kate, Fred, Cindy, and Keith in furthering the care and promotion of their musical legacy for generations to come,&rdquo; said Merril Wasserman-Serling, EVP Business Development of Kobalt Music Group.\n\nExecutives involved in the deal include: Willard Ahdritz; Johan Ahlstr&ouml;m; Merril Wasserman-Serling; Chip Petree of Copyright Exchange, LLC; attorney Josh Grier of Sloss Eckhouse LawCo; The B-52s business manager Dwight Wiles of Smith, Wiles &amp; Co., PC; attorney Wayne Rooks of Serling Rooks Ferrara McKoy &amp; Worob LLP; and Jim Arnay, SVP Business Affairs and US General Counsel of Kobalt Music Group.\n\nAbout Kobalt Capital Ltd.\n\nPart of the Kobalt Music Group and an FSA regulated and authorized investment advisor, Kobalt Capital Ltd. was formed in 2011 by Kobalt in order to respond to existing and new clients&rsquo; needs for bigger advances or part or whole acquisitions. In October 2012, Kobalt Capital Ltd. announced plans to invest up to 100M USD within 12 months with the backing of substantial capital resources backed by blue chip family office and other institutional investors.\n\nAbout Kobalt Music Group\n\nAs the leading global independent music services company, Kobalt Music Group is a Top 5 music publisher in most territories worldwide and already represents more than 250,000 copyrights worldwide on behalf of over 1,200 content holders. Kobalt counts among its clients top artists and songwriters such as Paul McCartney and MPL, Lady Antebellum, Dave Grohl, Pearl Jam, No Doubt, Max Martin, Kid Rock, Dr. Luke, Ryan Tedder, Benny Blanco, Shellback, Savan Kotecha, The Hives, Bj&ouml;rk, Alt-J, Richard Ashcroft, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Dave Stewart and Joss Stone, among many others. \n\n                                                            # # #\n\nKOBALT MUSIC GROUP CONTACT:\nRebekah Alperin, SVP Communications and Marketing-Worldwide\nE-Mail: rebekah.alperin@kobaltmusic.com     Tel: +1.310.770.1045\n\n"
]