[
"From the young age seven Michael was touring England as part of The Willock Family, he was also performing live on BBC and other local radio shows.   \n\nAfter meeting Bob Marley and the Wailers he felt encouraged and inspired to continue with his writing and singing career, and the story begins. \n\nMichael was lead vocalist and songwriter with Afrikan Star for five years, the group gained a strong following earning them support slots with Peter Tosh and a 22 date European tour, supporting bands such as UB40, Burning Spear, Toots and the Maytals, and Sly and Robbie.\n\nHe formed other bands Apple On The Drum with Jane Munro (Au Pairs) and End Of \nChat with Graham Hamilton (Fine Young Cannibals) and continued doing live radio and tours throughout Europe.  He has recorded in the best studios in England, including Jacob Studios, Virgin Townhouse and Island Records working with producers such as Tony Platt (former engineer/producer for Bob Marley &amp; the Wailers).  He formed another band Mau-Mau and signed a recording deal but later branched out to do his own thing.  He built a digital 24 Track recording studio, designed by Tony Platt, fully equipped for music composition, arrangement, Pre and Post production. He has also developed, recorded and produced a variety of artists and bands from classical, folk, RnB, Hip Hop, Reggae, Steel Band, Garage, also Nigerian and Asian artists. \n\nMichael worked with Steel Pulse and co-produced the album &lsquo;African Holocaust&rsquo;, which had a Grammy nomination December 2004. He went on to form Dubtransmissions Records and Transdub Publishing and has signed several up and coming artists.  His second single &ldquo;Can&rsquo;t Take My Eyes Off Of You&rdquo; was released in March 2005 and has been downloaded in 13 countries including USA, Japan and Europe.  He has since released &lsquo;Castle Skies&rsquo; in 2006, &ldquo;Urban Life&rdquo; featuring Yasuko in 2007, &ldquo;Soulmaker&rdquo; in 2008, &ldquo;Spin&rdquo; in 2010 and Perfect World in 2012. \n\nFor many years Michael has been writing, producing, mixing and mastering for the BBC &amp; Independent Television, Radio and Theatre companies.  He has written the opening and closing titles as well as songs for 3 BBC programmes &ldquo;Words and Pictures&rdquo;, &ldquo;Revista&rdquo; and &ldquo;The Black Britons&rdquo; and has recently done the sound design for an independent TV Pilot called &ldquo;Block&rdquo;.\n\nFrom 2009-10 he ran a weekly radio show on Rhubarb Radio on Saturdays called The Dubtransmissions Show, which highlighted reggae, dub and many derivatives and crossover styles.  It also promoted the work of local artists.  Michael has also been invited to Malta on a couple of occasions to deliver Vocal Training sessions on a one on one basis for artists on the Exotique Record Label.  This lead to working with artists for the 2011 Malta Eurovision Contest, for which he write and produced the song that came 8th in the national competition.\n\n"
]