[
"Early life\n\nBrion was born in Glen Ridge, New Jersey. He came from a musical family; his mother, LaRue, was an administrative assistant and singer, and his father, Keith Brion, was a band director at Yale.[1] His brother and sister became a composer/arranger and a violinist, respectively. Brion had difficulties at Hamden High School and at the age of 17 left education, opting instead to play music professionally. From 1980-85 Jon was part of the band The Excerpts, along with Stephen Harris, Dean Falcone, Jim Balga, Bobby Butcher &amp; Spike Priggen.\n\nSession work\nIn 1987, Brion moved to Boston, where he played solo gigs, formed the short-lived band World's Fair and became a member of the last touring version of Aimee Mann's new wave band 'Til Tuesday. He contributed guitar work to Jellyfish's 1993 album Spilt Milk, and in 1994, joined Dan McCarroll, Buddy Judge and Jellyfish guitarist Jason Falkner in the short-lived pop band The Grays. He also provided the signature pedal steel guitar part on The Wallflowers breakthrough album Bringing Down the Horse. Brion played numerous instruments on Sam Phillips' 1996 release Omnipop (It's Only A Fleshwound Lambchop). Brion is featured as keyboardist and drummer on Marianne Faithfull's 2003 album, Kissin' Time, and co-wrote a song, &quot;City of Quartz&quot;, for her next work, 2005's Before the Poison.\n\nProduction\nAfter being recognized as an accomplished session player, Brion branched out into production on then-girlfriend Mann's 1993 solo debut, Whatever, and its follow-up, I'm With Stupid. He has also produced albums by Fiona Apple, Rufus Wainwright, Eleni Mandell, Rhett Miller, Robyn Hitchcock, Brad Mehldau and Evan Dando.\n\nHe also co-produced Kanye West's Late Registration album in 2005.\n\nIn the fall of 2002, Brion began producing the album Extraordinary Machine with Fiona Apple, but she later brought in producers Mike Elizondo and Brian Kehew (a friend of Brion's) to complete the album. Brion's versions leaked onto the Internet, where the album gained a cult following long before its official release.\n\nBrion worked and performed on some of the tracks for Sean Lennon's 2006 album Friendly Fire. Lennon said that working with him was &quot;how I would imagine it&rsquo;s like to work with Prince. It&rsquo;s like having a weird alien prodigy in your room.&quot;\n\nMore recently, Brion has produced recordings by British pop performer Dido, Spoon, and Keane, as well as 2010's False Priest by Of Montreal. Brion also produced Best Coast's sophomore album which is schedule for release in early 2012.\n\nFilm scores\n\nBrion is an accomplished film composer, having started scoring by frequently working with director Paul Thomas Anderson, with whom he has a preferential working relationship. In addition to scoring many of his films, Brion contributed music to Boogie Nights and had a cameo in the film as a moustached guitar player.\n\nParticularly in his film soundtracks, Brion is noted for his use of early analog sampling instruments, particularly the Chamberlin and Optigan, to create near-realistic emulations of certain instruments.\n\nHe has earned a Best Score Soundtrack Album Grammy nominations for his work on 1999's Magnolia and 2004's Eternal Sunshine of the Spotless Mind.\n\nBrion was hired at the last minute to write the incidental music for The Break-Up. He has also scored the films and provided original music for I Heart Huckabees, Punch Drunk Love, Step Brothers (with help of fellow musician Chris Thile) and Synecdoche, NY. He also did live composition for a musical commentary on the Step Brothers DVD.\n\n\n\n\n"
]