[
"Richard Jankovich has been an active member of the music community as an artist, remixer, composter, producer and selector since 1999, when he founded his first nationally recognized act, Burnside Project, who signed to Bar/None Records in 2002. Burnside Project's 2003 release The Networks, The Circuits, The Streams, The Harmonies received high praise from mainstream publications (earning an A- in SPIN and inclusion on Rolling Stone&rsquo;s &ldquo;Hot List&rdquo;) and culminated in a Shortlist nomination (nominated by filmmaker Cameron Crowe.)  The album&rsquo;s signature track, &ldquo;Cue the Pulse to Begin,&rdquo; would become a hot commodity of sorts when it became first the theme for Showtime&rsquo;s Queer as Folk and later became a top 40 hit on Japanese radio (released on Sony.)  \nIn 2005, during a break from Burnside Project, Jankovich began remixing and producing for other artists including a remix of &ldquo;Into Space&rdquo; by Eskobar (v2) which were well received.  He adopted the nome-de-plume Pocket and began a 5 year run of remixes for the likes of Radiohead, Beck, Of Montreal, Joanna Newsom, Antony &amp; The Johnsons, Dirty On Purpose, Elk City, Kristin Hersh, Tigercity and more, all to critical acclaim from the likes of Pitchfork, Stereogum, NY Magazine, Brooklyn Vegan and more.  In 2012, Pocket released &quot;All Of This Happened&quot; (Tirk Recordings) a collaborative album whose guest vocalists comprise a who&rsquo;s-who of New Wave, Indie and Alternative singers from the 80s until today including Robyn Hitchcock, Craig Wedren (Shudder To Think), Steve Kilbey (The Church), Danny Seim (Menomena), Tanya Donelly (Belly), Yuki Chikudate (Asobi Seksu), Mark Burgess (The Chameleons UK) and more. \nAll the while, Jankovich has curated a career as a composer and selector of music for advertising and retail environments for clients like Intel, Volvo, Nasdaq, Nivea, ABC Network, AT&amp;T, The North Face, Sephora, John Varvatos, AMC (Mad Men) and many more.   Richard studied film music composition with the acclaimed faculty of NYU&rsquo;s graduate program and currently teaches music branding at Woodbury University and as part of USC&rsquo;s International branding program. \n"
]