{
"job_description": {
"display_date": "21 October 2014",
"position": "Production &amp; Inventory Management Coordinator",
"company_name": "Kobalt Label Services",
"location": "New York, NY",
"job_summary": "We are looking for a production and inventory management coordinator, who has experience dealing with entertainment software products.  The overall responsibility is to ensure that all audio/video assets and movements are properly input into our systems in order to ensure accuracy of reporting back to our Artist Clients.  ",
"background": "Kobalt creates technology solutions for a more transparent, efficient and empowering future for rights owners, where artists, songwriters, publishers and labels can trust they will be paid fairly and accurately, regardless of how complex the digital world becomes. Kobalt&rsquo;s innovative technology includes the world&rsquo;s most advanced global licensing, collection and payment platform, the YouTube song-claiming tool Proklaim, the global digital music distribution platform AWAL, and the award-winning real-time data and insight reporting Portal.\nKobalt&rsquo;s Music Publishing, Label Services and Neighbouring Rights divisions each offer a modern alternative to the traditional music business model, empowering creators with flexible contracts, ownership, control, and total transparency. With over 250 employees in offices around the world, Kobalt represents over 5,000 artists and songwriters, 600,000 songs and 500 publishing companies, servicing its clients with global licensing management, works and rights distribution, royalty collection and processing, online data and royalty statements, creative services, synch &amp; brand partnerships, record release management and marketing.\nKobalt works with some of the world&rsquo;s greatest artists and songwriters, representing on average over 40% of the top 100 songs and albums in both the US and UK. Kobalt has an 98.5% client retention rate, including Maroon 5, Lenny Kravitz, Dave Grohl, Max Martin, Bob Dylan, Pitbull, Ellie Goulding, Macklemore &amp; Ryan Lewis, One Republic, Simon &amp; Garfunkel, Passenger, Akon, Ryan Tedder, Paul McCartney and MPL Communications, Disney Music Group, Dr Luke, David Gray, Big &amp; Rich, Stevie Nicks, Gwen Stefani, Nick Cave and the Bad Seeds, Noah Shebib, Thom Yorke, The Hives, The Lumineers, Richard Ashcroft, Bj&amp;ouml;rk, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Joss Stone and the Miles Davis catalog among many others.\n",
"job_duties": {
"duties": [
"Ensure all the costs and movements required to manufacture, receive, ship and maintain the physical inventory of products with various partners is captured in our system in order to properly report internally and externally",
"Asset management &ndash; Support the Manager of Administration with data entry",
"Organize and circulate acquired assets to the Company  (i.e. audio files, artwork, label copy)",
"Liaise with product manager to oversee the creation and fulfillment of promotional products",
"Stock Movement Management - With direction from the SVP OF Sales, enter pertinent product information in Kobalt&rsquo;s  tracking system",
"Request and input stock movement for various partners from vendor/distributor by creating Purchase Orders.",
"Oversee invoicing from manufacturers and vendors to ensure accuracy and timely processing",
"Track product sent for venue or web sales ",
"Supply artist management with appropriate venue settlement sheet",
"Collect and input weekly venue sales into Soundscan (industry&rsquo;s  sales reporting system)",
"Assist in reconciling monthly US Distribution statements  "
]
},
"skills_experience": {
"skills": [
"Knowledge of digital and physical audio production assets and/or metadata  is a plus.  This position requires extreme attention to detail and accuracy, with a strong emphasis on meeting deadlines",
"High level of organizational skills and follow up, plus the ability to work at a high level of performance over a sustained period of time is a must  ",
"Practical experience of working in a relevant role dealing with inventory management",
"Strong Microsoft Office skills including Outlook and Excel",
"Will be trained in in-house system but experience with databases is preferred",
"Good people skills, and ability to communicate effectively with external third parties",
"Proactive self-starter who is both reliable and willing to take responsibility ",
"Obsessive attention to detail",
"Highly skilled with numbers and IT literate",
"Ability to set and consistently meet deadlines ",
"Professional demeanor and pride in the accuracy and efficiency of their work"
]
},
"application_process": {
"details": [
{
"description": "Please send your resume with a cover letter to",
"email": "ny.jobs@Kobaltmusic.com"
}
]
},
"start_date": {
"date": "Immediate"
},
"status": "Permanent"
}
}
