{
"job_description": {
"display_date": "21 October 2014",
"position": "International Product Manager",
"company_name": "Kobalt Label Services",
"location": "London, UK",
"job_summary": "Kobalt Label Services is looking for an International Product Manager, based out of our London office. The role will involve working with the Label Services team as well as our network of International label managers, distribution partners and licensees to plan, implement &amp; deliver successful international marketing promotion campaigns.",
"background": "Kobalt creates technology solutions for a more transparent, efficient and empowering future for rights owners, where artists, songwriters, publishers and labels can trust they will be paid fairly and accurately, regardless of how complex the digital world becomes. Kobalt&rsquo;s innovative technology includes the world&rsquo;s most advanced global licensing, collection and payment platform, the YouTube song-claiming tool Proklaim, the global digital music distribution platform AWAL, and the award-winning real-time data and insight reporting Portal.\nKobalt&rsquo;s Music Publishing, Label Services and Neighbouring Rights divisions each offer a modern alternative to the traditional music business model, empowering creators with flexible contracts, ownership, control, and total transparency. With over 250 employees in offices around the world, Kobalt represents over 5,000 artists and songwriters, 600,000 songs and 500 publishing companies, servicing its clients with global licensing management, works and rights distribution, royalty collection and processing, online data and royalty statements, creative services, synch &amp; brand partnerships, record release management and marketing.\nKobalt works with some of the world&rsquo;s greatest artists and songwriters, representing on average over 40% of the top 100 songs and albums in both the US and UK. Kobalt has an 98.5% client retention rate, including Maroon 5, Lenny Kravitz, Dave Grohl, Max Martin, Bob Dylan, Pitbull, Ellie Goulding, Macklemore &amp; Ryan Lewis, One Republic, Simon &amp; Garfunkel, Passenger, Akon, Ryan Tedder, Paul McCartney and MPL Communications, Disney Music Group, Dr Luke, David Gray, Big &amp; Rich, Stevie Nicks, Gwen Stefani, Nick Cave and the Bad Seeds, Noah Shebib, Thom Yorke, The Hives, The Lumineers, Richard Ashcroft, Bj&amp;ouml;rk, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Joss Stone and the Miles Davis catalog among many others.",
"job_duties": {
"duties": [
"Work closely with the Head of International to set up and run International Marketing Campaigns for the KLS roster",
"Construct &amp; Implement Global Marketing Plans &amp; Strategies ",
"Manage territorial budgets &amp; set sales targets with international partners",
"Schedule promo trips and phoner schedules for KLS artists",
"Generate campaign reports",
"Oversee the collection of orders for promotional items and sales figures from our international network",
"Build and maintain good working relationships with KLS's international network of label managers, distribution partners, licensees and promo companies",
"Distribute assets &amp; tools to the international teams",
"Liaise closely with the UK &amp; US marketing teams to co-ordinate worldwide plans"
]
},
"skills_experience": {
"skills": [
"A minimum of 3 years experience working in the International Department of a record label &amp; a minimum of 5 years working in the music industry",
"A very good understanding of International markets, retail, digital &amp; media outlets is essential",
"Experience working closely with artists &amp; managers",
"You must be highly organised &amp; able to prioritise",
"Ability to build and maintain relationships with international partners"
]
},
"application_process": {
"details": [
{
"description": "Please send CV and cover letter to",
"email": "KLSjobs@kobaltmusic.com"
}
]
},
"start_date": {
"date": "Immediate"
},
"closing_date": {
"date": "31 October 2014"
},
"salary": {
"message": "Negotiable depending upon experience"
},
"status": "Permanent"
}
}
