{
"job_description": {
"display_date": "30 October 2014",
"position": "Marketing Director",
"company_name": "Kobalt Label Services",
"location": "Los Angeles, CA",
"job_summary": "Kobalt Label Services (KLS) is looking for an experienced Marketing Director to be based in the Kobalt office in Los Angeles, and to work with the Label Services team to provide services to KLS' artist and label clients.  The Marketing Director will work closely with our Client Management, Marketing and Retail Sales teams and will be responsible for the coordination of KLS releases in North America.",
"background": "\nKobalt creates technology solutions for a more transparent, efficient and empowering future for rights owners, where artists, songwriters, publishers and labels can trust they will be paid fairly and accurately, regardless of how complex the digital world becomes. Kobalt&rsquo;s innovative technology includes the world&rsquo;s most advanced global licensing, collection and payment platform, the YouTube song-claiming tool Proklaim, the global digital music distribution platform AWAL, and the award-winning real-time data and insight reporting Portal.\nKobalt&rsquo;s Music Publishing, Label Services and Neighbouring Rights divisions each offer a modern alternative to the traditional music business model, empowering creators with flexible contracts, ownership, control, and total transparency. With over 250 employees in offices around the world, Kobalt represents over 5,000 artists and songwriters, 600,000 songs and 500 publishing companies, servicing its clients with global licensing management, works and rights distribution, royalty collection and processing, online data and royalty statements, creative services, synch &amp; brand partnerships, record release management and marketing.\nKobalt works with some of the world&rsquo;s greatest artists and songwriters, representing on average over 40% of the top 100 songs and albums in both the US and UK. Kobalt has an 98.5% client retention rate, including Maroon 5, Lenny Kravitz, Dave Grohl, Max Martin, Bob Dylan, Pitbull, Ellie Goulding, Macklemore &amp; Ryan Lewis, One Republic, Simon &amp; Garfunkel, Passenger, Akon, Ryan Tedder, Paul McCartney and MPL Communications, Disney Music Group, Dr Luke, David Gray, Big &amp; Rich, Stevie Nicks, Gwen Stefani, Nick Cave and the Bad Seeds, Noah Shebib, Thom Yorke, The Hives, The Lumineers, Richard Ashcroft, Bj&amp;ouml;rk, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Joss Stone and the Miles Davis catalog among many others\n",
"job_duties": {
"duties": [
"Providing feedback regarding the sales potential of proposed KLS releases in the US ",
"Generating the marketing plan, marketing budget and sales targets for each KLS release in the US",
"Sourcing potential marketing and promotion partners in the US for PR, promotion, media buying etc.",
"Coordinating with external marketing partners and agencies ",
"Coordination with the US physical distribution partner (Alliance) and KLS retail sales team, regarding retail sales and promotions with retailers, and regarding stock control ",
"Coordination with client managers regarding planning, scheduling, approvals etc.",
"Regular ongoing liaison with other company departments regarding implementation of marketing plans against budget, assessment of partner performance and review of targets ",
"Generating marketing campaign reports"
]
},
"skills_experience": {
"skills": [
"Minimum 5+ years&rsquo; experience in the US music industry, ideally within a successful record label environment ",
"Experienced in overview and coordination of both digital and physical record release campaigns",
"Strong organizational, project management and analytical skills ",
"Good understanding of the music industry, and strong relationships across the industry including media, retail and promotions companies.",
"Collaborative spirit and positive attitude"
]
},
"application_process": {
"details": [
{
"description": "Please send your resume and salary requirements to",
"email": "NY.Jobs@Kobaltmusic.com"
}
]
},
"start_date": {
"date": "Immediate"
},
"status": "Permanent"
}
}
