{
"job_description": {
"display_date": "16 November 2014",
"position": "Digital Account Manager",
"company_name": "Kobalt Label Services",
"location": "New York, NY",
"job_summary": "We are looking for a Digital Account Manager to manage our day to day relationships with key digital accounts domestically and in selected international territories. The ideal candidate will have broad knowledge of rapidly changing digital markets, experience in digital sales strategy, and good overview of supply chain best practices.\nWorking as part of Operations and Distribution, the position will also entail working closely with Marketing and Sales departments, on bespoke release campaign strategies and coordinating priority release schedules.",
"background": "Kobalt creates technology solutions for a more transparent, efficient and empowering future for rights owners, where artists, songwriters, publishers and labels can trust they will be paid fairly and accurately, regardless of how complex the digital world becomes. Kobalt&rsquo;s innovative technology includes the world&rsquo;s most advanced global licensing, collection and payment platform, the YouTube song-claiming tool Proklaim, the global digital music distribution platform AWAL, and the award-winning real-time data and insight reporting Portal.\nKobalt&rsquo;s Music Publishing, Label Services and Neighbouring Rights divisions each offer a modern alternative to the traditional music business model, empowering creators with flexible contracts, ownership, control, and total transparency. With over 250 employees in offices around the world, Kobalt represents over 5,000 artists and songwriters, 600,000 songs and 500 publishing companies, servicing its clients with global licensing management, works and rights distribution, royalty collection and processing, online data and royalty statements, creative services, synch &amp; brand partnerships, record release management and marketing.\nKobalt works with some of the world&rsquo;s greatest artists and songwriters, representing on average over 40% of the top 100 songs and albums in both the US and UK. Kobalt has an 98.5% client retention rate, including Maroon 5, Lenny Kravitz, Dave Grohl, Max Martin, Bob Dylan, Pitbull, Ellie Goulding, Macklemore &amp; Ryan Lewis, One Republic, Simon &amp; Garfunkel, Passenger, Akon, Ryan Tedder, Paul McCartney and MPL Communications, Disney Music Group, Dr Luke, David Gray, Big &amp; Rich, Stevie Nicks, Gwen Stefani, Nick Cave and the Bad Seeds, Noah Shebib, Thom Yorke, The Hives, The Lumineers, Richard Ashcroft, Bj&amp;ouml;rk, Kelly Clarkson, Gotye, Skrillex, Herbie Hancock, Moby, Kid Cudi, Joss Stone and the Miles Davis catalog among many others.\n\nPart of the Kobalt Music Group, Kobalt Label Services (KLS) provides services to artists and labels worldwide, empowering recording owners with a full-service solution to releasing and marketing records while maintaining ownership of their masters. Established as an alternative to the traditional label model, KLS maximizes client opportunities and revenues from a wide range of global digital retail, traditional physical retail, audio and video streaming, synch licensing, D2C and social media services. Clients benefit from Kobalt expertise in multi-rights management, the security and trust of Kobalt's proven and transparent royalty accounting, advanced data analytics and experienced staff to co-ordinate and manage releases.Digital distribution for Kobalt Label Services is provided by our AWAL Platform, acquired by Kobalt 2011.\nFor more information, go to: www.kobaltmusic.com. www.awal.com\n",
"job_duties": {
"duties": [
"Secure retail placement and feature opportunities",
"Work with Product and Marketing Managers to gather and organise all information required to properly market releases to digital retailers and services",
"Produce regular internal company updates, sales analysis, marketing highlights and news",
"Build and maintain strong  DSP partner relationships",
"Successful execution of retail marketing campaigns across all target platforms",
"Maintain knowledge of global account deal points, price points and retail marketing programmes",
"Work with Business Development and Operations teams on new Account relationships",
"Review business relationships on a regular basis from a marketing, technical and financial basis"
]
},
"skills_experience": {
"skills": [
"Minimum 2 years music industry Digital Account Management experience",
"Working knowledge of the digital music market and digital music trends",
"A genuine passion for music.",
"Knowledge of digital and physical audio production assets and/or metadata ",
"High level of organizational skills and follow up, plus the ability to work at a high level of performance over a sustained period of time is a must",
"Strong Microsoft Office skills including Outlook and Excel ,PowerPoint or Keynote",
"Will be trained in in-house system but experience with databases is preferred",
"Good people skills, and ability to communicate effectively with external third parties",
"Proactive self-starter who is both reliable and willing to take responsibility",
"Obsessive attention to detail",
"Ability to set and consistently meet deadlines",
"Professional demeanor and pride in the accuracy and efficiency of their work"
]
},
"application_process": {
"details": [
{
"description": "Please send your resume with a cover letter to",
"email": "ny.jobs@Kobaltmusic.com"
}
]
},
"start_date": {
"date": "Immediate"
},
"status": "Permanent"
}
}
