{
"job_description": {
"display_date": "06 January 2015",
"position": "Digital Marketing",
"company_name": "Kobalt Label Services",
"location": "New York, NY",
"job_summary": "Responsibilities will include managing key artist projects across the digital space, forging strong relationships with online and mobile partners, blogs and services. The ideal candidate&rsquo;s specialty lies in executing marketing campaigns that build audiences, engage fans, increase exposure and drive sales for our new releases. He or she will be eager to roll up their sleeves and will thrive in a fast-paced environment at a rapidly developing company. ",
"job_duties": {
"duties": [
"Maintaining multiple project timelines and social marketing campaigns",
"Managing content and posting calendars for key projects",
"Implementing fan engagement campaigns and assessing social media reach ",
"Compiling digital  updates &amp; fanbase assessments for KLS clients",
"Regular campaign reporting for KLS clients (including advertising recaps, Google Analytics, social media growth, data analysis, contest summaries, et cetera) ",
"Managing smartURLs, tracking CTRs and conversions ",
"Liaising with publicists in regards to content placement and rollouts with media partners ",
"Building and maintaining the team&rsquo;s digital media partner lists ",
"Quantifying success of online promotions and partners via tracking systems (i.e., Buzzdeck, Next Big Sound, SmartURL)",
"Executing online advertising campaigns across a number of platforms - including Facebook, Twitter, YouTube, and Google",
"Creating bespoke advertising assets for clients",
"Assisting team with creation and cultivation of content and promotional tools",
"Monitoring online spends and updating budgets "
]
},
"skills_experience": {
"skills": [
"Minimum 5 years online marketing experience ",
"Strong social media expertise",
"Excellent oral and written communication skills",
"Experience making standard DNS record changes and updates ",
"Knowledge of Photoshop and HTML",
"Working knowledge of Photoshop and Illustrator",
"Comfort working with and making changes to HTML and CSS",
"Must be well-organized and able to support many projects at once with tight deadlines",
"Ability to invent and execute innovative ideas",
"Understanding of how to effectively integrate e-commerce and monetization into campaigns",
"Passion for staying on top of all digital trends, mastering new online and mobile services and maximizing them for the company's business",
"Strong attention to detail",
"Analytical mindset, strong interest and attention to detail when working with data",
"Customer service oriented",
"Well versed in the Facebook Ads platform &amp; Google Adwords",
"Experience with the YouTube CMS and nowledge of video editing software a plus",
"Must thrive in a global team environment",
"Candidate must have strong computer knowledge, experience with various social applications, and excellent knowledge and understanding of internet culture and trends ",
"Experience working directly with artists and managers and being confident and comfortable when working directly with artists and managers to discuss and craft digital campaigns. "
]
},
"application_process": {
"details": [
{
"description": "Please send your resume with a cover letter to",
"email": "ny.jobs@Kobaltmusic.com"
}
]
},
"start_date": {
"date": "Immediate"
},
"status": "Permanent"
}
}
