{
"job_description": {
"display_date": "06 January 2015",
"position": "HR Coordinator",
"company_name": "Kobalt Music Group",
"location": "New York, NY",
"job_summary": "Kobalt Music Group is looking for an HR Coordinator to get involved in all aspects of HR.  The individual will have the opportunity to work closely with all levels of management and support over 200 global employees. We are looking for an enthusiastic, bright and organized person to support our efforts to build a top tier, global HR function.  This person will have the opportunity to gain experience with all aspects of Human Resources as we build the HR function within this rapidly growing and exciting Company. ",
"job_duties": {
"duties": [
"Provide recruiting support from inception to hire including writing job descriptions, posting jobs, screening candidates, referring candidates to departments, interacting with agencies, checking references, scheduling interviews, responding to all candidates, drafting offer letters and overseeing the new hire process including onboarding new hires. ",
"Research and support development and execution of new HR programs including performance management, training, internal communications, onboarding, etc.  ",
"Assist with development and distribution of employee handbooks and administrative tools (i.e. reception guides, a to z of Kobalt, etc.)",
"Work on internal communication plan that reinforces Company values and supports a positive culture",
"Administrative aspects will include:  maintaining employee files, generating excel spreadsheets to track information, maintaining a contract database and tracking contract expirations, expense reports, etc.  ",
"Research and present information on HR trends and make suggestions based on research.",
"Produce Global org charts and reports (i.e. Churn report, monthly stats globally, contract expiration reports)",
"Assist with budgeting process, providing reports and analysis of information",
"Oversee internship program",
"Special projects as needed."
]
},
"skills_experience": {
"skills": [
"2 plus years HR/administrative experience",
"Strong proficiency in all Microsoft Office programs required; experience with HRIS systems preferred",
"Experience using the internet/social media tools in an HR environment is a plus",
"Ability to work independently, handle multiple projects, adapt to changing priorities and deal with stress",
"Strong verbal, written and interpersonal communication skills",
"Strong organizational skills and ability to be resourceful are imperative",
"Great initiative with the ability to be collaborative demonstrate strong judgment, professionalism and poise",
"Must maintain the highest level of confidentiality ",
"Comfortable working in a fast paced &amp; evolving environment",
"College degree preferred"
]
},
"application_process": {
"details": [
{
"description": "Please send your resume with a cover letter to",
"email": "ny.jobs@Kobaltmusic.com"
}
]
},
"start_date": {
"date": "Immediate"
},
"status": "Permanent"
}
}
