{
"job_description": {
"display_date": "09 January 2015",
"position": "Executive Assistant",
"company_name": "Kobalt Music Group",
"location": "New York, NY",
"job_summary": "We are looking for a bright, detail-oriented and organized administrative assistant to support our Business Affairs department.  This person will have the opportunity to learn the legal aspects of the music business and liaise with many other departments within Kobalt Music Group.",
"job_duties": {
"duties": [
"Provide administrative support to the Business Affairs team (currently comprised of 3 attorneys) including:  sending out agreements to be executed, tracking the status of such agreements and handling correspondence.",
"Contract processing duties, such as assisting in the drafting of summaries for finalized contracts, ensuring that each agreement is scanned into the system and properly filed, sending out relevant email notifications to the staff and returning fully executed originals to clients.",
"Input deal status information into SalesForce system &amp; access such information as needed.",
"Raise purchase orders and track payments as necessary.",
"Provide expense reports.",
"General office duties.",
"Special projects as requested."
]
},
"skills_experience": {
"skills": [
"Bachelor&rsquo;s degree from an accredited four year college or university.",
"Strong proficiency in all Microsoft Office programs required",
"Ability to work independently, handle multiple projects, adapt to changing priorities and deal with stress",
"Strong verbal, written and interpersonal communication skills",
"Strong organizational skills; attention to detail is a must",
"Must maintain the highest level of confidentiality ",
"Comfortable working in a fast paced &amp; evolving environment",
"Ability to work overtime when necessary",
"Knowledge of music publishing and the music business strongly preferred"
]
},
"application_process": {
"details": [
{
"description": "Please send your resume with a cover letter to",
"email": "ny.jobs@Kobaltmusic.com"
}
]
},
"start_date": {
"date": "Immediately"
},
"status": "Permanent"
}
}
